[NoCoverage] BlockStatement
src/integrity/build.ts:29:96
 import { outputsPath, provenancePath } from "./paths.ts";
 import type { BuildProvenance, OutputsFile } from "./types.ts";
 
-export async function collectBuildOutputs(cwd: string, distDir = "dist"): Promise<OutputsFile> {
-  const buildId = new Date().toISOString().replace(/[:.]/g, "-");
-  const outputs: Record<string, string> = {};
-  const files = await discoverDistFiles(cwd, distDir);
-  for (const file of files) {
-    outputs[file] = await byteHashFile(path.join(cwd, file));
-  }
-  return { buildId, outputs };
-}
+export async function collectBuildOutputs(cwd: string, distDir = "dist"): Promise<OutputsFile> {}
 
 export async function buildInputsDigest(cwd: string): Promise<string> {

[NoCoverage] StringLiteral
src/integrity/build.ts:30:61
 import type { BuildProvenance, OutputsFile } from "./types.ts";
 
 export async function collectBuildOutputs(cwd: string, distDir = "dist"): Promise<OutputsFile> {
-  const buildId = new Date().toISOString().replace(/[:.]/g, "-");
+  const buildId = new Date().toISOString().replace(/[:.]/g, "");
   const outputs: Record<string, string> = {};
   const files = await discoverDistFiles(cwd, distDir);

[NoCoverage] BlockStatement
src/integrity/build.ts:33:29
   const buildId = new Date().toISOString().replace(/[:.]/g, "-");
   const outputs: Record<string, string> = {};
   const files = await discoverDistFiles(cwd, distDir);
-  for (const file of files) {
-    outputs[file] = await byteHashFile(path.join(cwd, file));
-  }
+  for (const file of files) {}
   return { buildId, outputs };
 }

[NoCoverage] BlockStatement
src/integrity/build.ts:39:71
   return { buildId, outputs };
 }
 
-export async function buildInputsDigest(cwd: string): Promise<string> {
-  const files = await discoverManagedFiles(cwd);
-  const entries = await Promise.all(
-    files.map(async (file) => `${file}\t${await byteHashFile(path.join(cwd, file))}`),
-  );
-  const combined = entries.join("\n");
-  return byteHash(combined);
-}
+export async function buildInputsDigest(cwd: string): Promise<string> {}
 
 export async function createBuildProvenance(args: {

[NoCoverage] ArrowFunction
src/integrity/build.ts:42:15
 export async function buildInputsDigest(cwd: string): Promise<string> {
   const files = await discoverManagedFiles(cwd);
   const entries = await Promise.all(
-    files.map(async (file) => `${file}\t${await byteHashFile(path.join(cwd, file))}`),
+    files.map(() => undefined),
   );
   const combined = entries.join("\n");

[NoCoverage] BlockStatement
src/integrity/build.ts:52:30
   cwd: string;
   builder: string;
   outputs: OutputsFile;
-}): Promise<BuildProvenance> {
-  const started = new Date().toISOString();
-  const outputsDigest = byteHash(JSON.stringify(args.outputs.outputs));
-  const inputsDigest = await buildInputsDigest(args.cwd);
-  const finished = new Date().toISOString();
-
-  return {
-    buildId: args.outputs.buildId,
-    sourceRepo: (await getRepoUrl(args.cwd)) ?? "unknown",
-    sourceCommit: (await getHeadSha(args.cwd)) ?? "unknown",
-    builder: args.builder,
-    buildStartedAt: started,
-    buildFinishedAt: finished,
-    inputsDigest,
-    outputsDigest,
-  };
-}
+}): Promise<BuildProvenance> {}
 
 export async function writeBuildArtifacts(args: {

[NoCoverage] ObjectLiteral
src/integrity/build.ts:58:10
   const inputsDigest = await buildInputsDigest(args.cwd);
   const finished = new Date().toISOString();
 
-  return {
-    buildId: args.outputs.buildId,
-    sourceRepo: (await getRepoUrl(args.cwd)) ?? "unknown",
-    sourceCommit: (await getHeadSha(args.cwd)) ?? "unknown",
-    builder: args.builder,
-    buildStartedAt: started,
-    buildFinishedAt: finished,
-    inputsDigest,
-    outputsDigest,
-  };
+  return {};
 }
 

[NoCoverage] LogicalOperator
src/integrity/build.ts:60:17
 
   return {
     buildId: args.outputs.buildId,
-    sourceRepo: (await getRepoUrl(args.cwd)) ?? "unknown",
+    sourceRepo: (await getRepoUrl(args.cwd)) && "unknown",
     sourceCommit: (await getHeadSha(args.cwd)) ?? "unknown",
     builder: args.builder,

[NoCoverage] StringLiteral
src/integrity/build.ts:60:49
 
   return {
     buildId: args.outputs.buildId,
-    sourceRepo: (await getRepoUrl(args.cwd)) ?? "unknown",
+    sourceRepo: (await getRepoUrl(args.cwd)) ?? "",
     sourceCommit: (await getHeadSha(args.cwd)) ?? "unknown",
     builder: args.builder,

[NoCoverage] LogicalOperator
src/integrity/build.ts:61:19
   return {
     buildId: args.outputs.buildId,
     sourceRepo: (await getRepoUrl(args.cwd)) ?? "unknown",
-    sourceCommit: (await getHeadSha(args.cwd)) ?? "unknown",
+    sourceCommit: (await getHeadSha(args.cwd)) && "unknown",
     builder: args.builder,
     buildStartedAt: started,

[NoCoverage] BlockStatement
src/integrity/build.ts:74:19
   cwd: string;
   outputs: OutputsFile;
   provenance: BuildProvenance;
-}): Promise<void> {
-  await writeJsonFile(outputsPath(args.cwd), args.outputs);
-  await writeJsonFile(provenancePath(args.cwd), args.provenance);
-}
+}): Promise<void> {}
 
