[NoCoverage] ConditionalExpression
src/integrity/compass-audit-helpers.ts:33:7
   const paths = await loadPathsCurrent(cwd);
   const entityId = paths[repoPath];
 
-  if (entityId) {
+  if (false) {
     const entities = await loadEntitiesById(cwd);
     const entity = entities[entityId];

[NoCoverage] ConditionalExpression
src/integrity/compass-audit-helpers.ts:33:7
   const paths = await loadPathsCurrent(cwd);
   const entityId = paths[repoPath];
 
-  if (entityId) {
+  if (true) {
     const entities = await loadEntitiesById(cwd);
     const entity = entities[entityId];

[NoCoverage] ConditionalExpression
src/integrity/compass-audit-helpers.ts:36:9
   if (entityId) {
     const entities = await loadEntitiesById(cwd);
     const entity = entities[entityId];
-    if (entity) {
+    if (false) {
       let contentHash = entity.contentHash;
       // Compute live hash if the file exists

[NoCoverage] BlockStatement
src/integrity/compass-audit-helpers.ts:36:17
   if (entityId) {
     const entities = await loadEntitiesById(cwd);
     const entity = entities[entityId];
-    if (entity) {
-      let contentHash = entity.contentHash;
-      // Compute live hash if the file exists
-      try {
-        const abs = resolve(cwd, repoPath);
-        const content = await readFile(abs, "utf8");
-        contentHash = "sha256-" + createHash("sha256").update(content).digest("hex");
-      } catch {
-        // keep registry hash
-      }
-      return {
-        revision: entity.revision,
-        entityId,
-        contentHash,
-      };
-    }
+    if (entity) {}
   }
 

[NoCoverage] BlockStatement
src/integrity/compass-audit-helpers.ts:39:11
     if (entity) {
       let contentHash = entity.contentHash;
       // Compute live hash if the file exists
-      try {
-        const abs = resolve(cwd, repoPath);
-        const content = await readFile(abs, "utf8");
-        contentHash = "sha256-" + createHash("sha256").update(content).digest("hex");
-      } catch {
+      try {} catch {
         // keep registry hash
       }

[NoCoverage] BlockStatement
src/integrity/compass-audit-helpers.ts:57:7
   // Fallback: compute revision from git history
   const revision = await getFileRevisionFromHistory(cwd, repoPath);
   let contentHash = "";
-  try {
-    const abs = resolve(cwd, repoPath);
-    const content = await readFile(abs, "utf8");
-    contentHash = "sha256-" + createHash("sha256").update(content).digest("hex");
-  } catch {
+  try {} catch {
     // file may not exist
   }

[NoCoverage] StringLiteral
src/integrity/compass-audit-helpers.ts:59:41
   let contentHash = "";
   try {
     const abs = resolve(cwd, repoPath);
-    const content = await readFile(abs, "utf8");
+    const content = await readFile(abs, "");
     contentHash = "sha256-" + createHash("sha256").update(content).digest("hex");
   } catch {
