[NoCoverage] BlockStatement
src/integrity/discover.ts:24:76
 import { getTrackedFiles } from "./git.ts";
 import { loadPolicy, isManagedPath } from "./policy.ts";
 
-export async function discoverManagedFiles(cwd: string): Promise<string[]> {
-  const policy = await loadPolicy(cwd);
-  const tracked = await getTrackedFiles(cwd);
-  return tracked
-    .map((filePath) => filePath.replace(/\\/g, "/"))
-    .filter((filePath) => isManagedPath(filePath, policy))
-    .sort((a, b) => a.localeCompare(b));
-}
+export async function discoverManagedFiles(cwd: string): Promise<string[]> {}
 
 export async function discoverManagedDirectories(cwd: string): Promise<string[]> {

[NoCoverage] MethodExpression
src/integrity/discover.ts:27:10
 export async function discoverManagedFiles(cwd: string): Promise<string[]> {
   const policy = await loadPolicy(cwd);
   const tracked = await getTrackedFiles(cwd);
-  return tracked
-    .map((filePath) => filePath.replace(/\\/g, "/"))
-    .filter((filePath) => isManagedPath(filePath, policy))
-    .sort((a, b) => a.localeCompare(b));
+  return tracked.map(filePath => filePath.replace(/\\/g, "/")).filter(filePath => isManagedPath(filePath, policy));
 }
 

[NoCoverage] MethodExpression
src/integrity/discover.ts:27:10
 export async function discoverManagedFiles(cwd: string): Promise<string[]> {
   const policy = await loadPolicy(cwd);
   const tracked = await getTrackedFiles(cwd);
-  return tracked
-    .map((filePath) => filePath.replace(/\\/g, "/"))
-    .filter((filePath) => isManagedPath(filePath, policy))
+  return tracked.map(filePath => filePath.replace(/\\/g, "/"))
     .sort((a, b) => a.localeCompare(b));
 }

[NoCoverage] ArrowFunction
src/integrity/discover.ts:28:10
   const policy = await loadPolicy(cwd);
   const tracked = await getTrackedFiles(cwd);
   return tracked
-    .map((filePath) => filePath.replace(/\\/g, "/"))
+    .map(() => undefined)
     .filter((filePath) => isManagedPath(filePath, policy))
     .sort((a, b) => a.localeCompare(b));

[NoCoverage] StringLiteral
src/integrity/discover.ts:28:48
   const policy = await loadPolicy(cwd);
   const tracked = await getTrackedFiles(cwd);
   return tracked
-    .map((filePath) => filePath.replace(/\\/g, "/"))
+    .map((filePath) => filePath.replace(/\\/g, ""))
     .filter((filePath) => isManagedPath(filePath, policy))
     .sort((a, b) => a.localeCompare(b));

[NoCoverage] ArrowFunction
src/integrity/discover.ts:29:13
   const tracked = await getTrackedFiles(cwd);
   return tracked
     .map((filePath) => filePath.replace(/\\/g, "/"))
-    .filter((filePath) => isManagedPath(filePath, policy))
+    .filter(() => undefined)
     .sort((a, b) => a.localeCompare(b));
 }

[NoCoverage] ArrowFunction
src/integrity/discover.ts:30:11
   return tracked
     .map((filePath) => filePath.replace(/\\/g, "/"))
     .filter((filePath) => isManagedPath(filePath, policy))
-    .sort((a, b) => a.localeCompare(b));
+    .sort(() => undefined);
 }
 

[NoCoverage] BlockStatement
src/integrity/discover.ts:33:82
     .sort((a, b) => a.localeCompare(b));
 }
 
-export async function discoverManagedDirectories(cwd: string): Promise<string[]> {
-  const files = await discoverManagedFiles(cwd);
-  return Array.from(new Set(files.map((filePath) => path.posix.dirname(filePath)))).sort((a, b) =>
-    a.localeCompare(b),
-  );
-}
+export async function discoverManagedDirectories(cwd: string): Promise<string[]> {}
 
 export async function groupFilesByDirectory(filePaths: string[]): Promise<Map<string, string[]>> {

[NoCoverage] MethodExpression
src/integrity/discover.ts:35:10
 
 export async function discoverManagedDirectories(cwd: string): Promise<string[]> {
   const files = await discoverManagedFiles(cwd);
-  return Array.from(new Set(files.map((filePath) => path.posix.dirname(filePath)))).sort((a, b) =>
-    a.localeCompare(b),
-  );
+  return Array.from(new Set(files.map(filePath => path.posix.dirname(filePath))));
 }
 

[NoCoverage] ArrowFunction
src/integrity/discover.ts:35:39
 
 export async function discoverManagedDirectories(cwd: string): Promise<string[]> {
   const files = await discoverManagedFiles(cwd);
-  return Array.from(new Set(files.map((filePath) => path.posix.dirname(filePath)))).sort((a, b) =>
+  return Array.from(new Set(files.map(() => undefined))).sort((a, b) =>
     a.localeCompare(b),
   );

[NoCoverage] BlockStatement
src/integrity/discover.ts:40:98
   );
 }
 
-export async function groupFilesByDirectory(filePaths: string[]): Promise<Map<string, string[]>> {
-  const map = new Map<string, string[]>();
-  for (const filePath of filePaths) {
-    const dir = path.posix.dirname(filePath);
-    const list = map.get(dir) ?? [];
-    list.push(filePath);
-    map.set(dir, list);
-  }
-  for (const [dir, list] of map) {
-    map.set(
-      dir,
-      list.sort((a, b) => a.localeCompare(b)),
-    );
-  }
-  return map;
-}
+export async function groupFilesByDirectory(filePaths: string[]): Promise<Map<string, string[]>> {}
 

[NoCoverage] BlockStatement
src/integrity/discover.ts:42:37
 
 export async function groupFilesByDirectory(filePaths: string[]): Promise<Map<string, string[]>> {
   const map = new Map<string, string[]>();
-  for (const filePath of filePaths) {
-    const dir = path.posix.dirname(filePath);
-    const list = map.get(dir) ?? [];
-    list.push(filePath);
-    map.set(dir, list);
-  }
+  for (const filePath of filePaths) {}
   for (const [dir, list] of map) {
     map.set(

[NoCoverage] LogicalOperator
src/integrity/discover.ts:44:18
   const map = new Map<string, string[]>();
   for (const filePath of filePaths) {
     const dir = path.posix.dirname(filePath);
-    const list = map.get(dir) ?? [];
+    const list = map.get(dir) && [];
     list.push(filePath);
     map.set(dir, list);

[NoCoverage] ArrayDeclaration
src/integrity/discover.ts:44:34
   const map = new Map<string, string[]>();
   for (const filePath of filePaths) {
     const dir = path.posix.dirname(filePath);
-    const list = map.get(dir) ?? [];
+    const list = map.get(dir) ?? ["Stryker was here"];
     list.push(filePath);
     map.set(dir, list);

[NoCoverage] CallExpression
src/integrity/discover.ts:45:5
   for (const filePath of filePaths) {
     const dir = path.posix.dirname(filePath);
     const list = map.get(dir) ?? [];
-    list.push(filePath);
+    ;
     map.set(dir, list);
   }

[NoCoverage] CallExpression
src/integrity/discover.ts:46:5
     const dir = path.posix.dirname(filePath);
     const list = map.get(dir) ?? [];
     list.push(filePath);
-    map.set(dir, list);
+    ;
   }
   for (const [dir, list] of map) {

[NoCoverage] BlockStatement
src/integrity/discover.ts:48:34
     list.push(filePath);
     map.set(dir, list);
   }
-  for (const [dir, list] of map) {
-    map.set(
-      dir,
-      list.sort((a, b) => a.localeCompare(b)),
-    );
-  }
+  for (const [dir, list] of map) {}
   return map;
 }

[NoCoverage] ArrowFunction
src/integrity/discover.ts:51:17
   for (const [dir, list] of map) {
     map.set(
       dir,
-      list.sort((a, b) => a.localeCompare(b)),
+      list.sort(() => undefined),
     );
   }

[NoCoverage] MethodExpression
src/integrity/discover.ts:51:7
   for (const [dir, list] of map) {
     map.set(
       dir,
-      list.sort((a, b) => a.localeCompare(b)),
+      list,
     );
   }
