[NoCoverage] BlockStatement
src/integrity/signing.ts:65:90
   reusedExistingSignature: boolean;
 }
 
-function pemFromBase64(label: "PRIVATE KEY" | "PUBLIC KEY", base64Value: string): string {
-  const normalized = base64Value.replace(/\s+/g, "");
-  const lines = normalized.match(/.{1,64}/g) ?? [normalized];
-  return `-----BEGIN ${label}-----\n${lines.join("\n")}\n-----END ${label}-----\n`;
-}
+function pemFromBase64(label: "PRIVATE KEY" | "PUBLIC KEY", base64Value: string): string {}
 
 function normalizePemLikeValue(value: string, label: "PRIVATE KEY" | "PUBLIC KEY"): string {

[NoCoverage] StringLiteral
src/integrity/signing.ts:66:50
 }
 
 function pemFromBase64(label: "PRIVATE KEY" | "PUBLIC KEY", base64Value: string): string {
-  const normalized = base64Value.replace(/\s+/g, "");
+  const normalized = base64Value.replace(/\s+/g, "Stryker was here!");
   const lines = normalized.match(/.{1,64}/g) ?? [normalized];
   return `-----BEGIN ${label}-----\n${lines.join("\n")}\n-----END ${label}-----\n`;

[NoCoverage] LogicalOperator
src/integrity/signing.ts:67:17
 
 function pemFromBase64(label: "PRIVATE KEY" | "PUBLIC KEY", base64Value: string): string {
   const normalized = base64Value.replace(/\s+/g, "");
-  const lines = normalized.match(/.{1,64}/g) ?? [normalized];
+  const lines = normalized.match(/.{1,64}/g) && [normalized];
   return `-----BEGIN ${label}-----\n${lines.join("\n")}\n-----END ${label}-----\n`;
 }

[NoCoverage] StringLiteral
src/integrity/signing.ts:68:10
 function pemFromBase64(label: "PRIVATE KEY" | "PUBLIC KEY", base64Value: string): string {
   const normalized = base64Value.replace(/\s+/g, "");
   const lines = normalized.match(/.{1,64}/g) ?? [normalized];
-  return `-----BEGIN ${label}-----\n${lines.join("\n")}\n-----END ${label}-----\n`;
+  return ``;
 }
 

[NoCoverage] StringLiteral
src/integrity/signing.ts:68:50
 function pemFromBase64(label: "PRIVATE KEY" | "PUBLIC KEY", base64Value: string): string {
   const normalized = base64Value.replace(/\s+/g, "");
   const lines = normalized.match(/.{1,64}/g) ?? [normalized];
-  return `-----BEGIN ${label}-----\n${lines.join("\n")}\n-----END ${label}-----\n`;
+  return `-----BEGIN ${label}-----\n${lines.join("")}\n-----END ${label}-----\n`;
 }
 

[NoCoverage] BlockStatement
src/integrity/signing.ts:71:92
   return `-----BEGIN ${label}-----\n${lines.join("\n")}\n-----END ${label}-----\n`;
 }
 
-function normalizePemLikeValue(value: string, label: "PRIVATE KEY" | "PUBLIC KEY"): string {
-  const trimmed = value.trim();
-  if (trimmed.includes("-----BEGIN")) {
-    return trimmed.endsWith("\n") ? trimmed : `${trimmed}\n`;
-  }
-  return pemFromBase64(label, trimmed);
-}
+function normalizePemLikeValue(value: string, label: "PRIVATE KEY" | "PUBLIC KEY"): string {}
 
 async function loadDotEnv(cwd: string): Promise<void> {

[NoCoverage] MethodExpression
src/integrity/signing.ts:72:19
 }
 
 function normalizePemLikeValue(value: string, label: "PRIVATE KEY" | "PUBLIC KEY"): string {
-  const trimmed = value.trim();
+  const trimmed = value;
   if (trimmed.includes("-----BEGIN")) {
     return trimmed.endsWith("\n") ? trimmed : `${trimmed}\n`;

[NoCoverage] ConditionalExpression
src/integrity/signing.ts:73:7
 
 function normalizePemLikeValue(value: string, label: "PRIVATE KEY" | "PUBLIC KEY"): string {
   const trimmed = value.trim();
-  if (trimmed.includes("-----BEGIN")) {
+  if (true) {
     return trimmed.endsWith("\n") ? trimmed : `${trimmed}\n`;
   }

[NoCoverage] BlockStatement
src/integrity/signing.ts:73:39
 
 function normalizePemLikeValue(value: string, label: "PRIVATE KEY" | "PUBLIC KEY"): string {
   const trimmed = value.trim();
-  if (trimmed.includes("-----BEGIN")) {
-    return trimmed.endsWith("\n") ? trimmed : `${trimmed}\n`;
-  }
+  if (trimmed.includes("-----BEGIN")) {}
   return pemFromBase64(label, trimmed);
 }

[NoCoverage] MethodExpression
src/integrity/signing.ts:74:12
 function normalizePemLikeValue(value: string, label: "PRIVATE KEY" | "PUBLIC KEY"): string {
   const trimmed = value.trim();
   if (trimmed.includes("-----BEGIN")) {
-    return trimmed.endsWith("\n") ? trimmed : `${trimmed}\n`;
+    return trimmed.startsWith("\n") ? trimmed : `${trimmed}\n`;
   }
   return pemFromBase64(label, trimmed);

[NoCoverage] ConditionalExpression
src/integrity/signing.ts:80:7
 }
 
 async function loadDotEnv(cwd: string): Promise<void> {
-  if (dotEnvLoadedForCwd === cwd) {
+  if (false) {
     return;
   }

[NoCoverage] BlockStatement
src/integrity/signing.ts:80:35
 }
 
 async function loadDotEnv(cwd: string): Promise<void> {
-  if (dotEnvLoadedForCwd === cwd) {
-    return;
-  }
+  if (dotEnvLoadedForCwd === cwd) {}
 
   const envPath = path.join(cwd, ".env");

[NoCoverage] BlockStatement
src/integrity/signing.ts:85:37
   }
 
   const envPath = path.join(cwd, ".env");
-  if (!(await pathExists(envPath))) {
-    dotEnvLoadedForCwd = cwd;
-    return;
-  }
+  if (!(await pathExists(envPath))) {}
 
   const envText = await readText(envPath);

[NoCoverage] ConditionalExpression
src/integrity/signing.ts:85:7
   }
 
   const envPath = path.join(cwd, ".env");
-  if (!(await pathExists(envPath))) {
+  if (true) {
     dotEnvLoadedForCwd = cwd;
     return;

[NoCoverage] Regex
src/integrity/signing.ts:91:39
   }
 
   const envText = await readText(envPath);
-  for (const rawLine of envText.split(/\r?\n/u)) {
+  for (const rawLine of envText.split(/\r\n/u)) {
     const line = rawLine.trim();
     if (!line || line.startsWith("#")) {

[NoCoverage] MethodExpression
src/integrity/signing.ts:92:18
 
   const envText = await readText(envPath);
   for (const rawLine of envText.split(/\r?\n/u)) {
-    const line = rawLine.trim();
+    const line = rawLine;
     if (!line || line.startsWith("#")) {
       continue;

[NoCoverage] ConditionalExpression
src/integrity/signing.ts:93:9
   const envText = await readText(envPath);
   for (const rawLine of envText.split(/\r?\n/u)) {
     const line = rawLine.trim();
-    if (!line || line.startsWith("#")) {
+    if (false) {
       continue;
     }

[NoCoverage] BooleanLiteral
src/integrity/signing.ts:93:9
   const envText = await readText(envPath);
   for (const rawLine of envText.split(/\r?\n/u)) {
     const line = rawLine.trim();
-    if (!line || line.startsWith("#")) {
+    if (line || line.startsWith("#")) {
       continue;
     }

[NoCoverage] EqualityOperator
src/integrity/signing.ts:98:9
     }
 
     const separatorIndex = line.indexOf("=");
-    if (separatorIndex <= 0) {
+    if (separatorIndex < 0) {
       continue;
     }

[NoCoverage] BlockStatement
src/integrity/signing.ts:98:30
     }
 
     const separatorIndex = line.indexOf("=");
-    if (separatorIndex <= 0) {
-      continue;
-    }
+    if (separatorIndex <= 0) {}
 
     const key = line.slice(0, separatorIndex).trim();

[NoCoverage] MethodExpression
src/integrity/signing.ts:102:17
       continue;
     }
 
-    const key = line.slice(0, separatorIndex).trim();
+    const key = line.trim();
     if (!key || process.env[key] !== undefined) {
       continue;

[NoCoverage] MethodExpression
src/integrity/signing.ts:102:17
       continue;
     }
 
-    const key = line.slice(0, separatorIndex).trim();
+    const key = line.slice(0, separatorIndex);
     if (!key || process.env[key] !== undefined) {
       continue;

[NoCoverage] LogicalOperator
src/integrity/signing.ts:103:9
     }
 
     const key = line.slice(0, separatorIndex).trim();
-    if (!key || process.env[key] !== undefined) {
+    if (!key && process.env[key] !== undefined) {
       continue;
     }

[NoCoverage] BlockStatement
src/integrity/signing.ts:103:49
     }
 
     const key = line.slice(0, separatorIndex).trim();
-    if (!key || process.env[key] !== undefined) {
-      continue;
-    }
+    if (!key || process.env[key] !== undefined) {}
 
     let value = line.slice(separatorIndex + 1).trim();

[NoCoverage] MethodExpression
src/integrity/signing.ts:107:17
       continue;
     }
 
-    let value = line.slice(separatorIndex + 1).trim();
+    let value = line.trim();
     if (
       (value.startsWith('"') && value.endsWith('"')) ||

[NoCoverage] ArithmeticOperator
src/integrity/signing.ts:107:28
       continue;
     }
 
-    let value = line.slice(separatorIndex + 1).trim();
+    let value = line.slice(separatorIndex - 1).trim();
     if (
       (value.startsWith('"') && value.endsWith('"')) ||

[NoCoverage] LogicalOperator
src/integrity/signing.ts:109:8
 
     let value = line.slice(separatorIndex + 1).trim();
     if (
-      (value.startsWith('"') && value.endsWith('"')) ||
+      (value.startsWith('"') || value.endsWith('"')) ||
       (value.startsWith("'") && value.endsWith("'"))
     ) {

[NoCoverage] ConditionalExpression
src/integrity/signing.ts:109:8
 
     let value = line.slice(separatorIndex + 1).trim();
     if (
-      (value.startsWith('"') && value.endsWith('"')) ||
+      (false) ||
       (value.startsWith("'") && value.endsWith("'"))
     ) {

[NoCoverage] ConditionalExpression
src/integrity/signing.ts:110:8
     let value = line.slice(separatorIndex + 1).trim();
     if (
       (value.startsWith('"') && value.endsWith('"')) ||
-      (value.startsWith("'") && value.endsWith("'"))
+      (false)
     ) {
       value = value.slice(1, -1);

[NoCoverage] LogicalOperator
src/integrity/signing.ts:110:8
     let value = line.slice(separatorIndex + 1).trim();
     if (
       (value.startsWith('"') && value.endsWith('"')) ||
-      (value.startsWith("'") && value.endsWith("'"))
+      (value.startsWith("'") || value.endsWith("'"))
     ) {
       value = value.slice(1, -1);

[NoCoverage] BlockStatement
src/integrity/signing.ts:111:7
     if (
       (value.startsWith('"') && value.endsWith('"')) ||
       (value.startsWith("'") && value.endsWith("'"))
-    ) {
-      value = value.slice(1, -1);
-    }
+    ) {}
 
     value = value.replace(/\\n/g, "\n");

[NoCoverage] BlockStatement
src/integrity/signing.ts:122:86
   dotEnvLoadedForCwd = cwd;
 }
 
-export async function requireEnv(name: string, cwd = process.cwd()): Promise<string> {
-  await loadDotEnv(cwd);
-  const value = process.env[name];
-  if (!value) {
-    throw new Error(`Required environment variable ${name} is not set.`);
-  }
-  return value;
-}
+export async function requireEnv(name: string, cwd = process.cwd()): Promise<string> {}
 
 export async function optionalEnv(name: string, cwd = process.cwd()): Promise<string | undefined> {

[NoCoverage] ConditionalExpression
src/integrity/signing.ts:125:7
 export async function requireEnv(name: string, cwd = process.cwd()): Promise<string> {
   await loadDotEnv(cwd);
   const value = process.env[name];
-  if (!value) {
+  if (false) {
     throw new Error(`Required environment variable ${name} is not set.`);
   }

[NoCoverage] BlockStatement
src/integrity/signing.ts:125:15
 export async function requireEnv(name: string, cwd = process.cwd()): Promise<string> {
   await loadDotEnv(cwd);
   const value = process.env[name];
-  if (!value) {
-    throw new Error(`Required environment variable ${name} is not set.`);
-  }
+  if (!value) {}
   return value;
 }

[NoCoverage] BlockStatement
src/integrity/signing.ts:131:99
   return value;
 }
 
-export async function optionalEnv(name: string, cwd = process.cwd()): Promise<string | undefined> {
-  await loadDotEnv(cwd);
-  return process.env[name] ?? undefined;
-}
+export async function optionalEnv(name: string, cwd = process.cwd()): Promise<string | undefined> {}
 
 export async function generateSigningKeyPairPemAsync(): Promise<SigningKeyPairPem> {

[NoCoverage] LogicalOperator
src/integrity/signing.ts:133:10
 
 export async function optionalEnv(name: string, cwd = process.cwd()): Promise<string | undefined> {
   await loadDotEnv(cwd);
-  return process.env[name] ?? undefined;
+  return process.env[name] && undefined;
 }
 

[NoCoverage] BlockStatement
src/integrity/signing.ts:136:84
   return process.env[name] ?? undefined;
 }
 
-export async function generateSigningKeyPairPemAsync(): Promise<SigningKeyPairPem> {
-  const keyPair = await signingGenerateKeyPair();
-  return {
-    privateKeyPem: signingToPem(keyPair.privateKey, "private"),
-    publicKeyPem: signingToPem(keyPair.publicKey, "public"),
-  };
-}
+export async function generateSigningKeyPairPemAsync(): Promise<SigningKeyPairPem> {}
 
 export async function loadBuildArtifactsForSigning(cwd: string): Promise<{

[NoCoverage] ObjectLiteral
src/integrity/signing.ts:138:10
 
 export async function generateSigningKeyPairPemAsync(): Promise<SigningKeyPairPem> {
   const keyPair = await signingGenerateKeyPair();
-  return {
-    privateKeyPem: signingToPem(keyPair.privateKey, "private"),
-    publicKeyPem: signingToPem(keyPair.publicKey, "public"),
-  };
+  return {};
 }
 

[NoCoverage] BlockStatement
src/integrity/signing.ts:149:4
   outputsRaw: string;
   provenance: BuildProvenance;
   provenanceRaw: string;
-}> {
-  const [outputsRaw, provenanceRaw, outputs, provenance] = await Promise.all([
-    readText(outputsPath(cwd)),
-    readText(provenancePath(cwd)),
-    readJsonFile<OutputsFile>(outputsPath(cwd)),
-    readJsonFile<BuildProvenance>(provenancePath(cwd)),
-  ]);
-
-  return {
-    outputs,
-    outputsRaw,
-    provenance,
-    provenanceRaw,
-  };
-}
+}> {}
 
 export function createSignablePayload(args: {

[NoCoverage] ObjectLiteral
src/integrity/signing.ts:157:10
     readJsonFile<BuildProvenance>(provenancePath(cwd)),
   ]);
 
-  return {
-    outputs,
-    outputsRaw,
-    provenance,
-    provenanceRaw,
-  };
+  return {};
 }
 

[NoCoverage] BlockStatement
src/integrity/signing.ts:170:21
   outputsRaw: string;
   provenanceRaw: string;
   signedAt?: string;
-}): SignablePayload {
-  return {
-    payloadVersion: "1",
-    buildId: args.buildId,
-    signedAt: args.signedAt ?? new Date().toISOString(),
-    outputsDigest: byteHash(args.outputsRaw).slice("sha256:".length),
-    provenanceDigest: byteHash(args.provenanceRaw).slice("sha256:".length),
-  };
-}
+}): SignablePayload {}
 
 export async function signJsonPayloadAsync(

[NoCoverage] ObjectLiteral
src/integrity/signing.ts:171:10
   provenanceRaw: string;
   signedAt?: string;
 }): SignablePayload {
-  return {
-    payloadVersion: "1",
-    buildId: args.buildId,
-    signedAt: args.signedAt ?? new Date().toISOString(),
-    outputsDigest: byteHash(args.outputsRaw).slice("sha256:".length),
-    provenanceDigest: byteHash(args.provenanceRaw).slice("sha256:".length),
-  };
+  return {};
 }
 

[NoCoverage] LogicalOperator
src/integrity/signing.ts:174:15
   return {
     payloadVersion: "1",
     buildId: args.buildId,
-    signedAt: args.signedAt ?? new Date().toISOString(),
+    signedAt: args.signedAt && new Date().toISOString(),
     outputsDigest: byteHash(args.outputsRaw).slice("sha256:".length),
     provenanceDigest: byteHash(args.provenanceRaw).slice("sha256:".length),

[NoCoverage] MethodExpression
src/integrity/signing.ts:175:20
     payloadVersion: "1",
     buildId: args.buildId,
     signedAt: args.signedAt ?? new Date().toISOString(),
-    outputsDigest: byteHash(args.outputsRaw).slice("sha256:".length),
+    outputsDigest: byteHash(args.outputsRaw),
     provenanceDigest: byteHash(args.provenanceRaw).slice("sha256:".length),
   };

[NoCoverage] StringLiteral
src/integrity/signing.ts:175:52
     payloadVersion: "1",
     buildId: args.buildId,
     signedAt: args.signedAt ?? new Date().toISOString(),
-    outputsDigest: byteHash(args.outputsRaw).slice("sha256:".length),
+    outputsDigest: byteHash(args.outputsRaw).slice("".length),
     provenanceDigest: byteHash(args.provenanceRaw).slice("sha256:".length),
   };

[NoCoverage] MethodExpression
src/integrity/signing.ts:176:23
     buildId: args.buildId,
     signedAt: args.signedAt ?? new Date().toISOString(),
     outputsDigest: byteHash(args.outputsRaw).slice("sha256:".length),
-    provenanceDigest: byteHash(args.provenanceRaw).slice("sha256:".length),
+    provenanceDigest: byteHash(args.provenanceRaw),
   };
 }

[NoCoverage] BlockStatement
src/integrity/signing.ts:188:4
   signatureBuffer: Buffer;
   signatureHex: string;
   signatureBase64: string;
-}> {
-  const privateKeyBytes = privateKeyPemToBytes(privateKeyPem);
-  const payloadBytes = Buffer.from(signingCanonicalBytes(payload));
-  const signatureBytes = await signingSign(privateKeyBytes, payload);
-  const signatureBuffer = Buffer.from(signatureBytes);
-  return {
-    payloadBytes,
-    signatureBuffer,
-    signatureHex: signatureBuffer.toString("hex"),
-    signatureBase64: signatureBuffer.toString("base64"),
-  };
-}
+}> {}
 
 export async function signLatestBuildArtifacts(args: {

[NoCoverage] StringLiteral
src/integrity/signing.ts:196:44
   return {
     payloadBytes,
     signatureBuffer,
-    signatureHex: signatureBuffer.toString("hex"),
+    signatureHex: signatureBuffer.toString(""),
     signatureBase64: signatureBuffer.toString("base64"),
   };

[NoCoverage] StringLiteral
src/integrity/signing.ts:197:47
     payloadBytes,
     signatureBuffer,
     signatureHex: signatureBuffer.toString("hex"),
-    signatureBase64: signatureBuffer.toString("base64"),
+    signatureBase64: signatureBuffer.toString(""),
   };
 }

[NoCoverage] BooleanLiteral
src/integrity/signing.ts:210:7
     args.cwd,
   );
 
-  if (!provenance.buildId) {
+  if (provenance.buildId) {
     throw new Error("build-provenance.json is missing buildId. Run integrity:build-record again.");
   }

[NoCoverage] ConditionalExpression
src/integrity/signing.ts:210:7
     args.cwd,
   );
 
-  if (!provenance.buildId) {
+  if (true) {
     throw new Error("build-provenance.json is missing buildId. Run integrity:build-record again.");
   }

[NoCoverage] ObjectLiteral
src/integrity/signing.ts:214:45
     throw new Error("build-provenance.json is missing buildId. Run integrity:build-record again.");
   }
 
-  const nextPayload = createSignablePayload({
-    buildId: provenance.buildId,
-    outputsRaw,
-    provenanceRaw,
-  });
+  const nextPayload = createSignablePayload({});
 
   const existingManifestPath = signedManifestPath(args.cwd);

[NoCoverage] ConditionalExpression
src/integrity/signing.ts:221:7
   });
 
   const existingManifestPath = signedManifestPath(args.cwd);
-  if (await pathExists(existingManifestPath)) {
+  if (false) {
     const existingManifest = await readJsonFile<SignedManifest>(existingManifestPath);
     const digestsMatch =

[NoCoverage] BlockStatement
src/integrity/signing.ts:221:47
   });
 
   const existingManifestPath = signedManifestPath(args.cwd);
-  if (await pathExists(existingManifestPath)) {
-    const existingManifest = await readJsonFile<SignedManifest>(existingManifestPath);
-    const digestsMatch =
-      existingManifest.buildId === nextPayload.buildId &&
-      existingManifest.payload.outputsDigest === nextPayload.outputsDigest &&
-      existingManifest.payload.provenanceDigest === nextPayload.provenanceDigest;
-
-    if (digestsMatch) {
-      const existingPayloadBytes = Buffer.from(
-        signingCanonicalBytes(existingManifest.payload as unknown as Record<string, unknown>),
-      );
-      const existingSignatureBuffer = Buffer.from(existingManifest.signatureHex, "hex");
-
-      return {
-        outputs,
-        provenance,
-        payload: existingManifest.payload,
-        payloadBytes: existingPayloadBytes,
-        signatureBuffer: existingSignatureBuffer,
-        signatureHex: existingManifest.signatureHex,
-        signedManifest: existingManifest,
-        reusedExistingSignature: true,
-      };
-    }
-  }
+  if (await pathExists(existingManifestPath)) {}
 
   const signed = await signJsonPayloadAsync(

[NoCoverage] LogicalOperator
src/integrity/signing.ts:224:7
   if (await pathExists(existingManifestPath)) {
     const existingManifest = await readJsonFile<SignedManifest>(existingManifestPath);
     const digestsMatch =
-      existingManifest.buildId === nextPayload.buildId &&
-      existingManifest.payload.outputsDigest === nextPayload.outputsDigest &&
+      existingManifest.buildId === nextPayload.buildId || existingManifest.payload.outputsDigest === nextPayload.outputsDigest &&
       existingManifest.payload.provenanceDigest === nextPayload.provenanceDigest;
 

[NoCoverage] ConditionalExpression
src/integrity/signing.ts:224:7
   if (await pathExists(existingManifestPath)) {
     const existingManifest = await readJsonFile<SignedManifest>(existingManifestPath);
     const digestsMatch =
-      existingManifest.buildId === nextPayload.buildId &&
-      existingManifest.payload.outputsDigest === nextPayload.outputsDigest &&
-      existingManifest.payload.provenanceDigest === nextPayload.provenanceDigest;
+      true;
 
     if (digestsMatch) {

[NoCoverage] EqualityOperator
src/integrity/signing.ts:225:7
     const existingManifest = await readJsonFile<SignedManifest>(existingManifestPath);
     const digestsMatch =
       existingManifest.buildId === nextPayload.buildId &&
-      existingManifest.payload.outputsDigest === nextPayload.outputsDigest &&
+      existingManifest.payload.outputsDigest !== nextPayload.outputsDigest &&
       existingManifest.payload.provenanceDigest === nextPayload.provenanceDigest;
 

[NoCoverage] ConditionalExpression
src/integrity/signing.ts:225:7
     const existingManifest = await readJsonFile<SignedManifest>(existingManifestPath);
     const digestsMatch =
       existingManifest.buildId === nextPayload.buildId &&
-      existingManifest.payload.outputsDigest === nextPayload.outputsDigest &&
+      true &&
       existingManifest.payload.provenanceDigest === nextPayload.provenanceDigest;
 

[NoCoverage] EqualityOperator
src/integrity/signing.ts:226:7
     const digestsMatch =
       existingManifest.buildId === nextPayload.buildId &&
       existingManifest.payload.outputsDigest === nextPayload.outputsDigest &&
-      existingManifest.payload.provenanceDigest === nextPayload.provenanceDigest;
+      existingManifest.payload.provenanceDigest !== nextPayload.provenanceDigest;
 
     if (digestsMatch) {

[NoCoverage] ConditionalExpression
src/integrity/signing.ts:226:7
     const digestsMatch =
       existingManifest.buildId === nextPayload.buildId &&
       existingManifest.payload.outputsDigest === nextPayload.outputsDigest &&
-      existingManifest.payload.provenanceDigest === nextPayload.provenanceDigest;
+      true;
 
     if (digestsMatch) {

[NoCoverage] ConditionalExpression
src/integrity/signing.ts:228:9
       existingManifest.payload.outputsDigest === nextPayload.outputsDigest &&
       existingManifest.payload.provenanceDigest === nextPayload.provenanceDigest;
 
-    if (digestsMatch) {
+    if (true) {
       const existingPayloadBytes = Buffer.from(
         signingCanonicalBytes(existingManifest.payload as unknown as Record<string, unknown>),

[NoCoverage] BlockStatement
src/integrity/signing.ts:228:23
       existingManifest.payload.outputsDigest === nextPayload.outputsDigest &&
       existingManifest.payload.provenanceDigest === nextPayload.provenanceDigest;
 
-    if (digestsMatch) {
-      const existingPayloadBytes = Buffer.from(
-        signingCanonicalBytes(existingManifest.payload as unknown as Record<string, unknown>),
-      );
-      const existingSignatureBuffer = Buffer.from(existingManifest.signatureHex, "hex");
-
-      return {
-        outputs,
-        provenance,
-        payload: existingManifest.payload,
-        payloadBytes: existingPayloadBytes,
-        signatureBuffer: existingSignatureBuffer,
-        signatureHex: existingManifest.signatureHex,
-        signedManifest: existingManifest,
-        reusedExistingSignature: true,
-      };
-    }
+    if (digestsMatch) {}
   }
 

[NoCoverage] BooleanLiteral
src/integrity/signing.ts:242:34
         signatureBuffer: existingSignatureBuffer,
         signatureHex: existingManifest.signatureHex,
         signedManifest: existingManifest,
-        reusedExistingSignature: true,
+        reusedExistingSignature: false,
       };
     }

[NoCoverage] ArrowFunction
src/integrity/signing.ts:268:41
     writeText(signatureHexPath(args.cwd), `${signed.signatureHex}\n`),
     writeText(signedManifestPath(args.cwd), stableStringify(signedManifest)),
   ]);
-  await import("node:fs/promises").then(({ writeFile }) =>
-    writeFile(signatureBinaryPath(args.cwd), signed.signatureBuffer),
+  await import("node:fs/promises").then(() => undefined,
   );
 

[NoCoverage] ObjectLiteral
src/integrity/signing.ts:272:10
     writeFile(signatureBinaryPath(args.cwd), signed.signatureBuffer),
   );
 
-  return {
-    outputs,
-    provenance,
-    payload: nextPayload,
-    payloadBytes: signed.payloadBytes,
-    signatureBuffer: signed.signatureBuffer,
-    signatureHex: signed.signatureHex,
-    signedManifest,
-    reusedExistingSignature: false,
-  };
+  return {};
 }
 

[NoCoverage] BooleanLiteral
src/integrity/signing.ts:280:30
     signatureBuffer: signed.signatureBuffer,
     signatureHex: signed.signatureHex,
     signedManifest,
-    reusedExistingSignature: false,
+    reusedExistingSignature: true,
   };
 }

[NoCoverage] BlockStatement
src/integrity/signing.ts:284:91
   };
 }
 
-export async function loadSignedManifest(manifestSource: string): Promise<SignedManifest> {
-  if (manifestSource.startsWith("https://") || manifestSource.startsWith("http://")) {
-    const response = await fetch(manifestSource);
-    if (!response.ok) {
-      throw new Error(
-        `HTTP ${response.status} while fetching signed manifest from ${manifestSource}`,
-      );
-    }
-    return (await response.json()) as SignedManifest;
-  }
-
-  return readJsonFile<SignedManifest>(manifestSource);
-}
+export async function loadSignedManifest(manifestSource: string): Promise<SignedManifest> {}
 
 export async function loadPublicKeyPem(args: {

[NoCoverage] MethodExpression
src/integrity/signing.ts:285:7
 }
 
 export async function loadSignedManifest(manifestSource: string): Promise<SignedManifest> {
-  if (manifestSource.startsWith("https://") || manifestSource.startsWith("http://")) {
+  if (manifestSource.endsWith("https://") || manifestSource.startsWith("http://")) {
     const response = await fetch(manifestSource);
     if (!response.ok) {

[NoCoverage] LogicalOperator
src/integrity/signing.ts:285:7
 }
 
 export async function loadSignedManifest(manifestSource: string): Promise<SignedManifest> {
-  if (manifestSource.startsWith("https://") || manifestSource.startsWith("http://")) {
+  if (manifestSource.startsWith("https://") && manifestSource.startsWith("http://")) {
     const response = await fetch(manifestSource);
     if (!response.ok) {

[NoCoverage] ConditionalExpression
src/integrity/signing.ts:287:9
 export async function loadSignedManifest(manifestSource: string): Promise<SignedManifest> {
   if (manifestSource.startsWith("https://") || manifestSource.startsWith("http://")) {
     const response = await fetch(manifestSource);
-    if (!response.ok) {
+    if (false) {
       throw new Error(
         `HTTP ${response.status} while fetching signed manifest from ${manifestSource}`,

[NoCoverage] ConditionalExpression
src/integrity/signing.ts:287:9
 export async function loadSignedManifest(manifestSource: string): Promise<SignedManifest> {
   if (manifestSource.startsWith("https://") || manifestSource.startsWith("http://")) {
     const response = await fetch(manifestSource);
-    if (!response.ok) {
+    if (true) {
       throw new Error(
         `HTTP ${response.status} while fetching signed manifest from ${manifestSource}`,

[NoCoverage] BlockStatement
src/integrity/signing.ts:302:21
   manifest: SignedManifest;
   publicKeyPemPath?: string;
   publicKeyUrl?: string;
-}): Promise<string> {
-  if (args.publicKeyPemPath) {
-    return normalizePemLikeValue(await readText(path.resolve(args.publicKeyPemPath)), "PUBLIC KEY");
-  }
-
-  const publicKeyUrl = args.publicKeyUrl ?? args.manifest.publicKeyUrl;
-  if (!publicKeyUrl) {
-    throw new Error(
-      "No public key source provided. Set PUBLIC_KEY_PEM_PATH, PUBLIC_KEY_URL, or embed publicKeyUrl in signed-manifest.json.",
-    );
-  }
-
-  const response = await fetch(publicKeyUrl);
-  if (!response.ok) {
-    throw new Error(`HTTP ${response.status} while fetching public key from ${publicKeyUrl}`);
-  }
-
-  return normalizePemLikeValue(await response.text(), "PUBLIC KEY");
-}
+}): Promise<string> {}
 
 export function verifyManifestSignature(args: {

[NoCoverage] BlockStatement
src/integrity/signing.ts:303:30
   publicKeyPemPath?: string;
   publicKeyUrl?: string;
 }): Promise<string> {
-  if (args.publicKeyPemPath) {
-    return normalizePemLikeValue(await readText(path.resolve(args.publicKeyPemPath)), "PUBLIC KEY");
-  }
+  if (args.publicKeyPemPath) {}
 
   const publicKeyUrl = args.publicKeyUrl ?? args.manifest.publicKeyUrl;

[NoCoverage] ConditionalExpression
src/integrity/signing.ts:303:7
   publicKeyPemPath?: string;
   publicKeyUrl?: string;
 }): Promise<string> {
-  if (args.publicKeyPemPath) {
+  if (true) {
     return normalizePemLikeValue(await readText(path.resolve(args.publicKeyPemPath)), "PUBLIC KEY");
   }

[NoCoverage] LogicalOperator
src/integrity/signing.ts:307:24
     return normalizePemLikeValue(await readText(path.resolve(args.publicKeyPemPath)), "PUBLIC KEY");
   }
 
-  const publicKeyUrl = args.publicKeyUrl ?? args.manifest.publicKeyUrl;
+  const publicKeyUrl = args.publicKeyUrl && args.manifest.publicKeyUrl;
   if (!publicKeyUrl) {
     throw new Error(

[NoCoverage] ConditionalExpression
src/integrity/signing.ts:308:7
   }
 
   const publicKeyUrl = args.publicKeyUrl ?? args.manifest.publicKeyUrl;
-  if (!publicKeyUrl) {
+  if (false) {
     throw new Error(
       "No public key source provided. Set PUBLIC_KEY_PEM_PATH, PUBLIC_KEY_URL, or embed publicKeyUrl in signed-manifest.json.",
