[NoCoverage] BooleanLiteral
src/integrity/signing.ts:308:7
   }
 
   const publicKeyUrl = args.publicKeyUrl ?? args.manifest.publicKeyUrl;
-  if (!publicKeyUrl) {
+  if (publicKeyUrl) {
     throw new Error(
       "No public key source provided. Set PUBLIC_KEY_PEM_PATH, PUBLIC_KEY_URL, or embed publicKeyUrl in signed-manifest.json.",

[NoCoverage] StringLiteral
src/integrity/signing.ts:310:7
   const publicKeyUrl = args.publicKeyUrl ?? args.manifest.publicKeyUrl;
   if (!publicKeyUrl) {
     throw new Error(
-      "No public key source provided. Set PUBLIC_KEY_PEM_PATH, PUBLIC_KEY_URL, or embed publicKeyUrl in signed-manifest.json.",
+      "",
     );
   }

[NoCoverage] BlockStatement
src/integrity/signing.ts:315:21
   }
 
   const response = await fetch(publicKeyUrl);
-  if (!response.ok) {
-    throw new Error(`HTTP ${response.status} while fetching public key from ${publicKeyUrl}`);
-  }
+  if (!response.ok) {}
 
   return normalizePemLikeValue(await response.text(), "PUBLIC KEY");

[NoCoverage] BooleanLiteral
src/integrity/signing.ts:315:7
   }
 
   const response = await fetch(publicKeyUrl);
-  if (!response.ok) {
+  if (response.ok) {
     throw new Error(`HTTP ${response.status} while fetching public key from ${publicKeyUrl}`);
   }

[NoCoverage] BlockStatement
src/integrity/signing.ts:325:22
 export function verifyManifestSignature(args: {
   manifest: SignedManifest;
   publicKeyPem: string;
-}): Promise<boolean> {
-  return verifyJsonSignatureAsync({
-    payload: args.manifest.payload as unknown as Record<string, unknown>,
-    signatureHex: args.manifest.signatureHex,
-    publicKeyPem: args.publicKeyPem,
-  });
-}
+}): Promise<boolean> {}
 
 export async function verifyJsonSignatureAsync(args: {

[NoCoverage] BlockStatement
src/integrity/signing.ts:337:22
   payload: Record<string, unknown>;
   signatureHex: string;
   publicKeyPem: string;
-}): Promise<boolean> {
-  const publicKeyBytes = publicKeyPemToBytes(args.publicKeyPem);
-  const signatureBytes = signingFromHex(args.signatureHex);
-  return signingVerify(publicKeyBytes, args.payload, signatureBytes);
-}
+}): Promise<boolean> {}
 
 export async function compareManifestWithLocalArtifacts(

[NoCoverage] BlockStatement
src/integrity/signing.ts:351:4
   provenanceDigestActual: string;
   outputsDigestMatches: boolean;
   provenanceDigestMatches: boolean;
-}> {
-  const [outputsRaw, provenanceRaw] = await Promise.all([
-    readText(outputsPath(cwd)),
-    readText(provenancePath(cwd)),
-  ]);
-
-  const outputsDigestActual = byteHash(outputsRaw).slice("sha256:".length);
-  const provenanceDigestActual = byteHash(provenanceRaw).slice("sha256:".length);
-
-  return {
-    outputsDigestActual,
-    provenanceDigestActual,
-    outputsDigestMatches: outputsDigestActual === manifest.payload.outputsDigest,
-    provenanceDigestMatches: provenanceDigestActual === manifest.payload.provenanceDigest,
-  };
-}
+}> {}
 
 export async function readSignatureBinary(cwd: string): Promise<Buffer> {

[NoCoverage] MethodExpression
src/integrity/signing.ts:357:31
     readText(provenancePath(cwd)),
   ]);
 
-  const outputsDigestActual = byteHash(outputsRaw).slice("sha256:".length);
+  const outputsDigestActual = byteHash(outputsRaw);
   const provenanceDigestActual = byteHash(provenanceRaw).slice("sha256:".length);
 

[NoCoverage] StringLiteral
src/integrity/signing.ts:357:58
     readText(provenancePath(cwd)),
   ]);
 
-  const outputsDigestActual = byteHash(outputsRaw).slice("sha256:".length);
+  const outputsDigestActual = byteHash(outputsRaw).slice("".length);
   const provenanceDigestActual = byteHash(provenanceRaw).slice("sha256:".length);
 

[NoCoverage] MethodExpression
src/integrity/signing.ts:358:34
   ]);
 
   const outputsDigestActual = byteHash(outputsRaw).slice("sha256:".length);
-  const provenanceDigestActual = byteHash(provenanceRaw).slice("sha256:".length);
+  const provenanceDigestActual = byteHash(provenanceRaw);
 
   return {

[NoCoverage] StringLiteral
src/integrity/signing.ts:358:64
   ]);
 
   const outputsDigestActual = byteHash(outputsRaw).slice("sha256:".length);
-  const provenanceDigestActual = byteHash(provenanceRaw).slice("sha256:".length);
+  const provenanceDigestActual = byteHash(provenanceRaw).slice("".length);
 
   return {

[NoCoverage] ObjectLiteral
src/integrity/signing.ts:360:10
   const outputsDigestActual = byteHash(outputsRaw).slice("sha256:".length);
   const provenanceDigestActual = byteHash(provenanceRaw).slice("sha256:".length);
 
-  return {
-    outputsDigestActual,
-    provenanceDigestActual,
-    outputsDigestMatches: outputsDigestActual === manifest.payload.outputsDigest,
-    provenanceDigestMatches: provenanceDigestActual === manifest.payload.provenanceDigest,
-  };
+  return {};
 }
 

[NoCoverage] ConditionalExpression
src/integrity/signing.ts:363:27
   return {
     outputsDigestActual,
     provenanceDigestActual,
-    outputsDigestMatches: outputsDigestActual === manifest.payload.outputsDigest,
+    outputsDigestMatches: true,
     provenanceDigestMatches: provenanceDigestActual === manifest.payload.provenanceDigest,
   };

[NoCoverage] EqualityOperator
src/integrity/signing.ts:363:27
   return {
     outputsDigestActual,
     provenanceDigestActual,
-    outputsDigestMatches: outputsDigestActual === manifest.payload.outputsDigest,
+    outputsDigestMatches: outputsDigestActual !== manifest.payload.outputsDigest,
     provenanceDigestMatches: provenanceDigestActual === manifest.payload.provenanceDigest,
   };

[NoCoverage] ConditionalExpression
src/integrity/signing.ts:364:30
     outputsDigestActual,
     provenanceDigestActual,
     outputsDigestMatches: outputsDigestActual === manifest.payload.outputsDigest,
-    provenanceDigestMatches: provenanceDigestActual === manifest.payload.provenanceDigest,
+    provenanceDigestMatches: true,
   };
 }

[NoCoverage] ConditionalExpression
src/integrity/signing.ts:364:30
     outputsDigestActual,
     provenanceDigestActual,
     outputsDigestMatches: outputsDigestActual === manifest.payload.outputsDigest,
-    provenanceDigestMatches: provenanceDigestActual === manifest.payload.provenanceDigest,
+    provenanceDigestMatches: false,
   };
 }

[NoCoverage] BlockStatement
src/integrity/signing.ts:368:73
   };
 }
 
-export async function readSignatureBinary(cwd: string): Promise<Buffer> {
-  return readBuffer(signatureBinaryPath(cwd));
-}
+export async function readSignatureBinary(cwd: string): Promise<Buffer> {}
 
 /* --- RFC-0931: build-identity.json signing --- */

[Killed] BlockStatement
src/integrity/signing.ts:393:56
   const identity = JSON.parse(raw) as Record<string, unknown>;
 
   const signablePayload: Record<string, unknown> = {};
-  for (const [key, value] of Object.entries(identity)) {
-    if (!SIGNATURE_FIELDS.includes(key as (typeof SIGNATURE_FIELDS)[number])) {
-      signablePayload[key] = value;
-    }
-  }
+  for (const [key, value] of Object.entries(identity)) {}
 
   const existingSignature = typeof identity.signature === "string" ? identity.signature : null;
killedBy: RFC-0931: signBuildIdentity signs build-identity.json and embeds signature, publicKeyUrl, signedAt
statusReason: expected undefined to be 'sha256:abc' // Object.is equality

[Killed] BooleanLiteral
src/integrity/signing.ts:394:9
 
   const signablePayload: Record<string, unknown> = {};
   for (const [key, value] of Object.entries(identity)) {
-    if (!SIGNATURE_FIELDS.includes(key as (typeof SIGNATURE_FIELDS)[number])) {
+    if (SIGNATURE_FIELDS.includes(key as typeof SIGNATURE_FIELDS[number])) {
       signablePayload[key] = value;
     }
killedBy: RFC-0931: signBuildIdentity signs build-identity.json and embeds signature, publicKeyUrl, signedAt
statusReason: expected undefined to be 'sha256:abc' // Object.is equality

[Killed] ConditionalExpression
src/integrity/signing.ts:394:9
 
   const signablePayload: Record<string, unknown> = {};
   for (const [key, value] of Object.entries(identity)) {
-    if (!SIGNATURE_FIELDS.includes(key as (typeof SIGNATURE_FIELDS)[number])) {
+    if (true) {
       signablePayload[key] = value;
     }
killedBy: RFC-0931: signBuildIdentity reuses existing signature when payload hasn't changed (idempotency)
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/integrity/signing.ts:399:29
     }
   }
 
-  const existingSignature = typeof identity.signature === "string" ? identity.signature : null;
+  const existingSignature = false ? identity.signature : null;
   const existingSignedAt = typeof identity.signedAt === "string" ? identity.signedAt : null;
   const existingPublicKeyUrl =
killedBy: RFC-0931: signBuildIdentity reuses existing signature when payload hasn't changed (idempotency)
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/integrity/signing.ts:399:29
     }
   }
 
-  const existingSignature = typeof identity.signature === "string" ? identity.signature : null;
+  const existingSignature = typeof identity.signature !== "string" ? identity.signature : null;
   const existingSignedAt = typeof identity.signedAt === "string" ? identity.signedAt : null;
   const existingPublicKeyUrl =
killedBy: RFC-0931: signBuildIdentity reuses existing signature when payload hasn't changed (idempotency)
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/integrity/signing.ts:400:28
   }
 
   const existingSignature = typeof identity.signature === "string" ? identity.signature : null;
-  const existingSignedAt = typeof identity.signedAt === "string" ? identity.signedAt : null;
+  const existingSignedAt = false ? identity.signedAt : null;
   const existingPublicKeyUrl =
     typeof identity.publicKeyUrl === "string" ? identity.publicKeyUrl : null;
killedBy: RFC-0931: signBuildIdentity reuses existing signature when payload hasn't changed (idempotency)
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/integrity/signing.ts:400:28
   }
 
   const existingSignature = typeof identity.signature === "string" ? identity.signature : null;
-  const existingSignedAt = typeof identity.signedAt === "string" ? identity.signedAt : null;
+  const existingSignedAt = typeof identity.signedAt !== "string" ? identity.signedAt : null;
   const existingPublicKeyUrl =
     typeof identity.publicKeyUrl === "string" ? identity.publicKeyUrl : null;
killedBy: RFC-0931: signBuildIdentity reuses existing signature when payload hasn't changed (idempotency)
statusReason: expected false to be true // Object.is equality

[Survived] ConditionalExpression
src/integrity/signing.ts:402:5
   const existingSignature = typeof identity.signature === "string" ? identity.signature : null;
   const existingSignedAt = typeof identity.signedAt === "string" ? identity.signedAt : null;
   const existingPublicKeyUrl =
-    typeof identity.publicKeyUrl === "string" ? identity.publicKeyUrl : null;
+    false ? identity.publicKeyUrl : null;
 
   if (existingSignature && existingSignedAt) {

[Survived] ConditionalExpression
src/integrity/signing.ts:402:5
   const existingSignature = typeof identity.signature === "string" ? identity.signature : null;
   const existingSignedAt = typeof identity.signedAt === "string" ? identity.signedAt : null;
   const existingPublicKeyUrl =
-    typeof identity.publicKeyUrl === "string" ? identity.publicKeyUrl : null;
+    true ? identity.publicKeyUrl : null;
 
   if (existingSignature && existingSignedAt) {

[Killed] BlockStatement
src/integrity/signing.ts:404:46
   const existingPublicKeyUrl =
     typeof identity.publicKeyUrl === "string" ? identity.publicKeyUrl : null;
 
-  if (existingSignature && existingSignedAt) {
-    const publicKeyBytes = await signingGetPublicKey(args.privateKeyBytes);
-    const signatureBytes = signingFromHex(existingSignature);
-    const isValid = await signingVerify(publicKeyBytes, signablePayload, signatureBytes);
-
-    if (isValid) {
-      const publicKeyHex = signingToHex(publicKeyBytes);
-      return {
-        signatureHex: existingSignature,
-        publicKeyHex,
-        publicKeyUrl: existingPublicKeyUrl ?? args.publicKeyUrl ?? null,
-        signedAt: existingSignedAt,
-        reusedExistingSignature: true,
-      };
-    }
-  }
+  if (existingSignature && existingSignedAt) {}
 
   const signatureBytes = await signingSign(args.privateKeyBytes, signablePayload);
killedBy: RFC-0931: signBuildIdentity reuses existing signature when payload hasn't changed (idempotency)
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/integrity/signing.ts:404:7
   const existingPublicKeyUrl =
     typeof identity.publicKeyUrl === "string" ? identity.publicKeyUrl : null;
 
-  if (existingSignature && existingSignedAt) {
+  if (false) {
     const publicKeyBytes = await signingGetPublicKey(args.privateKeyBytes);
     const signatureBytes = signingFromHex(existingSignature);
killedBy: RFC-0931: signBuildIdentity reuses existing signature when payload hasn't changed (idempotency)
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/integrity/signing.ts:409:18
     const signatureBytes = signingFromHex(existingSignature);
     const isValid = await signingVerify(publicKeyBytes, signablePayload, signatureBytes);
 
-    if (isValid) {
-      const publicKeyHex = signingToHex(publicKeyBytes);
-      return {
-        signatureHex: existingSignature,
-        publicKeyHex,
-        publicKeyUrl: existingPublicKeyUrl ?? args.publicKeyUrl ?? null,
-        signedAt: existingSignedAt,
-        reusedExistingSignature: true,
-      };
-    }
+    if (isValid) {}
   }
 
killedBy: RFC-0931: signBuildIdentity reuses existing signature when payload hasn't changed (idempotency)
statusReason: expected false to be true // Object.is equality

[Killed] ObjectLiteral
src/integrity/signing.ts:411:14
 
     if (isValid) {
       const publicKeyHex = signingToHex(publicKeyBytes);
-      return {
-        signatureHex: existingSignature,
-        publicKeyHex,
-        publicKeyUrl: existingPublicKeyUrl ?? args.publicKeyUrl ?? null,
-        signedAt: existingSignedAt,
-        reusedExistingSignature: true,
-      };
+      return {};
     }
   }
killedBy: RFC-0931: signBuildIdentity reuses existing signature when payload hasn't changed (idempotency)
statusReason: expected undefined to be true // Object.is equality

[Survived] LogicalOperator
src/integrity/signing.ts:414:23
       return {
         signatureHex: existingSignature,
         publicKeyHex,
-        publicKeyUrl: existingPublicKeyUrl ?? args.publicKeyUrl ?? null,
+        publicKeyUrl: (existingPublicKeyUrl ?? args.publicKeyUrl) && null,
         signedAt: existingSignedAt,
         reusedExistingSignature: true,

[Survived] LogicalOperator
src/integrity/signing.ts:414:23
       return {
         signatureHex: existingSignature,
         publicKeyHex,
-        publicKeyUrl: existingPublicKeyUrl ?? args.publicKeyUrl ?? null,
+        publicKeyUrl: existingPublicKeyUrl && args.publicKeyUrl ?? null,
         signedAt: existingSignedAt,
         reusedExistingSignature: true,

[Killed] BooleanLiteral
src/integrity/signing.ts:416:34
         publicKeyHex,
         publicKeyUrl: existingPublicKeyUrl ?? args.publicKeyUrl ?? null,
         signedAt: existingSignedAt,
-        reusedExistingSignature: true,
+        reusedExistingSignature: false,
       };
     }
killedBy: RFC-0931: signBuildIdentity reuses existing signature when payload hasn't changed (idempotency)
statusReason: expected false to be true // Object.is equality

[Killed] LogicalOperator
src/integrity/signing.ts:429:19
   const signed: Record<string, unknown> = {
     ...signablePayload,
     signature: signatureHex,
-    publicKeyUrl: args.publicKeyUrl ?? null,
+    publicKeyUrl: args.publicKeyUrl && null,
     signedAt,
   };
killedBy: RFC-0931: signBuildIdentity signs build-identity.json and embeds signature, publicKeyUrl, signedAt
statusReason: expected null to be 'https://example.com/.well-known/relea…' // Object.is equality

[Killed] ObjectLiteral
src/integrity/signing.ts:435:10
 
   await atomicWriteFile(args.buildIdentityPath, JSON.stringify(signed, null, 2));
 
-  return {
-    signatureHex,
-    publicKeyHex,
-    publicKeyUrl: args.publicKeyUrl ?? null,
-    signedAt,
-    reusedExistingSignature: false,
-  };
+  return {};
 }
 
killedBy: RFC-0931: signBuildIdentity signs build-identity.json and embeds signature, publicKeyUrl, signedAt
statusReason: .toMatch() expects to receive a string, but got undefined

[Killed] LogicalOperator
src/integrity/signing.ts:438:19
   return {
     signatureHex,
     publicKeyHex,
-    publicKeyUrl: args.publicKeyUrl ?? null,
+    publicKeyUrl: args.publicKeyUrl && null,
     signedAt,
     reusedExistingSignature: false,
killedBy: RFC-0931: signBuildIdentity signs build-identity.json and embeds signature, publicKeyUrl, signedAt
statusReason: expected null to be 'https://example.com/.well-known/relea…' // Object.is equality

[Killed] BooleanLiteral
src/integrity/signing.ts:440:30
     publicKeyHex,
     publicKeyUrl: args.publicKeyUrl ?? null,
     signedAt,
-    reusedExistingSignature: false,
+    reusedExistingSignature: true,
   };
 }
killedBy: RFC-0931: signBuildIdentity signs build-identity.json and embeds signature, publicKeyUrl, signedAt
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/integrity/signing.ts:447:21
 export async function writeReleasePublicKey(args: {
   distDir: string;
   publicKeyHex: string;
-}): Promise<string> {
-  const wellKnownDir = path.join(args.distDir, "client", ".well-known");
-  await ensureDir(wellKnownDir);
-  const pubKeyPath = path.join(wellKnownDir, "release-pubkey.json");
-  const keyId = byteHash(args.publicKeyHex).slice("sha256:".length);
-  const content = {
-    keyId,
-    publicKeyHex: args.publicKeyHex,
-    algorithm: "Ed25519",
-    createdAt: new Date().toISOString(),
-  };
-  await atomicWriteFile(pubKeyPath, JSON.stringify(content, null, 2));
-  return pubKeyPath;
-}
+}): Promise<string> {}
 
 export async function verifyBuildIdentitySignature(args: {
killedBy: RFC-0931: writeReleasePublicKey writes release-pubkey.json to dist/client/.well-known/
statusReason: expected false to be true // Object.is equality

[Survived] StringLiteral
src/integrity/signing.ts:448:58
   distDir: string;
   publicKeyHex: string;
 }): Promise<string> {
-  const wellKnownDir = path.join(args.distDir, "client", ".well-known");
+  const wellKnownDir = path.join(args.distDir, "client", "");
   await ensureDir(wellKnownDir);
   const pubKeyPath = path.join(wellKnownDir, "release-pubkey.json");

[Killed] MethodExpression
src/integrity/signing.ts:451:17
   const wellKnownDir = path.join(args.distDir, "client", ".well-known");
   await ensureDir(wellKnownDir);
   const pubKeyPath = path.join(wellKnownDir, "release-pubkey.json");
-  const keyId = byteHash(args.publicKeyHex).slice("sha256:".length);
+  const keyId = byteHash(args.publicKeyHex);
   const content = {
     keyId,
killedBy: RFC-0931: writeReleasePublicKey writes release-pubkey.json to dist/client/.well-known/
statusReason: expected 'sha256:50f444db6b063a8046bbcf98a97ee4…' to match /^[0-9a-f]{64}$/

[Killed] StringLiteral
src/integrity/signing.ts:451:51
   const wellKnownDir = path.join(args.distDir, "client", ".well-known");
   await ensureDir(wellKnownDir);
   const pubKeyPath = path.join(wellKnownDir, "release-pubkey.json");
-  const keyId = byteHash(args.publicKeyHex).slice("sha256:".length);
+  const keyId = byteHash(args.publicKeyHex).slice("".length);
   const content = {
     keyId,
killedBy: RFC-0931: writeReleasePublicKey writes release-pubkey.json to dist/client/.well-known/
statusReason: expected 'sha256:c21925bd750df3cc818549694830f8…' to match /^[0-9a-f]{64}$/

[Killed] ObjectLiteral
src/integrity/signing.ts:452:19
   await ensureDir(wellKnownDir);
   const pubKeyPath = path.join(wellKnownDir, "release-pubkey.json");
   const keyId = byteHash(args.publicKeyHex).slice("sha256:".length);
-  const content = {
-    keyId,
-    publicKeyHex: args.publicKeyHex,
-    algorithm: "Ed25519",
-    createdAt: new Date().toISOString(),
-  };
+  const content = {};
   await atomicWriteFile(pubKeyPath, JSON.stringify(content, null, 2));
   return pubKeyPath;
killedBy: RFC-0931: writeReleasePublicKey writes release-pubkey.json to dist/client/.well-known/
statusReason: expected undefined to be '453167707563d0ab1fe3487ac3b6df5a79578…' // Object.is equality

[Killed] StringLiteral
src/integrity/signing.ts:455:16
   const content = {
     keyId,
     publicKeyHex: args.publicKeyHex,
-    algorithm: "Ed25519",
+    algorithm: "",
     createdAt: new Date().toISOString(),
   };
killedBy: RFC-0931: writeReleasePublicKey writes release-pubkey.json to dist/client/.well-known/
statusReason: expected '' to be 'Ed25519' // Object.is equality

[Killed] BlockStatement
src/integrity/signing.ts:465:22
 export async function verifyBuildIdentitySignature(args: {
   buildIdentity: Record<string, unknown>;
   publicKeyHex: string;
-}): Promise<boolean> {
-  const signature =
-    typeof args.buildIdentity.signature === "string" ? args.buildIdentity.signature : null;
-  if (!signature) return false;
-
-  const signablePayload: Record<string, unknown> = {};
-  for (const [key, value] of Object.entries(args.buildIdentity)) {
-    if (!SIGNATURE_FIELDS.includes(key as (typeof SIGNATURE_FIELDS)[number])) {
-      signablePayload[key] = value;
-    }
-  }
-
-  const publicKeyBytes = signingFromHex(args.publicKeyHex);
-  const signatureBytes = signingFromHex(signature);
-  return signingVerify(publicKeyBytes, signablePayload, signatureBytes);
-}
+}): Promise<boolean> {}
 
killedBy: RFC-0931: verifyBuildIdentitySignature verifies a valid signature
statusReason: expected undefined to be true // Object.is equality

[Killed] ConditionalExpression
src/integrity/signing.ts:467:5
   publicKeyHex: string;
 }): Promise<boolean> {
   const signature =
-    typeof args.buildIdentity.signature === "string" ? args.buildIdentity.signature : null;
+    false ? args.buildIdentity.signature : null;
   if (!signature) return false;
 
killedBy: RFC-0931: verifyBuildIdentitySignature verifies a valid signature
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/integrity/signing.ts:467:5
   publicKeyHex: string;
 }): Promise<boolean> {
   const signature =
-    typeof args.buildIdentity.signature === "string" ? args.buildIdentity.signature : null;
+    typeof args.buildIdentity.signature !== "string" ? args.buildIdentity.signature : null;
   if (!signature) return false;
 
killedBy: RFC-0931: verifyBuildIdentitySignature verifies a valid signature
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/integrity/signing.ts:468:7
 }): Promise<boolean> {
   const signature =
     typeof args.buildIdentity.signature === "string" ? args.buildIdentity.signature : null;
-  if (!signature) return false;
+  if (false) return false;
 
   const signablePayload: Record<string, unknown> = {};
killedBy: RFC-0931: verifyBuildIdentitySignature returns false when no signature present
statusReason: The first argument must be of type string or an instance of Buffer, ArrayBuffer, or Array or an Array-like Object. Received null

[Killed] ConditionalExpression
src/integrity/signing.ts:468:7
 }): Promise<boolean> {
   const signature =
     typeof args.buildIdentity.signature === "string" ? args.buildIdentity.signature : null;
-  if (!signature) return false;
+  if (true) return false;
 
   const signablePayload: Record<string, unknown> = {};
killedBy: RFC-0931: verifyBuildIdentitySignature verifies a valid signature
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/integrity/signing.ts:471:66
   if (!signature) return false;
 
   const signablePayload: Record<string, unknown> = {};
-  for (const [key, value] of Object.entries(args.buildIdentity)) {
-    if (!SIGNATURE_FIELDS.includes(key as (typeof SIGNATURE_FIELDS)[number])) {
-      signablePayload[key] = value;
-    }
-  }
+  for (const [key, value] of Object.entries(args.buildIdentity)) {}
 
   const publicKeyBytes = signingFromHex(args.publicKeyHex);
killedBy: RFC-0931: verifyBuildIdentitySignature verifies a valid signature
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/integrity/signing.ts:472:9
 
   const signablePayload: Record<string, unknown> = {};
   for (const [key, value] of Object.entries(args.buildIdentity)) {
-    if (!SIGNATURE_FIELDS.includes(key as (typeof SIGNATURE_FIELDS)[number])) {
+    if (SIGNATURE_FIELDS.includes(key as typeof SIGNATURE_FIELDS[number])) {
       signablePayload[key] = value;
     }
killedBy: RFC-0931: verifyBuildIdentitySignature verifies a valid signature
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/integrity/signing.ts:472:9
 
   const signablePayload: Record<string, unknown> = {};
   for (const [key, value] of Object.entries(args.buildIdentity)) {
-    if (!SIGNATURE_FIELDS.includes(key as (typeof SIGNATURE_FIELDS)[number])) {
+    if (true) {
       signablePayload[key] = value;
     }
killedBy: RFC-0931: verifyBuildIdentitySignature verifies a valid signature
statusReason: expected false to be true // Object.is equality
