[Survived] BlockStatement
src/integrity/fs.ts:25:65
 
 import { promises as fs } from "node:fs";
 
-export async function ensureDir(dirPath: string): Promise<void> {
-  await fs.mkdir(dirPath, { recursive: true });
-}
+export async function ensureDir(dirPath: string): Promise<void> {}
 
 export async function pathExists(targetPath: string): Promise<boolean> {

[Killed] BooleanLiteral
src/integrity/fs.ts:26:40
 import { promises as fs } from "node:fs";
 
 export async function ensureDir(dirPath: string): Promise<void> {
-  await fs.mkdir(dirPath, { recursive: true });
+  await fs.mkdir(dirPath, { recursive: false });
 }
 
killedBy: RFC-0931: writeReleasePublicKey writes release-pubkey.json to dist/client/.well-known/
statusReason: ENOENT: no such file or directory, mkdir '/tmp/leitstand-sign-IbBeU6/dist/client/.well-known'

[Killed] ObjectLiteral
src/integrity/fs.ts:26:27
 import { promises as fs } from "node:fs";
 
 export async function ensureDir(dirPath: string): Promise<void> {
-  await fs.mkdir(dirPath, { recursive: true });
+  await fs.mkdir(dirPath, {});
 }
 
killedBy: RFC-0931: writeReleasePublicKey writes release-pubkey.json to dist/client/.well-known/
statusReason: ENOENT: no such file or directory, mkdir '/tmp/leitstand-sign-SAIOLc/dist/client/.well-known'

[NoCoverage] BlockStatement
src/integrity/fs.ts:29:72
   await fs.mkdir(dirPath, { recursive: true });
 }
 
-export async function pathExists(targetPath: string): Promise<boolean> {
-  try {
-    await fs.access(targetPath);
-    return true;
-  } catch {
-    return false;
-  }
-}
+export async function pathExists(targetPath: string): Promise<boolean> {}
 
 export async function readText(filePath: string): Promise<string> {

[NoCoverage] BlockStatement
src/integrity/fs.ts:30:7
 }
 
 export async function pathExists(targetPath: string): Promise<boolean> {
-  try {
-    await fs.access(targetPath);
-    return true;
-  } catch {
+  try {} catch {
     return false;
   }

[NoCoverage] BooleanLiteral
src/integrity/fs.ts:32:12
 export async function pathExists(targetPath: string): Promise<boolean> {
   try {
     await fs.access(targetPath);
-    return true;
+    return false;
   } catch {
     return false;

[Killed] BlockStatement
src/integrity/fs.ts:38:67
   }
 }
 
-export async function readText(filePath: string): Promise<string> {
-  return fs.readFile(filePath, "utf8");
-}
+export async function readText(filePath: string): Promise<string> {}
 
 export async function writeText(filePath: string, content: string): Promise<void> {
killedBy: RFC-0931: signBuildIdentity signs build-identity.json and embeds signature, publicKeyUrl, signedAt
statusReason: "undefined" is not valid JSON

[NoCoverage] BlockStatement
src/integrity/fs.ts:42:83
   return fs.readFile(filePath, "utf8");
 }
 
-export async function writeText(filePath: string, content: string): Promise<void> {
-  await fs.writeFile(filePath, content, "utf8");
-}
+export async function writeText(filePath: string, content: string): Promise<void> {}
 
 export async function readBuffer(filePath: string): Promise<Buffer> {

[NoCoverage] BlockStatement
src/integrity/fs.ts:46:69
   await fs.writeFile(filePath, content, "utf8");
 }
 
-export async function readBuffer(filePath: string): Promise<Buffer> {
-  return fs.readFile(filePath);
-}
+export async function readBuffer(filePath: string): Promise<Buffer> {}
 
