[NoCoverage] BlockStatement
src/integrity/git.ts:31:98
   timeoutMs?: number;
 }
 
-async function runGit(cwd: string, args: string[], options: RunGitOptions = {}): Promise<string> {
-  const { timeoutMs = DEFAULT_GIT_TIMEOUT_MS } = options;
-  const { stdout } = await execFileAsync("git", args, {
-    cwd,
-    maxBuffer: 20 * 1024 * 1024,
-    timeout: timeoutMs,
-  });
-  return stdout.trimEnd();
-}
+async function runGit(cwd: string, args: string[], options: RunGitOptions = {}): Promise<string> {}
 
 function uniqueSorted(values: Iterable<string>): string[] {

[NoCoverage] ObjectLiteral
src/integrity/git.ts:33:55
 
 async function runGit(cwd: string, args: string[], options: RunGitOptions = {}): Promise<string> {
   const { timeoutMs = DEFAULT_GIT_TIMEOUT_MS } = options;
-  const { stdout } = await execFileAsync("git", args, {
-    cwd,
-    maxBuffer: 20 * 1024 * 1024,
-    timeout: timeoutMs,
-  });
+  const { stdout } = await execFileAsync("git", args, {});
   return stdout.trimEnd();
 }

[NoCoverage] ArithmeticOperator
src/integrity/git.ts:35:16
   const { timeoutMs = DEFAULT_GIT_TIMEOUT_MS } = options;
   const { stdout } = await execFileAsync("git", args, {
     cwd,
-    maxBuffer: 20 * 1024 * 1024,
+    maxBuffer: 20 / 1024 * 1024,
     timeout: timeoutMs,
   });

[NoCoverage] ArithmeticOperator
src/integrity/git.ts:35:16
   const { timeoutMs = DEFAULT_GIT_TIMEOUT_MS } = options;
   const { stdout } = await execFileAsync("git", args, {
     cwd,
-    maxBuffer: 20 * 1024 * 1024,
+    maxBuffer: 20 * 1024 / 1024,
     timeout: timeoutMs,
   });

[NoCoverage] MethodExpression
src/integrity/git.ts:38:10
     maxBuffer: 20 * 1024 * 1024,
     timeout: timeoutMs,
   });
-  return stdout.trimEnd();
+  return stdout.trimStart();
 }
 

[NoCoverage] BlockStatement
src/integrity/git.ts:41:59
   return stdout.trimEnd();
 }
 
-function uniqueSorted(values: Iterable<string>): string[] {
-  return Array.from(new Set(values)).sort((a, b) => a.localeCompare(b));
-}
+function uniqueSorted(values: Iterable<string>): string[] {}
 
 export async function getTrackedFiles(cwd: string): Promise<string[]> {

[NoCoverage] MethodExpression
src/integrity/git.ts:42:10
 }
 
 function uniqueSorted(values: Iterable<string>): string[] {
-  return Array.from(new Set(values)).sort((a, b) => a.localeCompare(b));
+  return Array.from(new Set(values));
 }
 

[NoCoverage] ArrowFunction
src/integrity/git.ts:42:43
 }
 
 function uniqueSorted(values: Iterable<string>): string[] {
-  return Array.from(new Set(values)).sort((a, b) => a.localeCompare(b));
+  return Array.from(new Set(values)).sort(() => undefined);
 }
 

[NoCoverage] BlockStatement
src/integrity/git.ts:45:71
   return Array.from(new Set(values)).sort((a, b) => a.localeCompare(b));
 }
 
-export async function getTrackedFiles(cwd: string): Promise<string[]> {
-  const output = await runGit(cwd, ["ls-files"]);
-  return output ? output.split("\n").filter(Boolean) : [];
-}
+export async function getTrackedFiles(cwd: string): Promise<string[]> {}
 
 export async function getFileHistory(cwd: string, repoPath: string): Promise<GitFileHistory> {

[NoCoverage] MethodExpression
src/integrity/git.ts:47:19
 
 export async function getTrackedFiles(cwd: string): Promise<string[]> {
   const output = await runGit(cwd, ["ls-files"]);
-  return output ? output.split("\n").filter(Boolean) : [];
+  return output ? output.split("\n") : [];
 }
 

[NoCoverage] ArrayDeclaration
src/integrity/git.ts:47:56
 
 export async function getTrackedFiles(cwd: string): Promise<string[]> {
   const output = await runGit(cwd, ["ls-files"]);
-  return output ? output.split("\n").filter(Boolean) : [];
+  return output ? output.split("\n").filter(Boolean) : ["Stryker was here"];
 }
 

[NoCoverage] BlockStatement
src/integrity/git.ts:51:7
 }
 
 export async function getFileHistory(cwd: string, repoPath: string): Promise<GitFileHistory> {
-  try {
-    const latestOutput = await runGit(
-      cwd,
-      ["log", "--follow", "-1", "--format=%aI%x09%H", "--", repoPath],
-      { timeoutMs: 10_000 },
-    ).catch(() => "");
-
-    const [updatedAtRaw, lastCommitShaRaw] = latestOutput.split("\t");
-
-    const createdOutput = await runGit(
-      cwd,
-      ["log", "--follow", "--diff-filter=A", "--format=%aI", "--", repoPath],
-      { timeoutMs: 5_000 },
-    ).catch(() => "");
-
-    const createdLines = createdOutput ? createdOutput.split("\n").filter(Boolean) : [];
-    return {
-      createdAt: createdLines.length ? createdLines[createdLines.length - 1] : null,
-      updatedAt: updatedAtRaw || null,
-      lastCommitSha: lastCommitShaRaw || null,
-    };
-  } catch {
+  try {} catch {
     return { createdAt: null, updatedAt: null, lastCommitSha: null };
   }

[NoCoverage] StringLiteral
src/integrity/git.ts:54:15
   try {
     const latestOutput = await runGit(
       cwd,
-      ["log", "--follow", "-1", "--format=%aI%x09%H", "--", repoPath],
+      ["log", "", "-1", "--format=%aI%x09%H", "--", repoPath],
       { timeoutMs: 10_000 },
     ).catch(() => "");

[NoCoverage] ObjectLiteral
src/integrity/git.ts:55:7
     const latestOutput = await runGit(
       cwd,
       ["log", "--follow", "-1", "--format=%aI%x09%H", "--", repoPath],
-      { timeoutMs: 10_000 },
+      {},
     ).catch(() => "");
 

[NoCoverage] ArrowFunction
src/integrity/git.ts:56:13
       cwd,
       ["log", "--follow", "-1", "--format=%aI%x09%H", "--", repoPath],
       { timeoutMs: 10_000 },
-    ).catch(() => "");
+    ).catch(() => undefined);
 
     const [updatedAtRaw, lastCommitShaRaw] = latestOutput.split("\t");

[NoCoverage] StringLiteral
src/integrity/git.ts:56:19
       cwd,
       ["log", "--follow", "-1", "--format=%aI%x09%H", "--", repoPath],
       { timeoutMs: 10_000 },
-    ).catch(() => "");
+    ).catch(() => "Stryker was here!");
 
     const [updatedAtRaw, lastCommitShaRaw] = latestOutput.split("\t");

[NoCoverage] StringLiteral
src/integrity/git.ts:58:65
       { timeoutMs: 10_000 },
     ).catch(() => "");
 
-    const [updatedAtRaw, lastCommitShaRaw] = latestOutput.split("\t");
+    const [updatedAtRaw, lastCommitShaRaw] = latestOutput.split("");
 
     const createdOutput = await runGit(

[NoCoverage] StringLiteral
src/integrity/git.ts:62:46
 
     const createdOutput = await runGit(
       cwd,
-      ["log", "--follow", "--diff-filter=A", "--format=%aI", "--", repoPath],
+      ["log", "--follow", "--diff-filter=A", "", "--", repoPath],
       { timeoutMs: 5_000 },
     ).catch(() => "");

[NoCoverage] StringLiteral
src/integrity/git.ts:62:8
 
     const createdOutput = await runGit(
       cwd,
-      ["log", "--follow", "--diff-filter=A", "--format=%aI", "--", repoPath],
+      ["", "--follow", "--diff-filter=A", "--format=%aI", "--", repoPath],
       { timeoutMs: 5_000 },
     ).catch(() => "");

[NoCoverage] ArrowFunction
src/integrity/git.ts:64:13
       cwd,
       ["log", "--follow", "--diff-filter=A", "--format=%aI", "--", repoPath],
       { timeoutMs: 5_000 },
-    ).catch(() => "");
+    ).catch(() => undefined);
 
     const createdLines = createdOutput ? createdOutput.split("\n").filter(Boolean) : [];

[NoCoverage] MethodExpression
src/integrity/git.ts:66:42
       { timeoutMs: 5_000 },
     ).catch(() => "");
 
-    const createdLines = createdOutput ? createdOutput.split("\n").filter(Boolean) : [];
+    const createdLines = createdOutput ? createdOutput.split("\n") : [];
     return {
       createdAt: createdLines.length ? createdLines[createdLines.length - 1] : null,

[NoCoverage] ArrayDeclaration
src/integrity/git.ts:66:86
       { timeoutMs: 5_000 },
     ).catch(() => "");
 
-    const createdLines = createdOutput ? createdOutput.split("\n").filter(Boolean) : [];
+    const createdLines = createdOutput ? createdOutput.split("\n").filter(Boolean) : ["Stryker was here"];
     return {
       createdAt: createdLines.length ? createdLines[createdLines.length - 1] : null,

[NoCoverage] ArithmeticOperator
src/integrity/git.ts:68:53
 
     const createdLines = createdOutput ? createdOutput.split("\n").filter(Boolean) : [];
     return {
-      createdAt: createdLines.length ? createdLines[createdLines.length - 1] : null,
+      createdAt: createdLines.length ? createdLines[createdLines.length + 1] : null,
       updatedAt: updatedAtRaw || null,
       lastCommitSha: lastCommitShaRaw || null,

[NoCoverage] ConditionalExpression
src/integrity/git.ts:69:18
     const createdLines = createdOutput ? createdOutput.split("\n").filter(Boolean) : [];
     return {
       createdAt: createdLines.length ? createdLines[createdLines.length - 1] : null,
-      updatedAt: updatedAtRaw || null,
+      updatedAt: false,
       lastCommitSha: lastCommitShaRaw || null,
     };

[NoCoverage] LogicalOperator
src/integrity/git.ts:69:18
     const createdLines = createdOutput ? createdOutput.split("\n").filter(Boolean) : [];
     return {
       createdAt: createdLines.length ? createdLines[createdLines.length - 1] : null,
-      updatedAt: updatedAtRaw || null,
+      updatedAt: updatedAtRaw && null,
       lastCommitSha: lastCommitShaRaw || null,
     };

[NoCoverage] LogicalOperator
src/integrity/git.ts:70:22
     return {
       createdAt: createdLines.length ? createdLines[createdLines.length - 1] : null,
       updatedAt: updatedAtRaw || null,
-      lastCommitSha: lastCommitShaRaw || null,
+      lastCommitSha: lastCommitShaRaw && null,
     };
   } catch {

[NoCoverage] ConditionalExpression
src/integrity/git.ts:70:22
     return {
       createdAt: createdLines.length ? createdLines[createdLines.length - 1] : null,
       updatedAt: updatedAtRaw || null,
-      lastCommitSha: lastCommitShaRaw || null,
+      lastCommitSha: true,
     };
   } catch {

[NoCoverage] BlockStatement
src/integrity/git.ts:72:11
       updatedAt: updatedAtRaw || null,
       lastCommitSha: lastCommitShaRaw || null,
     };
-  } catch {
-    return { createdAt: null, updatedAt: null, lastCommitSha: null };
-  }
+  } catch {}
 }
 

[NoCoverage] BlockStatement
src/integrity/git.ts:77:98
   }
 }
 
-export async function getFileRevisionFromHistory(cwd: string, repoPath: string): Promise<number> {
-  try {
-    const output = await runGit(
-      cwd,
-      ["log", "--follow", "--diff-filter=AMT", "--format=%H", "--", repoPath],
-      { timeoutMs: 15_000 },
-    ).catch(() => "");
-
-    if (!output) {
-      return 1;
-    }
-
-    const revisions = output.split("\n").filter(Boolean).length;
-    return Math.max(1, revisions);
-  } catch {
-    return 1;
-  }
-}
+export async function getFileRevisionFromHistory(cwd: string, repoPath: string): Promise<number> {}
 
 function parseNameStatus(output: string): ChangedPaths {

[NoCoverage] BlockStatement
src/integrity/git.ts:78:7
 }
 
 export async function getFileRevisionFromHistory(cwd: string, repoPath: string): Promise<number> {
-  try {
-    const output = await runGit(
-      cwd,
-      ["log", "--follow", "--diff-filter=AMT", "--format=%H", "--", repoPath],
-      { timeoutMs: 15_000 },
-    ).catch(() => "");
-
-    if (!output) {
-      return 1;
-    }
-
-    const revisions = output.split("\n").filter(Boolean).length;
-    return Math.max(1, revisions);
-  } catch {
+  try {} catch {
     return 1;
   }

[NoCoverage] StringLiteral
src/integrity/git.ts:81:15
   try {
     const output = await runGit(
       cwd,
-      ["log", "--follow", "--diff-filter=AMT", "--format=%H", "--", repoPath],
+      ["log", "", "--diff-filter=AMT", "--format=%H", "--", repoPath],
       { timeoutMs: 15_000 },
     ).catch(() => "");

[NoCoverage] ArrowFunction
src/integrity/git.ts:83:13
       cwd,
       ["log", "--follow", "--diff-filter=AMT", "--format=%H", "--", repoPath],
       { timeoutMs: 15_000 },
-    ).catch(() => "");
+    ).catch(() => undefined);
 
     if (!output) {

[NoCoverage] BlockStatement
src/integrity/git.ts:85:18
       { timeoutMs: 15_000 },
     ).catch(() => "");
 
-    if (!output) {
-      return 1;
-    }
+    if (!output) {}
 
     const revisions = output.split("\n").filter(Boolean).length;

[NoCoverage] ConditionalExpression
src/integrity/git.ts:85:9
       { timeoutMs: 15_000 },
     ).catch(() => "");
 
-    if (!output) {
+    if (false) {
       return 1;
     }

[NoCoverage] MethodExpression
src/integrity/git.ts:89:23
       return 1;
     }
 
-    const revisions = output.split("\n").filter(Boolean).length;
+    const revisions = output.split("\n").length;
     return Math.max(1, revisions);
   } catch {

[NoCoverage] MethodExpression
src/integrity/git.ts:90:12
     }
 
     const revisions = output.split("\n").filter(Boolean).length;
-    return Math.max(1, revisions);
+    return Math.min(1, revisions);
   } catch {
     return 1;

[NoCoverage] BlockStatement
src/integrity/git.ts:91:11
 
     const revisions = output.split("\n").filter(Boolean).length;
     return Math.max(1, revisions);
-  } catch {
-    return 1;
-  }
+  } catch {}
 }
 

[NoCoverage] BlockStatement
src/integrity/git.ts:96:56
   }
 }
 
-function parseNameStatus(output: string): ChangedPaths {
-  const added = new Set<string>();
-  const modified = new Set<string>();
-  const deleted = new Set<string>();
-  const renamed: Array<{ from: string; to: string }> = [];
-
-  for (const line of output.split("\n").filter(Boolean)) {
-    const parts = line.split("\t");
-    const status = parts[0] ?? "";
-    if (status.startsWith("R") && parts[1] && parts[2]) {
-      renamed.push({ from: parts[1], to: parts[2] });
-      continue;
-    }
-    if (status === "A" && parts[1]) added.add(parts[1]);
-    if ((status === "M" || status === "T") && parts[1]) modified.add(parts[1]);
-    if (status === "D" && parts[1]) deleted.add(parts[1]);
-  }
-
-  return {
-    added: uniqueSorted(added),
-    modified: uniqueSorted(modified),
-    deleted: uniqueSorted(deleted),
-    renamed,
-  };
-}
+function parseNameStatus(output: string): ChangedPaths {}
 
 function parsePorcelainStatus(output: string): ChangedPaths {

[NoCoverage] BlockStatement
src/integrity/git.ts:102:58
   const deleted = new Set<string>();
   const renamed: Array<{ from: string; to: string }> = [];
 
-  for (const line of output.split("\n").filter(Boolean)) {
-    const parts = line.split("\t");
-    const status = parts[0] ?? "";
-    if (status.startsWith("R") && parts[1] && parts[2]) {
-      renamed.push({ from: parts[1], to: parts[2] });
-      continue;
-    }
-    if (status === "A" && parts[1]) added.add(parts[1]);
-    if ((status === "M" || status === "T") && parts[1]) modified.add(parts[1]);
-    if (status === "D" && parts[1]) deleted.add(parts[1]);
-  }
+  for (const line of output.split("\n").filter(Boolean)) {}
 
   return {

[NoCoverage] MethodExpression
src/integrity/git.ts:102:22
   const deleted = new Set<string>();
   const renamed: Array<{ from: string; to: string }> = [];
 
-  for (const line of output.split("\n").filter(Boolean)) {
+  for (const line of output.split("\n")) {
     const parts = line.split("\t");
     const status = parts[0] ?? "";

[NoCoverage] LogicalOperator
src/integrity/git.ts:104:20
 
   for (const line of output.split("\n").filter(Boolean)) {
     const parts = line.split("\t");
-    const status = parts[0] ?? "";
+    const status = parts[0] && "";
     if (status.startsWith("R") && parts[1] && parts[2]) {
       renamed.push({ from: parts[1], to: parts[2] });

[NoCoverage] StringLiteral
src/integrity/git.ts:104:32
 
   for (const line of output.split("\n").filter(Boolean)) {
     const parts = line.split("\t");
-    const status = parts[0] ?? "";
+    const status = parts[0] ?? "Stryker was here!";
     if (status.startsWith("R") && parts[1] && parts[2]) {
       renamed.push({ from: parts[1], to: parts[2] });

[NoCoverage] MethodExpression
src/integrity/git.ts:105:9
   for (const line of output.split("\n").filter(Boolean)) {
     const parts = line.split("\t");
     const status = parts[0] ?? "";
-    if (status.startsWith("R") && parts[1] && parts[2]) {
+    if (status.endsWith("R") && parts[1] && parts[2]) {
       renamed.push({ from: parts[1], to: parts[2] });
       continue;

[NoCoverage] ConditionalExpression
src/integrity/git.ts:105:9
   for (const line of output.split("\n").filter(Boolean)) {
     const parts = line.split("\t");
     const status = parts[0] ?? "";
-    if (status.startsWith("R") && parts[1] && parts[2]) {
+    if (false) {
       renamed.push({ from: parts[1], to: parts[2] });
       continue;

[NoCoverage] ObjectLiteral
src/integrity/git.ts:106:20
     const parts = line.split("\t");
     const status = parts[0] ?? "";
     if (status.startsWith("R") && parts[1] && parts[2]) {
-      renamed.push({ from: parts[1], to: parts[2] });
+      renamed.push({});
       continue;
     }

[NoCoverage] EqualityOperator
src/integrity/git.ts:109:9
       renamed.push({ from: parts[1], to: parts[2] });
       continue;
     }
-    if (status === "A" && parts[1]) added.add(parts[1]);
+    if (status !== "A" && parts[1]) added.add(parts[1]);
     if ((status === "M" || status === "T") && parts[1]) modified.add(parts[1]);
     if (status === "D" && parts[1]) deleted.add(parts[1]);

[NoCoverage] ConditionalExpression
src/integrity/git.ts:109:9
       renamed.push({ from: parts[1], to: parts[2] });
       continue;
     }
-    if (status === "A" && parts[1]) added.add(parts[1]);
+    if (true) added.add(parts[1]);
     if ((status === "M" || status === "T") && parts[1]) modified.add(parts[1]);
     if (status === "D" && parts[1]) deleted.add(parts[1]);

[NoCoverage] ConditionalExpression
src/integrity/git.ts:110:10
       continue;
     }
     if (status === "A" && parts[1]) added.add(parts[1]);
-    if ((status === "M" || status === "T") && parts[1]) modified.add(parts[1]);
+    if ((false || status === "T") && parts[1]) modified.add(parts[1]);
     if (status === "D" && parts[1]) deleted.add(parts[1]);
   }

[NoCoverage] EqualityOperator
src/integrity/git.ts:110:28
       continue;
     }
     if (status === "A" && parts[1]) added.add(parts[1]);
-    if ((status === "M" || status === "T") && parts[1]) modified.add(parts[1]);
+    if ((status === "M" || status !== "T") && parts[1]) modified.add(parts[1]);
     if (status === "D" && parts[1]) deleted.add(parts[1]);
   }

[NoCoverage] LogicalOperator
src/integrity/git.ts:111:9
     }
     if (status === "A" && parts[1]) added.add(parts[1]);
     if ((status === "M" || status === "T") && parts[1]) modified.add(parts[1]);
-    if (status === "D" && parts[1]) deleted.add(parts[1]);
+    if (status === "D" || parts[1]) deleted.add(parts[1]);
   }
 

[NoCoverage] ConditionalExpression
src/integrity/git.ts:111:9
     }
     if (status === "A" && parts[1]) added.add(parts[1]);
     if ((status === "M" || status === "T") && parts[1]) modified.add(parts[1]);
-    if (status === "D" && parts[1]) deleted.add(parts[1]);
+    if (true) deleted.add(parts[1]);
   }
 

[NoCoverage] MethodExpression
src/integrity/git.ts:129:9
   const renamed: Array<{ from: string; to: string }> = [];
 
   for (const line of output.split("\n").filter(Boolean)) {
-    if (line.startsWith("?? ")) {
+    if (line.endsWith("?? ")) {
       added.add(line.slice(3).trim());
       continue;

[NoCoverage] ConditionalExpression
src/integrity/git.ts:129:9
   const renamed: Array<{ from: string; to: string }> = [];
 
   for (const line of output.split("\n").filter(Boolean)) {
-    if (line.startsWith("?? ")) {
+    if (true) {
       added.add(line.slice(3).trim());
       continue;

[NoCoverage] MethodExpression
src/integrity/git.ts:130:17
 
   for (const line of output.split("\n").filter(Boolean)) {
     if (line.startsWith("?? ")) {
-      added.add(line.slice(3).trim());
+      added.add(line.slice(3));
       continue;
     }

[NoCoverage] MethodExpression
src/integrity/git.ts:130:17
 
   for (const line of output.split("\n").filter(Boolean)) {
     if (line.startsWith("?? ")) {
-      added.add(line.slice(3).trim());
+      added.add(line.trim());
       continue;
     }

[NoCoverage] MethodExpression
src/integrity/git.ts:134:20
       continue;
     }
 
-    const status = line.slice(0, 2);
+    const status = line;
     const body = line.slice(3).trim();
 

[NoCoverage] MethodExpression
src/integrity/git.ts:135:18
     }
 
     const status = line.slice(0, 2);
-    const body = line.slice(3).trim();
+    const body = line.slice(3);
 
     if (body.includes(" -> ") && (status.includes("R") || status.includes("C"))) {

[NoCoverage] MethodExpression
src/integrity/git.ts:135:18
     }
 
     const status = line.slice(0, 2);
-    const body = line.slice(3).trim();
+    const body = line.trim();
 
     if (body.includes(" -> ") && (status.includes("R") || status.includes("C"))) {

[NoCoverage] ConditionalExpression
src/integrity/git.ts:137:9
     const status = line.slice(0, 2);
     const body = line.slice(3).trim();
 
-    if (body.includes(" -> ") && (status.includes("R") || status.includes("C"))) {
+    if (true) {
       const [from, to] = body.split(" -> ");
       if (from && to) {

[NoCoverage] ConditionalExpression
src/integrity/git.ts:137:9
     const status = line.slice(0, 2);
     const body = line.slice(3).trim();
 
-    if (body.includes(" -> ") && (status.includes("R") || status.includes("C"))) {
+    if (false) {
       const [from, to] = body.split(" -> ");
       if (from && to) {

[NoCoverage] ConditionalExpression
src/integrity/git.ts:139:11
 
     if (body.includes(" -> ") && (status.includes("R") || status.includes("C"))) {
       const [from, to] = body.split(" -> ");
-      if (from && to) {
+      if (true) {
         renamed.push({ from, to });
       }

[NoCoverage] LogicalOperator
src/integrity/git.ts:139:11
 
     if (body.includes(" -> ") && (status.includes("R") || status.includes("C"))) {
       const [from, to] = body.split(" -> ");
-      if (from && to) {
+      if (from || to) {
         renamed.push({ from, to });
       }

[NoCoverage] ObjectLiteral
src/integrity/git.ts:140:22
     if (body.includes(" -> ") && (status.includes("R") || status.includes("C"))) {
       const [from, to] = body.split(" -> ");
       if (from && to) {
-        renamed.push({ from, to });
+        renamed.push({});
       }
       continue;

[NoCoverage] ConditionalExpression
src/integrity/git.ts:145:9
       continue;
     }
 
-    if (status.includes("D")) {
+    if (true) {
       deleted.add(body);
       continue;

[NoCoverage] BlockStatement
src/integrity/git.ts:145:31
       continue;
     }
 
-    if (status.includes("D")) {
-      deleted.add(body);
-      continue;
-    }
+    if (status.includes("D")) {}
     if (status.includes("A")) {
       added.add(body);

[NoCoverage] CallExpression
src/integrity/git.ts:146:7
     }
 
     if (status.includes("D")) {
-      deleted.add(body);
+      ;
       continue;
     }

[NoCoverage] ConditionalExpression
src/integrity/git.ts:149:9
       deleted.add(body);
       continue;
     }
-    if (status.includes("A")) {
+    if (false) {
       added.add(body);
       continue;

[NoCoverage] BlockStatement
src/integrity/git.ts:149:31
       deleted.add(body);
       continue;
     }
-    if (status.includes("A")) {
-      added.add(body);
-      continue;
-    }
+    if (status.includes("A")) {}
     if (status.includes("M") || status.includes("T")) {
       modified.add(body);

[NoCoverage] CallExpression
src/integrity/git.ts:150:7
       continue;
     }
     if (status.includes("A")) {
-      added.add(body);
+      ;
       continue;
     }

[NoCoverage] LogicalOperator
src/integrity/git.ts:153:9
       added.add(body);
       continue;
     }
-    if (status.includes("M") || status.includes("T")) {
+    if (status.includes("M") && status.includes("T")) {
       modified.add(body);
     }

[NoCoverage] BlockStatement
src/integrity/git.ts:153:55
       added.add(body);
       continue;
     }
-    if (status.includes("M") || status.includes("T")) {
-      modified.add(body);
-    }
+    if (status.includes("M") || status.includes("T")) {}
   }
 

[NoCoverage] CallExpression
src/integrity/git.ts:154:7
       continue;
     }
     if (status.includes("M") || status.includes("T")) {
-      modified.add(body);
+      ;
     }
   }

[NoCoverage] BlockStatement
src/integrity/git.ts:166:56
   };
 }
 
-function hasAnyChanges(changes: ChangedPaths): boolean {
-  return Boolean(
-    changes.added.length ||
-    changes.modified.length ||
-    changes.deleted.length ||
-    changes.renamed.length,
-  );
-}
+function hasAnyChanges(changes: ChangedPaths): boolean {}
 
 export async function getChangedPaths(cwd: string, baseRef?: string): Promise<ChangedPaths> {

[NoCoverage] ConditionalExpression
src/integrity/git.ts:168:5
 
 function hasAnyChanges(changes: ChangedPaths): boolean {
   return Boolean(
-    changes.added.length ||
-    changes.modified.length ||
-    changes.deleted.length ||
-    changes.renamed.length,
+    false,
   );
 }

[NoCoverage] ConditionalExpression
src/integrity/git.ts:168:5
 
 function hasAnyChanges(changes: ChangedPaths): boolean {
   return Boolean(
-    changes.added.length ||
-    changes.modified.length ||
-    changes.deleted.length ||
+    false ||
     changes.renamed.length,
   );

[NoCoverage] ConditionalExpression
src/integrity/git.ts:177:9
 
 export async function getChangedPaths(cwd: string, baseRef?: string): Promise<ChangedPaths> {
   try {
-    if (baseRef) {
+    if (false) {
       const output = await runGit(
         cwd,

[NoCoverage] ConditionalExpression
src/integrity/git.ts:177:9
 
 export async function getChangedPaths(cwd: string, baseRef?: string): Promise<ChangedPaths> {
   try {
-    if (baseRef) {
+    if (true) {
       const output = await runGit(
         cwd,

[NoCoverage] StringLiteral
src/integrity/git.ts:180:10
     if (baseRef) {
       const output = await runGit(
         cwd,
-        ["diff", "--name-status", "--find-renames", `${baseRef}...HEAD`],
+        ["", "--name-status", "--find-renames", `${baseRef}...HEAD`],
         { timeoutMs: 10_000 },
       );

[NoCoverage] StringLiteral
src/integrity/git.ts:186:39
       return parseNameStatus(output);
     }
 
-    const output = await runGit(cwd, ["status", "--porcelain=1", "--untracked-files=normal"], {
+    const output = await runGit(cwd, ["", "--porcelain=1", "--untracked-files=normal"], {
       timeoutMs: 10_000,
     });

[NoCoverage] ConditionalExpression
src/integrity/git.ts:190:9
       timeoutMs: 10_000,
     });
     const workingTreeChanges = parsePorcelainStatus(output);
-    if (hasAnyChanges(workingTreeChanges)) {
+    if (false) {
       return workingTreeChanges;
     }

[NoCoverage] BlockStatement
src/integrity/git.ts:190:44
       timeoutMs: 10_000,
     });
     const workingTreeChanges = parsePorcelainStatus(output);
-    if (hasAnyChanges(workingTreeChanges)) {
-      return workingTreeChanges;
-    }
+    if (hasAnyChanges(workingTreeChanges)) {}
 
     const headDiff = await runGit(

[NoCoverage] ArrayDeclaration
src/integrity/git.ts:196:7
 
     const headDiff = await runGit(
       cwd,
-      ["diff-tree", "--no-commit-id", "--name-status", "--find-renames", "-r", "HEAD"],
+      [],
       { timeoutMs: 10_000 },
     ).catch(() => "");

[NoCoverage] BooleanLiteral
src/integrity/git.ts:200:9
       { timeoutMs: 10_000 },
     ).catch(() => "");
 
-    if (!headDiff) {
+    if (headDiff) {
       return workingTreeChanges;
     }

[NoCoverage] BlockStatement
src/integrity/git.ts:200:20
       { timeoutMs: 10_000 },
     ).catch(() => "");
 
-    if (!headDiff) {
-      return workingTreeChanges;
-    }
+    if (!headDiff) {}
 
     return parseNameStatus(headDiff);

[NoCoverage] BlockStatement
src/integrity/git.ts:205:11
     }
 
     return parseNameStatus(headDiff);
-  } catch {
-    return { added: [], modified: [], deleted: [], renamed: [] };
-  }
+  } catch {}
 }
 

[NoCoverage] ArrayDeclaration
src/integrity/git.ts:206:35
 
     return parseNameStatus(headDiff);
   } catch {
-    return { added: [], modified: [], deleted: [], renamed: [] };
+    return { added: [], modified: ["Stryker was here"], deleted: [], renamed: [] };
   }
 }

[NoCoverage] ObjectLiteral
src/integrity/git.ts:206:12
 
     return parseNameStatus(headDiff);
   } catch {
-    return { added: [], modified: [], deleted: [], renamed: [] };
+    return {};
   }
 }

[NoCoverage] BlockStatement
src/integrity/git.ts:210:71
   }
 }
 
-export async function getRepoUrl(cwd: string): Promise<string | null> {
-  try {
-    const output = await runGit(cwd, ["config", "--get", "remote.origin.url"], {
-      timeoutMs: 5_000,
-    });
-    return output || null;
-  } catch {
-    return null;
-  }
-}
+export async function getRepoUrl(cwd: string): Promise<string | null> {}
 
 export async function getHeadSha(cwd: string): Promise<string | null> {

[NoCoverage] BlockStatement
src/integrity/git.ts:211:7
 }
 
 export async function getRepoUrl(cwd: string): Promise<string | null> {
-  try {
-    const output = await runGit(cwd, ["config", "--get", "remote.origin.url"], {
-      timeoutMs: 5_000,
-    });
-    return output || null;
-  } catch {
+  try {} catch {
     return null;
   }

[NoCoverage] StringLiteral
src/integrity/git.ts:212:58
 
 export async function getRepoUrl(cwd: string): Promise<string | null> {
   try {
-    const output = await runGit(cwd, ["config", "--get", "remote.origin.url"], {
+    const output = await runGit(cwd, ["config", "--get", ""], {
       timeoutMs: 5_000,
     });

[NoCoverage] ConditionalExpression
src/integrity/git.ts:215:12
     const output = await runGit(cwd, ["config", "--get", "remote.origin.url"], {
       timeoutMs: 5_000,
     });
-    return output || null;
+    return true;
   } catch {
     return null;

[NoCoverage] ConditionalExpression
src/integrity/git.ts:215:12
     const output = await runGit(cwd, ["config", "--get", "remote.origin.url"], {
       timeoutMs: 5_000,
     });
-    return output || null;
+    return false;
   } catch {
     return null;
