[NoCoverage] BlockStatement
src/integrity/git.ts:216:11
       timeoutMs: 5_000,
     });
     return output || null;
-  } catch {
-    return null;
-  }
+  } catch {}
 }
 

[NoCoverage] BlockStatement
src/integrity/git.ts:221:71
   }
 }
 
-export async function getHeadSha(cwd: string): Promise<string | null> {
-  try {
-    const output = await runGit(cwd, ["rev-parse", "HEAD"], { timeoutMs: 5_000 });
-    return output || null;
-  } catch {
-    return null;
-  }
-}
+export async function getHeadSha(cwd: string): Promise<string | null> {}
 

[NoCoverage] BlockStatement
src/integrity/git.ts:222:7
 }
 
 export async function getHeadSha(cwd: string): Promise<string | null> {
-  try {
-    const output = await runGit(cwd, ["rev-parse", "HEAD"], { timeoutMs: 5_000 });
-    return output || null;
-  } catch {
+  try {} catch {
     return null;
   }

[NoCoverage] ConditionalExpression
src/integrity/git.ts:224:12
 export async function getHeadSha(cwd: string): Promise<string | null> {
   try {
     const output = await runGit(cwd, ["rev-parse", "HEAD"], { timeoutMs: 5_000 });
-    return output || null;
+    return true;
   } catch {
     return null;

[NoCoverage] ConditionalExpression
src/integrity/git.ts:224:12
 export async function getHeadSha(cwd: string): Promise<string | null> {
   try {
     const output = await runGit(cwd, ["rev-parse", "HEAD"], { timeoutMs: 5_000 });
-    return output || null;
+    return false;
   } catch {
     return null;
