[NoCoverage] BlockStatement
src/integrity/integrity-commands.ts:41:52
   writeText,
 } from "@warpgogol/werkstatt-engine/integrity";
 
-function requireApp(context: KernelRuntimeContext) {
-  if (!context.site) {
-    throw new Error("This command requires an app-scoped runtime context.");
-  }
-  return context.site;
-}
+function requireApp(context: KernelRuntimeContext) {}
 
 function getStringArg(

[NoCoverage] ConditionalExpression
src/integrity/integrity-commands.ts:42:7
 } from "@warpgogol/werkstatt-engine/integrity";
 
 function requireApp(context: KernelRuntimeContext) {
-  if (!context.site) {
+  if (true) {
     throw new Error("This command requires an app-scoped runtime context.");
   }

[NoCoverage] ConditionalExpression
src/integrity/integrity-commands.ts:42:7
 } from "@warpgogol/werkstatt-engine/integrity";
 
 function requireApp(context: KernelRuntimeContext) {
-  if (!context.site) {
+  if (false) {
     throw new Error("This command requires an app-scoped runtime context.");
   }

[NoCoverage] BlockStatement
src/integrity/integrity-commands.ts:52:23
   input: KernelCommandInput,
   index: number,
   fallback?: string,
-): string | undefined {
-  return fallback;
-}
+): string | undefined {}
 
 export async function runIntegrityInit(

[NoCoverage] BlockStatement
src/integrity/integrity-commands.ts:59:33
 export async function runIntegrityInit(
   _input: KernelCommandInput,
   context: KernelRuntimeContext,
-): Promise<KernelCommandResult> {
-  const app = requireApp(context);
-  if (context.dryRun) {
-    return { summary: `[integrity.init] dry-run: would initialize integrity for ${app.name}` };
-  }
-
-  await runInit({ cwd: app.directory });
-  return {
-    summary: `[integrity.init] complete for ${app.name}`,
-    nextSteps: [
-      {
-        action: `Update integrity manifests: pnpm exec werkstatt run integrity.update`,
-        kind: "optional",
-      },
-    ],
-  };
-}
+): Promise<KernelCommandResult> {}
 
 export async function runIntegrityUpdate(

[NoCoverage] BlockStatement
src/integrity/integrity-commands.ts:61:23
   context: KernelRuntimeContext,
 ): Promise<KernelCommandResult> {
   const app = requireApp(context);
-  if (context.dryRun) {
-    return { summary: `[integrity.init] dry-run: would initialize integrity for ${app.name}` };
-  }
+  if (context.dryRun) {}
 
   await runInit({ cwd: app.directory });

[NoCoverage] ConditionalExpression
src/integrity/integrity-commands.ts:61:7
   context: KernelRuntimeContext,
 ): Promise<KernelCommandResult> {
   const app = requireApp(context);
-  if (context.dryRun) {
+  if (false) {
     return { summary: `[integrity.init] dry-run: would initialize integrity for ${app.name}` };
   }

[NoCoverage] StringLiteral
src/integrity/integrity-commands.ts:67:14
 
   await runInit({ cwd: app.directory });
   return {
-    summary: `[integrity.init] complete for ${app.name}`,
+    summary: ``,
     nextSteps: [
       {

[NoCoverage] StringLiteral
src/integrity/integrity-commands.ts:71:15
     nextSteps: [
       {
         action: `Update integrity manifests: pnpm exec werkstatt run integrity.update`,
-        kind: "optional",
+        kind: "",
       },
     ],

[NoCoverage] BlockStatement
src/integrity/integrity-commands.ts:80:33
 export async function runIntegrityUpdate(
   input: KernelCommandInput,
   context: KernelRuntimeContext,
-): Promise<KernelCommandResult> {
-  const app = requireApp(context);
-  if (context.dryRun) {
-    return {
-      summary: `[integrity.update] dry-run: would update integrity manifests for ${app.name}`,
-    };
-  }
-
-  await runUpdate({ cwd: app.directory, baseRef: getStringArg(input, 0) });
-  return {
-    summary: `[integrity.update] complete for ${app.name}`,
-    nextSteps: [
-      { action: `Verify integrity: pnpm exec werkstatt run integrity.verify`, kind: "optional" },
-    ],
-  };
-}
+): Promise<KernelCommandResult> {}
 
 export async function runIntegrityVerify(

[NoCoverage] BlockStatement
src/integrity/integrity-commands.ts:82:23
   context: KernelRuntimeContext,
 ): Promise<KernelCommandResult> {
   const app = requireApp(context);
-  if (context.dryRun) {
-    return {
-      summary: `[integrity.update] dry-run: would update integrity manifests for ${app.name}`,
-    };
-  }
+  if (context.dryRun) {}
 
   await runUpdate({ cwd: app.directory, baseRef: getStringArg(input, 0) });

[NoCoverage] ObjectLiteral
src/integrity/integrity-commands.ts:88:19
     };
   }
 
-  await runUpdate({ cwd: app.directory, baseRef: getStringArg(input, 0) });
+  await runUpdate({});
   return {
     summary: `[integrity.update] complete for ${app.name}`,

[NoCoverage] ObjectLiteral
src/integrity/integrity-commands.ts:89:10
   }
 
   await runUpdate({ cwd: app.directory, baseRef: getStringArg(input, 0) });
-  return {
-    summary: `[integrity.update] complete for ${app.name}`,
-    nextSteps: [
-      { action: `Verify integrity: pnpm exec werkstatt run integrity.verify`, kind: "optional" },
-    ],
-  };
+  return {};
 }
 

[NoCoverage] ArrayDeclaration
src/integrity/integrity-commands.ts:91:16
   await runUpdate({ cwd: app.directory, baseRef: getStringArg(input, 0) });
   return {
     summary: `[integrity.update] complete for ${app.name}`,
-    nextSteps: [
-      { action: `Verify integrity: pnpm exec werkstatt run integrity.verify`, kind: "optional" },
-    ],
+    nextSteps: [],
   };
 }

[NoCoverage] StringLiteral
src/integrity/integrity-commands.ts:92:17
   return {
     summary: `[integrity.update] complete for ${app.name}`,
     nextSteps: [
-      { action: `Verify integrity: pnpm exec werkstatt run integrity.verify`, kind: "optional" },
+      { action: ``, kind: "optional" },
     ],
   };

[NoCoverage] StringLiteral
src/integrity/integrity-commands.ts:92:85
   return {
     summary: `[integrity.update] complete for ${app.name}`,
     nextSteps: [
-      { action: `Verify integrity: pnpm exec werkstatt run integrity.verify`, kind: "optional" },
+      { action: `Verify integrity: pnpm exec werkstatt run integrity.verify`, kind: "" },
     ],
   };

[NoCoverage] BlockStatement
src/integrity/integrity-commands.ts:100:50
 export async function runIntegrityVerify(
   _input: KernelCommandInput,
   context: KernelRuntimeContext,
-): Promise<KernelCommandResult<{ ok: boolean }>> {
-  const app = requireApp(context);
-  const report = await runVerify({ cwd: app.directory });
-  return {
-    data: { ok: report.ok },
-    exitCode: report.ok ? 0 : 1,
-    summary: report.ok ? "Integrity verification passed." : undefined,
-    nextSteps: report.ok
-      ? undefined
-      : [
-          {
-            action: `Fix the integrity violations above, then re-run: pnpm exec werkstatt run integrity.verify`,
-            kind: "required",
-          },
-        ],
-  };
-}
+): Promise<KernelCommandResult<{ ok: boolean }>> {}
 
 export async function runIntegrityBuildRecord(

[NoCoverage] ObjectLiteral
src/integrity/integrity-commands.ts:103:10
 ): Promise<KernelCommandResult<{ ok: boolean }>> {
   const app = requireApp(context);
   const report = await runVerify({ cwd: app.directory });
-  return {
-    data: { ok: report.ok },
-    exitCode: report.ok ? 0 : 1,
-    summary: report.ok ? "Integrity verification passed." : undefined,
-    nextSteps: report.ok
-      ? undefined
-      : [
-          {
-            action: `Fix the integrity violations above, then re-run: pnpm exec werkstatt run integrity.verify`,
-            kind: "required",
-          },
-        ],
-  };
+  return {};
 }
 

[NoCoverage] StringLiteral
src/integrity/integrity-commands.ts:112:19
       : [
           {
             action: `Fix the integrity violations above, then re-run: pnpm exec werkstatt run integrity.verify`,
-            kind: "required",
+            kind: "",
           },
         ],

[NoCoverage] BlockStatement
src/integrity/integrity-commands.ts:121:33
 export async function runIntegrityBuildRecord(
   input: KernelCommandInput,
   context: KernelRuntimeContext,
-): Promise<KernelCommandResult> {
-  const app = requireApp(context);
-  const distDir = getStringArg(input, 0, "dist") ?? "dist";
-  if (context.dryRun) {
-    return {
-      summary: `[integrity.build-record] dry-run: would record build outputs from ${distDir}`,
-    };
-  }
-
-  await runRecordBuild({ cwd: app.directory, builder: "local", distDir });
-  return {
-    summary: `[integrity.build-record] complete for ${app.name}`,
-    nextSteps: [
-      { action: `Sign the build: pnpm exec werkstatt run integrity.sign`, kind: "optional" },
-    ],
-  };
-}
+): Promise<KernelCommandResult> {}
 
 async function loadPrivateKeyPem(appDirectory: string): Promise<string> {

[NoCoverage] LogicalOperator
src/integrity/integrity-commands.ts:123:19
   context: KernelRuntimeContext,
 ): Promise<KernelCommandResult> {
   const app = requireApp(context);
-  const distDir = getStringArg(input, 0, "dist") ?? "dist";
+  const distDir = getStringArg(input, 0, "dist") && "dist";
   if (context.dryRun) {
     return {

[NoCoverage] StringLiteral
src/integrity/integrity-commands.ts:123:53
   context: KernelRuntimeContext,
 ): Promise<KernelCommandResult> {
   const app = requireApp(context);
-  const distDir = getStringArg(input, 0, "dist") ?? "dist";
+  const distDir = getStringArg(input, 0, "dist") ?? "";
   if (context.dryRun) {
     return {

[NoCoverage] ConditionalExpression
src/integrity/integrity-commands.ts:124:7
 ): Promise<KernelCommandResult> {
   const app = requireApp(context);
   const distDir = getStringArg(input, 0, "dist") ?? "dist";
-  if (context.dryRun) {
+  if (true) {
     return {
       summary: `[integrity.build-record] dry-run: would record build outputs from ${distDir}`,

[NoCoverage] ConditionalExpression
src/integrity/integrity-commands.ts:124:7
 ): Promise<KernelCommandResult> {
   const app = requireApp(context);
   const distDir = getStringArg(input, 0, "dist") ?? "dist";
-  if (context.dryRun) {
+  if (false) {
     return {
       summary: `[integrity.build-record] dry-run: would record build outputs from ${distDir}`,

[NoCoverage] ObjectLiteral
src/integrity/integrity-commands.ts:125:12
   const app = requireApp(context);
   const distDir = getStringArg(input, 0, "dist") ?? "dist";
   if (context.dryRun) {
-    return {
-      summary: `[integrity.build-record] dry-run: would record build outputs from ${distDir}`,
-    };
+    return {};
   }
 

[NoCoverage] StringLiteral
src/integrity/integrity-commands.ts:126:16
   const distDir = getStringArg(input, 0, "dist") ?? "dist";
   if (context.dryRun) {
     return {
-      summary: `[integrity.build-record] dry-run: would record build outputs from ${distDir}`,
+      summary: ``,
     };
   }

[NoCoverage] StringLiteral
src/integrity/integrity-commands.ts:132:14
 
   await runRecordBuild({ cwd: app.directory, builder: "local", distDir });
   return {
-    summary: `[integrity.build-record] complete for ${app.name}`,
+    summary: ``,
     nextSteps: [
       { action: `Sign the build: pnpm exec werkstatt run integrity.sign`, kind: "optional" },

[NoCoverage] ArrayDeclaration
src/integrity/integrity-commands.ts:133:16
   await runRecordBuild({ cwd: app.directory, builder: "local", distDir });
   return {
     summary: `[integrity.build-record] complete for ${app.name}`,
-    nextSteps: [
-      { action: `Sign the build: pnpm exec werkstatt run integrity.sign`, kind: "optional" },
-    ],
+    nextSteps: [],
   };
 }

[NoCoverage] BlockStatement
src/integrity/integrity-commands.ts:139:73
   };
 }
 
-async function loadPrivateKeyPem(appDirectory: string): Promise<string> {
-  const keyPath = await optionalEnv("SIGNING_PRIVATE_KEY_PATH", appDirectory);
-  if (keyPath) {
-    return fs.readFile(path.resolve(appDirectory, keyPath), "utf8");
-  }
-
-  const defaultKeyPath = path.join(appDirectory, ".integrity/keys/studio.private.pem");
-  try {
-    return await fs.readFile(defaultKeyPath, "utf8");
-  } catch {
-    // Fallback to env variable
-  }
-
-  return requireEnv("SIGNING_PRIVATE_KEY", appDirectory);
-}
+async function loadPrivateKeyPem(appDirectory: string): Promise<string> {}
 
 export async function runIntegritySign(

[NoCoverage] ConditionalExpression
src/integrity/integrity-commands.ts:141:7
 
 async function loadPrivateKeyPem(appDirectory: string): Promise<string> {
   const keyPath = await optionalEnv("SIGNING_PRIVATE_KEY_PATH", appDirectory);
-  if (keyPath) {
+  if (false) {
     return fs.readFile(path.resolve(appDirectory, keyPath), "utf8");
   }

[NoCoverage] ConditionalExpression
src/integrity/integrity-commands.ts:141:7
 
 async function loadPrivateKeyPem(appDirectory: string): Promise<string> {
   const keyPath = await optionalEnv("SIGNING_PRIVATE_KEY_PATH", appDirectory);
-  if (keyPath) {
+  if (true) {
     return fs.readFile(path.resolve(appDirectory, keyPath), "utf8");
   }

[NoCoverage] BlockStatement
src/integrity/integrity-commands.ts:146:7
   }
 
   const defaultKeyPath = path.join(appDirectory, ".integrity/keys/studio.private.pem");
-  try {
-    return await fs.readFile(defaultKeyPath, "utf8");
-  } catch {
+  try {} catch {
     // Fallback to env variable
   }

[NoCoverage] StringLiteral
src/integrity/integrity-commands.ts:147:46
 
   const defaultKeyPath = path.join(appDirectory, ".integrity/keys/studio.private.pem");
   try {
-    return await fs.readFile(defaultKeyPath, "utf8");
+    return await fs.readFile(defaultKeyPath, "");
   } catch {
     // Fallback to env variable

[NoCoverage] BlockStatement
src/integrity/integrity-commands.ts:160:23
   context: KernelRuntimeContext,
 ): Promise<KernelCommandResult<{ reusedExistingSignature: boolean }>> {
   const app = requireApp(context);
-  if (context.dryRun) {
-    return { summary: `[integrity.sign] dry-run: would sign ${buildLatestDir(app.directory)}` };
-  }
+  if (context.dryRun) {}
 
   const privateKeyPem = await loadPrivateKeyPem(app.directory);

[NoCoverage] ConditionalExpression
src/integrity/integrity-commands.ts:160:7
   context: KernelRuntimeContext,
 ): Promise<KernelCommandResult<{ reusedExistingSignature: boolean }>> {
   const app = requireApp(context);
-  if (context.dryRun) {
+  if (true) {
     return { summary: `[integrity.sign] dry-run: would sign ${buildLatestDir(app.directory)}` };
   }

[NoCoverage] StringLiteral
src/integrity/integrity-commands.ts:161:23
 ): Promise<KernelCommandResult<{ reusedExistingSignature: boolean }>> {
   const app = requireApp(context);
   if (context.dryRun) {
-    return { summary: `[integrity.sign] dry-run: would sign ${buildLatestDir(app.directory)}` };
+    return { summary: `` };
   }
 

[NoCoverage] StringLiteral
src/integrity/integrity-commands.ts:165:42
   }
 
   const privateKeyPem = await loadPrivateKeyPem(app.directory);
-  const publicKeyUrl = await optionalEnv("PUBLIC_KEY_URL", app.directory);
+  const publicKeyUrl = await optionalEnv("", app.directory);
   const result = await signLatestBuildArtifacts({
     cwd: app.directory,

[NoCoverage] ObjectLiteral
src/integrity/integrity-commands.ts:166:49
 
   const privateKeyPem = await loadPrivateKeyPem(app.directory);
   const publicKeyUrl = await optionalEnv("PUBLIC_KEY_URL", app.directory);
-  const result = await signLatestBuildArtifacts({
-    cwd: app.directory,
-    privateKeyPem,
-    publicKeyUrl,
-  });
+  const result = await signLatestBuildArtifacts({});
 
   context.logger.info(`Build directory: ${buildLatestDir(app.directory)}`);

[NoCoverage] LogicalOperator
src/integrity/integrity-commands.ts:174:24
 
   context.logger.info(`Build directory: ${buildLatestDir(app.directory)}`);
   context.logger.info(
-    `Public key URL: ${publicKeyUrl ?? "(embedded URL omitted for this signature)"}`,
+    `Public key URL: ${publicKeyUrl && "(embedded URL omitted for this signature)"}`,
   );
   context.logger.info(`Build ID: ${result.payload.buildId}`);

[NoCoverage] StringLiteral
src/integrity/integrity-commands.ts:174:5
 
   context.logger.info(`Build directory: ${buildLatestDir(app.directory)}`);
   context.logger.info(
-    `Public key URL: ${publicKeyUrl ?? "(embedded URL omitted for this signature)"}`,
+    ``,
   );
   context.logger.info(`Build ID: ${result.payload.buildId}`);

[NoCoverage] StringLiteral
src/integrity/integrity-commands.ts:179:23
   context.logger.info(`Build ID: ${result.payload.buildId}`);
   context.logger.info(`Signed at: ${result.payload.signedAt}`);
   context.logger.info(`Outputs digest: ${result.payload.outputsDigest}`);
-  context.logger.info(`Provenance digest: ${result.payload.provenanceDigest}`);
+  context.logger.info(``);
   context.logger.info(`Output files: ${Object.keys(result.outputs.outputs).length}`);
   context.logger.info(`Signature bytes: ${result.signatureBuffer.byteLength}`);

[NoCoverage] StringLiteral
src/integrity/integrity-commands.ts:181:23
   context.logger.info(`Outputs digest: ${result.payload.outputsDigest}`);
   context.logger.info(`Provenance digest: ${result.payload.provenanceDigest}`);
   context.logger.info(`Output files: ${Object.keys(result.outputs.outputs).length}`);
-  context.logger.info(`Signature bytes: ${result.signatureBuffer.byteLength}`);
+  context.logger.info(``);
   context.logger.info(`Signature preview: ${result.signatureHex.slice(0, 32)}...`);
   context.logger.info(`Signed manifest: ${signedManifestPath(app.directory)}`);

[NoCoverage] MethodExpression
src/integrity/integrity-commands.ts:182:45
   context.logger.info(`Provenance digest: ${result.payload.provenanceDigest}`);
   context.logger.info(`Output files: ${Object.keys(result.outputs.outputs).length}`);
   context.logger.info(`Signature bytes: ${result.signatureBuffer.byteLength}`);
-  context.logger.info(`Signature preview: ${result.signatureHex.slice(0, 32)}...`);
+  context.logger.info(`Signature preview: ${result.signatureHex}...`);
   context.logger.info(`Signed manifest: ${signedManifestPath(app.directory)}`);
 

[NoCoverage] StringLiteral
src/integrity/integrity-commands.ts:183:23
   context.logger.info(`Output files: ${Object.keys(result.outputs.outputs).length}`);
   context.logger.info(`Signature bytes: ${result.signatureBuffer.byteLength}`);
   context.logger.info(`Signature preview: ${result.signatureHex.slice(0, 32)}...`);
-  context.logger.info(`Signed manifest: ${signedManifestPath(app.directory)}`);
+  context.logger.info(``);
 
   return {

[NoCoverage] LogicalOperator
src/integrity/integrity-commands.ts:199:5
 ): Promise<KernelCommandResult<{ signatureValid: boolean }>> {
   const app = requireApp(context);
   const manifestSource =
-    getStringArg(input, 0, signedManifestPath(app.directory)) ?? signedManifestPath(app.directory);
+    getStringArg(input, 0, signedManifestPath(app.directory)) && signedManifestPath(app.directory);
   const manifest = await loadSignedManifest(manifestSource);
   const publicKeyPemPath = await optionalEnv("PUBLIC_KEY_PEM_PATH", app.directory);

[NoCoverage] StringLiteral
src/integrity/integrity-commands.ts:202:42
     getStringArg(input, 0, signedManifestPath(app.directory)) ?? signedManifestPath(app.directory);
   const manifest = await loadSignedManifest(manifestSource);
   const publicKeyPemPath = await optionalEnv("PUBLIC_KEY_PEM_PATH", app.directory);
-  const publicKeyUrl = await optionalEnv("PUBLIC_KEY_URL", app.directory);
+  const publicKeyUrl = await optionalEnv("", app.directory);
 
   // Fallback to default public key location if no other source provided

[NoCoverage] LogicalOperator
src/integrity/integrity-commands.ts:206:7
 
   // Fallback to default public key location if no other source provided
   let resolvedKeyPath: string | undefined = publicKeyPemPath;
-  if (!resolvedKeyPath && !publicKeyUrl && !manifest.publicKeyUrl) {
+  if (!resolvedKeyPath || !publicKeyUrl && !manifest.publicKeyUrl) {
     const defaultPublicKeyPath = path.join(app.directory, "public/studio.public.pem");
     try {

[NoCoverage] BooleanLiteral
src/integrity/integrity-commands.ts:206:7
 
   // Fallback to default public key location if no other source provided
   let resolvedKeyPath: string | undefined = publicKeyPemPath;
-  if (!resolvedKeyPath && !publicKeyUrl && !manifest.publicKeyUrl) {
+  if (resolvedKeyPath && !publicKeyUrl && !manifest.publicKeyUrl) {
     const defaultPublicKeyPath = path.join(app.directory, "public/studio.public.pem");
     try {

[NoCoverage] BlockStatement
src/integrity/integrity-commands.ts:208:9
   let resolvedKeyPath: string | undefined = publicKeyPemPath;
   if (!resolvedKeyPath && !publicKeyUrl && !manifest.publicKeyUrl) {
     const defaultPublicKeyPath = path.join(app.directory, "public/studio.public.pem");
-    try {
-      await fs.access(defaultPublicKeyPath);
-      resolvedKeyPath = defaultPublicKeyPath;
-    } catch {
+    try {} catch {
       // No default key file, will fail below with proper error
     }

[NoCoverage] ConditionalExpression
src/integrity/integrity-commands.ts:217:7
   }
 
   // Resolve relative paths against app.directory (loadPublicKeyPem uses path.resolve against process.cwd())
-  if (resolvedKeyPath && !path.isAbsolute(resolvedKeyPath)) {
+  if (false) {
     resolvedKeyPath = path.resolve(app.directory, resolvedKeyPath);
   }

[NoCoverage] LogicalOperator
src/integrity/integrity-commands.ts:217:7
   }
 
   // Resolve relative paths against app.directory (loadPublicKeyPem uses path.resolve against process.cwd())
-  if (resolvedKeyPath && !path.isAbsolute(resolvedKeyPath)) {
+  if (resolvedKeyPath || !path.isAbsolute(resolvedKeyPath)) {
     resolvedKeyPath = path.resolve(app.directory, resolvedKeyPath);
   }

[NoCoverage] ObjectLiteral
src/integrity/integrity-commands.ts:221:47
     resolvedKeyPath = path.resolve(app.directory, resolvedKeyPath);
   }
 
-  const publicKeyPem = await loadPublicKeyPem({
-    manifest,
-    publicKeyPemPath: resolvedKeyPath,
-    publicKeyUrl,
-  });
+  const publicKeyPem = await loadPublicKeyPem({});
   const signatureValid = await verifyManifestSignature({ manifest, publicKeyPem });
 

[NoCoverage] StringLiteral
src/integrity/integrity-commands.ts:231:23
   context.logger.info(`Manifest source: ${manifestSource}`);
   context.logger.info(`Build ID: ${manifest.buildId}`);
   context.logger.info(`Signed at: ${manifest.signedAt}`);
-  context.logger.info(`Algorithm: ${manifest.algorithm}`);
+  context.logger.info(``);
   context.logger.info(
     `Public key source: ${publicKeyPemPath ?? publicKeyUrl ?? manifest.publicKeyUrl ?? "(not provided)"}`,

[NoCoverage] LogicalOperator
src/integrity/integrity-commands.ts:233:27
   context.logger.info(`Signed at: ${manifest.signedAt}`);
   context.logger.info(`Algorithm: ${manifest.algorithm}`);
   context.logger.info(
-    `Public key source: ${publicKeyPemPath ?? publicKeyUrl ?? manifest.publicKeyUrl ?? "(not provided)"}`,
+    `Public key source: ${(publicKeyPemPath ?? publicKeyUrl ?? manifest.publicKeyUrl) && "(not provided)"}`,
   );
   context.logger.info(`Payload version: ${manifest.payloadVersion}`);

[NoCoverage] LogicalOperator
src/integrity/integrity-commands.ts:233:27
   context.logger.info(`Signed at: ${manifest.signedAt}`);
   context.logger.info(`Algorithm: ${manifest.algorithm}`);
   context.logger.info(
-    `Public key source: ${publicKeyPemPath ?? publicKeyUrl ?? manifest.publicKeyUrl ?? "(not provided)"}`,
+    `Public key source: ${publicKeyPemPath && publicKeyUrl ?? manifest.publicKeyUrl ?? "(not provided)"}`,
   );
   context.logger.info(`Payload version: ${manifest.payloadVersion}`);

[NoCoverage] StringLiteral
src/integrity/integrity-commands.ts:237:23
   );
   context.logger.info(`Payload version: ${manifest.payloadVersion}`);
   context.logger.info(`Outputs digest: ${manifest.payload.outputsDigest}`);
-  context.logger.info(`Provenance digest: ${manifest.payload.provenanceDigest}`);
+  context.logger.info(``);
   context.logger.info(`Result: ${signatureValid ? "VALID" : "INVALID"}`);
 

[NoCoverage] BooleanLiteral
src/integrity/integrity-commands.ts:240:26
   context.logger.info(`Provenance digest: ${manifest.payload.provenanceDigest}`);
   context.logger.info(`Result: ${signatureValid ? "VALID" : "INVALID"}`);
 
-  let localCheckFailed = false;
+  let localCheckFailed = true;
   const localBuildDir = buildLatestDir(app.directory);
   if (

[NoCoverage] LogicalOperator
src/integrity/integrity-commands.ts:243:5
   let localCheckFailed = false;
   const localBuildDir = buildLatestDir(app.directory);
   if (
-    !manifestSource.startsWith("https://") &&
-    path.resolve(manifestSource).startsWith(path.resolve(localBuildDir))
+    !manifestSource.startsWith("https://") || path.resolve(manifestSource).startsWith(path.resolve(localBuildDir))
   ) {
     const digestCheck = await compareManifestWithLocalArtifacts(app.directory, manifest);

[NoCoverage] ConditionalExpression
src/integrity/integrity-commands.ts:243:5
   let localCheckFailed = false;
   const localBuildDir = buildLatestDir(app.directory);
   if (
-    !manifestSource.startsWith("https://") &&
-    path.resolve(manifestSource).startsWith(path.resolve(localBuildDir))
+    true
   ) {
     const digestCheck = await compareManifestWithLocalArtifacts(app.directory, manifest);

[NoCoverage] MethodExpression
src/integrity/integrity-commands.ts:244:5
   const localBuildDir = buildLatestDir(app.directory);
   if (
     !manifestSource.startsWith("https://") &&
-    path.resolve(manifestSource).startsWith(path.resolve(localBuildDir))
+    path.resolve(manifestSource).endsWith(path.resolve(localBuildDir))
   ) {
     const digestCheck = await compareManifestWithLocalArtifacts(app.directory, manifest);

[NoCoverage] BlockStatement
src/integrity/integrity-commands.ts:245:5
   if (
     !manifestSource.startsWith("https://") &&
     path.resolve(manifestSource).startsWith(path.resolve(localBuildDir))
-  ) {
-    const digestCheck = await compareManifestWithLocalArtifacts(app.directory, manifest);
-    context.logger.info(`outputs.json: ${digestCheck.outputsDigestMatches ? "MATCH" : "MISMATCH"}`);
-    context.logger.info(
-      `build-provenance.json: ${digestCheck.provenanceDigestMatches ? "MATCH" : "MISMATCH"}`,
-    );
-    if (!digestCheck.outputsDigestMatches || !digestCheck.provenanceDigestMatches) {
-      localCheckFailed = true;
-    }
-  }
+  ) {}
 
   const ok = signatureValid && !localCheckFailed;

[NoCoverage] StringLiteral
src/integrity/integrity-commands.ts:249:81
     const digestCheck = await compareManifestWithLocalArtifacts(app.directory, manifest);
     context.logger.info(`outputs.json: ${digestCheck.outputsDigestMatches ? "MATCH" : "MISMATCH"}`);
     context.logger.info(
-      `build-provenance.json: ${digestCheck.provenanceDigestMatches ? "MATCH" : "MISMATCH"}`,
+      `build-provenance.json: ${digestCheck.provenanceDigestMatches ? "MATCH" : ""}`,
     );
     if (!digestCheck.outputsDigestMatches || !digestCheck.provenanceDigestMatches) {

[NoCoverage] StringLiteral
src/integrity/integrity-commands.ts:249:71
     const digestCheck = await compareManifestWithLocalArtifacts(app.directory, manifest);
     context.logger.info(`outputs.json: ${digestCheck.outputsDigestMatches ? "MATCH" : "MISMATCH"}`);
     context.logger.info(
-      `build-provenance.json: ${digestCheck.provenanceDigestMatches ? "MATCH" : "MISMATCH"}`,
+      `build-provenance.json: ${digestCheck.provenanceDigestMatches ? "" : "MISMATCH"}`,
     );
     if (!digestCheck.outputsDigestMatches || !digestCheck.provenanceDigestMatches) {

[NoCoverage] BlockStatement
src/integrity/integrity-commands.ts:251:84
     context.logger.info(
       `build-provenance.json: ${digestCheck.provenanceDigestMatches ? "MATCH" : "MISMATCH"}`,
     );
-    if (!digestCheck.outputsDigestMatches || !digestCheck.provenanceDigestMatches) {
-      localCheckFailed = true;
-    }
+    if (!digestCheck.outputsDigestMatches || !digestCheck.provenanceDigestMatches) {}
   }
 

[NoCoverage] ConditionalExpression
src/integrity/integrity-commands.ts:251:9
     context.logger.info(
       `build-provenance.json: ${digestCheck.provenanceDigestMatches ? "MATCH" : "MISMATCH"}`,
     );
-    if (!digestCheck.outputsDigestMatches || !digestCheck.provenanceDigestMatches) {
+    if (false) {
       localCheckFailed = true;
     }

[NoCoverage] BooleanLiteral
src/integrity/integrity-commands.ts:252:26
       `build-provenance.json: ${digestCheck.provenanceDigestMatches ? "MATCH" : "MISMATCH"}`,
     );
     if (!digestCheck.outputsDigestMatches || !digestCheck.provenanceDigestMatches) {
-      localCheckFailed = true;
+      localCheckFailed = false;
     }
   }

[NoCoverage] ConditionalExpression
src/integrity/integrity-commands.ts:256:14
     }
   }
 
-  const ok = signatureValid && !localCheckFailed;
+  const ok = false;
   return {
     data: { signatureValid },

[NoCoverage] ConditionalExpression
src/integrity/integrity-commands.ts:256:14
     }
   }
 
-  const ok = signatureValid && !localCheckFailed;
+  const ok = true;
   return {
     data: { signatureValid },

[NoCoverage] ObjectLiteral
src/integrity/integrity-commands.ts:257:10
   }
 
   const ok = signatureValid && !localCheckFailed;
-  return {
-    data: { signatureValid },
-    exitCode: ok ? 0 : 1,
-    summary: ok
-      ? "Release verified successfully. Anyone holding the public key can verify this release independently."
-      : undefined,
-  };
+  return {};
 }
 

[NoCoverage] LogicalOperator
src/integrity/integrity-commands.ts:273:5
   const app = requireApp(context);
   const privateKeyTarget = path.resolve(
     app.directory,
-    getStringArg(input, 0, ".integrity/keys/studio.private.pem") ??
-      ".integrity/keys/studio.private.pem",
+    getStringArg(input, 0, ".integrity/keys/studio.private.pem") && ".integrity/keys/studio.private.pem",
   );
   const publicKeyTarget = path.resolve(
