[NoCoverage] LogicalOperator
src/integrity/integrity-commands.ts:278:5
   );
   const publicKeyTarget = path.resolve(
     app.directory,
-    getStringArg(input, 1, "public/studio.public.pem") ?? "public/studio.public.pem",
+    getStringArg(input, 1, "public/studio.public.pem") && "public/studio.public.pem",
   );
 

[NoCoverage] ConditionalExpression
src/integrity/integrity-commands.ts:281:7
     getStringArg(input, 1, "public/studio.public.pem") ?? "public/studio.public.pem",
   );
 
-  if (context.dryRun) {
+  if (true) {
     return {
       data: { privateKeyTarget, publicKeyTarget },

[NoCoverage] ConditionalExpression
src/integrity/integrity-commands.ts:281:7
     getStringArg(input, 1, "public/studio.public.pem") ?? "public/studio.public.pem",
   );
 
-  if (context.dryRun) {
+  if (false) {
     return {
       data: { privateKeyTarget, publicKeyTarget },

[NoCoverage] ObjectLiteral
src/integrity/integrity-commands.ts:282:12
   );
 
   if (context.dryRun) {
-    return {
-      data: { privateKeyTarget, publicKeyTarget },
-      summary: `[integrity.keys.generate] dry-run: would write ${privateKeyTarget} and ${publicKeyTarget}`,
-    };
+    return {};
   }
 

[NoCoverage] BlockStatement
src/integrity/integrity-commands.ts:307:33
 export async function runIntegrityBackfillRevisions(
   _input: KernelCommandInput,
   context: KernelRuntimeContext,
-): Promise<KernelCommandResult> {
-  const app = requireApp(context);
-  if (context.dryRun) {
-    return {
-      summary: `[integrity.backfill-revisions] dry-run: would update revision counters for ${app.name}`,
-    };
-  }
-
-  await runBackfillRevisions({ cwd: app.directory });
-  return { summary: `[integrity.backfill-revisions] complete for ${app.name}` };
-}
+): Promise<KernelCommandResult> {}
 

[NoCoverage] BlockStatement
src/integrity/integrity-commands.ts:309:23
   context: KernelRuntimeContext,
 ): Promise<KernelCommandResult> {
   const app = requireApp(context);
-  if (context.dryRun) {
-    return {
-      summary: `[integrity.backfill-revisions] dry-run: would update revision counters for ${app.name}`,
-    };
-  }
+  if (context.dryRun) {}
 
   await runBackfillRevisions({ cwd: app.directory });

[NoCoverage] ObjectLiteral
src/integrity/integrity-commands.ts:310:12
 ): Promise<KernelCommandResult> {
   const app = requireApp(context);
   if (context.dryRun) {
-    return {
-      summary: `[integrity.backfill-revisions] dry-run: would update revision counters for ${app.name}`,
-    };
+    return {};
   }
 

[NoCoverage] ObjectLiteral
src/integrity/integrity-commands.ts:315:30
     };
   }
 
-  await runBackfillRevisions({ cwd: app.directory });
+  await runBackfillRevisions({});
   return { summary: `[integrity.backfill-revisions] complete for ${app.name}` };
 }
