[NoCoverage] BlockStatement
src/integrity/internal-dist.ts:23:91
 import path from "node:path";
 import { collectFiles } from "@warpgogol/werkstatt-shared/share/fs";
 
-export async function discoverDistFiles(cwd: string, distDir = "dist"): Promise<string[]> {
-  const root = path.join(cwd, distDir);
-  const files = await collectFiles(root, { ignore: () => false });
-  return files
-    .map((abs) => path.relative(cwd, abs).replace(/\\/g, "/"))
-    .sort((a, b) => a.localeCompare(b));
-}
+export async function discoverDistFiles(cwd: string, distDir = "dist"): Promise<string[]> {}
 

[NoCoverage] BooleanLiteral
src/integrity/internal-dist.ts:25:58
 
 export async function discoverDistFiles(cwd: string, distDir = "dist"): Promise<string[]> {
   const root = path.join(cwd, distDir);
-  const files = await collectFiles(root, { ignore: () => false });
+  const files = await collectFiles(root, { ignore: () => true });
   return files
     .map((abs) => path.relative(cwd, abs).replace(/\\/g, "/"))

[NoCoverage] ArrowFunction
src/integrity/internal-dist.ts:25:52
 
 export async function discoverDistFiles(cwd: string, distDir = "dist"): Promise<string[]> {
   const root = path.join(cwd, distDir);
-  const files = await collectFiles(root, { ignore: () => false });
+  const files = await collectFiles(root, { ignore: () => undefined });
   return files
     .map((abs) => path.relative(cwd, abs).replace(/\\/g, "/"))

[NoCoverage] MethodExpression
src/integrity/internal-dist.ts:26:10
 export async function discoverDistFiles(cwd: string, distDir = "dist"): Promise<string[]> {
   const root = path.join(cwd, distDir);
   const files = await collectFiles(root, { ignore: () => false });
-  return files
-    .map((abs) => path.relative(cwd, abs).replace(/\\/g, "/"))
-    .sort((a, b) => a.localeCompare(b));
+  return files.map(abs => path.relative(cwd, abs).replace(/\\/g, "/"));
 }
 

[NoCoverage] ArrowFunction
src/integrity/internal-dist.ts:27:10
   const root = path.join(cwd, distDir);
   const files = await collectFiles(root, { ignore: () => false });
   return files
-    .map((abs) => path.relative(cwd, abs).replace(/\\/g, "/"))
+    .map(() => undefined)
     .sort((a, b) => a.localeCompare(b));
 }

[NoCoverage] ArrowFunction
src/integrity/internal-dist.ts:28:11
   const files = await collectFiles(root, { ignore: () => false });
   return files
     .map((abs) => path.relative(cwd, abs).replace(/\\/g, "/"))
-    .sort((a, b) => a.localeCompare(b));
+    .sort(() => undefined);
 }
 
