[Killed] BlockStatement
src/integrity/json.ts:25:45
 import path from "node:path";
 import { ensureDir, readText, writeText } from "./fs.ts";
 
-function sortValue(value: unknown): unknown {
-  if (Array.isArray(value)) {
-    return value.map(sortValue);
-  }
-  if (value && typeof value === "object") {
-    const entries = Object.entries(value as Record<string, unknown>)
-      .sort(([a], [b]) => a.localeCompare(b))
-      .map(([key, nested]) => [key, sortValue(nested)]);
-    return Object.fromEntries(entries);
-  }
-  return value;
-}
+function sortValue(value: unknown): unknown {}
 
 export function stableStringify(value: unknown): string {
killedBy: PBT: stableStringify output is valid JSON for JSON-compatible values
statusReason: Property failed after 1 tests
{ seed: 1945611350, path: "0:0", endOnFailure: true }
Counterexample: [[]]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/integrity/json.ts:26:7
 import { ensureDir, readText, writeText } from "./fs.ts";
 
 function sortValue(value: unknown): unknown {
-  if (Array.isArray(value)) {
+  if (true) {
     return value.map(sortValue);
   }
killedBy: PBT: stableStringify is deterministic — same value always produces same output
statusReason: Property failed after 1 tests
{ seed: -212585379, path: "0", endOnFailure: true }
Counterexample: [undefined]
Shrunk 0 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Survived] ConditionalExpression
src/integrity/json.ts:26:7
 import { ensureDir, readText, writeText } from "./fs.ts";
 
 function sortValue(value: unknown): unknown {
-  if (Array.isArray(value)) {
+  if (false) {
     return value.map(sortValue);
   }

[Killed] ConditionalExpression
src/integrity/json.ts:29:7
   if (Array.isArray(value)) {
     return value.map(sortValue);
   }
-  if (value && typeof value === "object") {
+  if (false) {
     const entries = Object.entries(value as Record<string, unknown>)
       .sort(([a], [b]) => a.localeCompare(b))
killedBy: PBT: stableStringify is order-independent for object keys
statusReason: Property failed after 1 tests
{ seed: 351924832, path: "0:0:0:0", endOnFailure: true }
Counterexample: [{"a":0,"b":0,"c":0}]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/integrity/json.ts:29:16
   if (Array.isArray(value)) {
     return value.map(sortValue);
   }
-  if (value && typeof value === "object") {
+  if (value && true) {
     const entries = Object.entries(value as Record<string, unknown>)
       .sort(([a], [b]) => a.localeCompare(b))
killedBy: PBT: stableStringify is deterministic — same value always produces same output
statusReason: Property failed after 4 tests
{ seed: -954485710, path: "3:1:0:3:3:3:3:4:4", endOnFailure: true }
Counterexample: [[[" "]]]
Shrunk 8 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] MethodExpression
src/integrity/json.ts:30:21
     return value.map(sortValue);
   }
   if (value && typeof value === "object") {
-    const entries = Object.entries(value as Record<string, unknown>)
-      .sort(([a], [b]) => a.localeCompare(b))
+    const entries = Object.entries(value as Record<string, unknown>)
       .map(([key, nested]) => [key, sortValue(nested)]);
     return Object.fromEntries(entries);
killedBy: PBT: stableStringify is order-independent for object keys
statusReason: Property failed after 1 tests
{ seed: -1455760530, path: "0:0:0:0:0", endOnFailure: true }
Counterexample: [{"a":0,"b":0,"c":0}]
Shrunk 4 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ArrowFunction
src/integrity/json.ts:31:13
   }
   if (value && typeof value === "object") {
     const entries = Object.entries(value as Record<string, unknown>)
-      .sort(([a], [b]) => a.localeCompare(b))
+      .sort(() => undefined)
       .map(([key, nested]) => [key, sortValue(nested)]);
     return Object.fromEntries(entries);
killedBy: PBT: stableStringify is order-independent for object keys
statusReason: Property failed after 1 tests
{ seed: -1369580724, path: "0:0:0:0:0", endOnFailure: true }
Counterexample: [{"a":0,"b":0,"c":0}]
Shrunk 4 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ArrowFunction
src/integrity/json.ts:32:12
   if (value && typeof value === "object") {
     const entries = Object.entries(value as Record<string, unknown>)
       .sort(([a], [b]) => a.localeCompare(b))
-      .map(([key, nested]) => [key, sortValue(nested)]);
+      .map(() => undefined);
     return Object.fromEntries(entries);
   }
killedBy: PBT: stableStringify is deterministic — same value always produces same output
statusReason: Property failed after 3 tests
{ seed: -688954551, path: "2:1:0:0:1:1", endOnFailure: true }
Counterexample: [{"":0}]
Shrunk 5 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
src/integrity/json.ts:38:57
   return value;
 }
 
-export function stableStringify(value: unknown): string {
-  return `${JSON.stringify(sortValue(value), null, 2)}\n`;
-}
+export function stableStringify(value: unknown): string {}
 
 export async function readJsonFile<T>(filePath: string): Promise<T> {
killedBy: PBT: stableStringify always ends with newline
statusReason: Property failed after 1 tests
{ seed: 900579652, path: "0:0", endOnFailure: true }
Counterexample: [{}]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] StringLiteral
src/integrity/json.ts:39:10
 }
 
 export function stableStringify(value: unknown): string {
-  return `${JSON.stringify(sortValue(value), null, 2)}\n`;
+  return ``;
 }
 
killedBy: PBT: stableStringify always ends with newline
statusReason: Property failed after 1 tests
{ seed: -388834306, path: "0:0", endOnFailure: true }
Counterexample: [{}]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[NoCoverage] BlockStatement
src/integrity/json.ts:42:69
   return `${JSON.stringify(sortValue(value), null, 2)}\n`;
 }
 
-export async function readJsonFile<T>(filePath: string): Promise<T> {
-  return JSON.parse(await readText(filePath)) as T;
-}
+export async function readJsonFile<T>(filePath: string): Promise<T> {}
 
 export async function writeJsonFile(filePath: string, value: unknown): Promise<void> {

[NoCoverage] BlockStatement
src/integrity/json.ts:46:86
   return JSON.parse(await readText(filePath)) as T;
 }
 
-export async function writeJsonFile(filePath: string, value: unknown): Promise<void> {
-  await ensureDir(path.dirname(filePath));
-  await writeText(filePath, stableStringify(value));
-}
+export async function writeJsonFile(filePath: string, value: unknown): Promise<void> {}
 
