[NoCoverage] BlockStatement
src/integrity/manifests.ts:31:38
 export async function loadDirectoryManifest(
   cwd: string,
   repoDir: string,
-): Promise<DirectoryManifest | null> {
-  const filePath = manifestPathForDirectory(cwd, repoDir);
-  if (!(await pathExists(filePath))) return null;
-  return readJsonFile<DirectoryManifest>(filePath);
-}
+): Promise<DirectoryManifest | null> {}
 
 export async function saveDirectoryManifest(

[NoCoverage] ConditionalExpression
src/integrity/manifests.ts:33:7
   repoDir: string,
 ): Promise<DirectoryManifest | null> {
   const filePath = manifestPathForDirectory(cwd, repoDir);
-  if (!(await pathExists(filePath))) return null;
+  if (false) return null;
   return readJsonFile<DirectoryManifest>(filePath);
 }

[NoCoverage] ConditionalExpression
src/integrity/manifests.ts:33:7
   repoDir: string,
 ): Promise<DirectoryManifest | null> {
   const filePath = manifestPathForDirectory(cwd, repoDir);
-  if (!(await pathExists(filePath))) return null;
+  if (true) return null;
   return readJsonFile<DirectoryManifest>(filePath);
 }

[NoCoverage] BlockStatement
src/integrity/manifests.ts:40:18
 export async function saveDirectoryManifest(
   cwd: string,
   manifest: DirectoryManifest,
-): Promise<void> {
-  const filePath = manifestPathForDirectory(cwd, manifest.directory);
-  await writeJsonFile(filePath, manifest);
-}
+): Promise<void> {}
 
 export function createEmptyManifest(repoDir: string): DirectoryManifest {

[NoCoverage] BlockStatement
src/integrity/manifests.ts:45:73
   await writeJsonFile(filePath, manifest);
 }
 
-export function createEmptyManifest(repoDir: string): DirectoryManifest {
-  return {
-    $schemaVersion: 1,
-    directory: repoDir,
-    generatedAt: new Date().toISOString(),
-    files: {},
-  };
-}
+export function createEmptyManifest(repoDir: string): DirectoryManifest {}
 
 export function upsertManifestRecord(

[NoCoverage] ObjectLiteral
src/integrity/manifests.ts:46:10
 }
 
 export function createEmptyManifest(repoDir: string): DirectoryManifest {
-  return {
-    $schemaVersion: 1,
-    directory: repoDir,
-    generatedAt: new Date().toISOString(),
-    files: {},
-  };
+  return {};
 }
 

[NoCoverage] BlockStatement
src/integrity/manifests.ts:58:22
   manifest: DirectoryManifest,
   fileName: string,
   record: ManifestFileRecord,
-): DirectoryManifest {
-  manifest.files[fileName] = record;
-  manifest.generatedAt = new Date().toISOString();
-  return manifest;
-}
+): DirectoryManifest {}
 
 export function removeManifestRecord(

[NoCoverage] BlockStatement
src/integrity/manifests.ts:67:22
 export function removeManifestRecord(
   manifest: DirectoryManifest,
   fileName: string,
-): DirectoryManifest {
-  delete manifest.files[fileName];
-  manifest.generatedAt = new Date().toISOString();
-  return manifest;
-}
+): DirectoryManifest {}
 
 export function getManifestFileName(repoPath: string): string {

[NoCoverage] BlockStatement
src/integrity/manifests.ts:73:63
   return manifest;
 }
 
-export function getManifestFileName(repoPath: string): string {
-  return path.posix.basename(repoPath);
-}
+export function getManifestFileName(repoPath: string): string {}
 
