[NoCoverage] ConditionalExpression
src/integrity/move-detection.ts:31:7
   addedPaths: string[];
 }): Promise<MoveCandidate[]> {
   const { cwd, deletedPaths, addedPaths } = args;
-  if (!deletedPaths.length || !addedPaths.length) return [];
+  if (true) return [];
 
   const entities = await loadEntitiesById(cwd);

[NoCoverage] LogicalOperator
src/integrity/move-detection.ts:31:7
   addedPaths: string[];
 }): Promise<MoveCandidate[]> {
   const { cwd, deletedPaths, addedPaths } = args;
-  if (!deletedPaths.length || !addedPaths.length) return [];
+  if (!deletedPaths.length && !addedPaths.length) return [];
 
   const entities = await loadEntitiesById(cwd);

[NoCoverage] BlockStatement
src/integrity/move-detection.ts:36:36
   const entities = await loadEntitiesById(cwd);
   const deletedByHash = new Map<string, { entityId: string; from: string }>();
 
-  for (const from of deletedPaths) {
-    const entityId = Object.keys(entities).find((id) => entities[id]?.currentPath === from);
-    if (!entityId) continue;
-    const hash = entities[entityId]?.contentHash;
-    if (!hash) continue;
-    deletedByHash.set(hash, { entityId, from });
-  }
+  for (const from of deletedPaths) {}
 
   const moves: MoveCandidate[] = [];

[NoCoverage] ConditionalExpression
src/integrity/move-detection.ts:37:57
   const deletedByHash = new Map<string, { entityId: string; from: string }>();
 
   for (const from of deletedPaths) {
-    const entityId = Object.keys(entities).find((id) => entities[id]?.currentPath === from);
+    const entityId = Object.keys(entities).find((id) => true);
     if (!entityId) continue;
     const hash = entities[entityId]?.contentHash;

[NoCoverage] EqualityOperator
src/integrity/move-detection.ts:37:57
   const deletedByHash = new Map<string, { entityId: string; from: string }>();
 
   for (const from of deletedPaths) {
-    const entityId = Object.keys(entities).find((id) => entities[id]?.currentPath === from);
+    const entityId = Object.keys(entities).find((id) => entities[id]?.currentPath !== from);
     if (!entityId) continue;
     const hash = entities[entityId]?.contentHash;

[NoCoverage] ConditionalExpression
src/integrity/move-detection.ts:38:9
 
   for (const from of deletedPaths) {
     const entityId = Object.keys(entities).find((id) => entities[id]?.currentPath === from);
-    if (!entityId) continue;
+    if (true) continue;
     const hash = entities[entityId]?.contentHash;
     if (!hash) continue;

[NoCoverage] ConditionalExpression
src/integrity/move-detection.ts:38:9
 
   for (const from of deletedPaths) {
     const entityId = Object.keys(entities).find((id) => entities[id]?.currentPath === from);
-    if (!entityId) continue;
+    if (false) continue;
     const hash = entities[entityId]?.contentHash;
     if (!hash) continue;

[NoCoverage] OptionalChaining
src/integrity/move-detection.ts:39:18
   for (const from of deletedPaths) {
     const entityId = Object.keys(entities).find((id) => entities[id]?.currentPath === from);
     if (!entityId) continue;
-    const hash = entities[entityId]?.contentHash;
+    const hash = entities[entityId].contentHash;
     if (!hash) continue;
     deletedByHash.set(hash, { entityId, from });

[NoCoverage] ConditionalExpression
src/integrity/move-detection.ts:40:9
     const entityId = Object.keys(entities).find((id) => entities[id]?.currentPath === from);
     if (!entityId) continue;
     const hash = entities[entityId]?.contentHash;
-    if (!hash) continue;
+    if (false) continue;
     deletedByHash.set(hash, { entityId, from });
   }

[NoCoverage] ConditionalExpression
src/integrity/move-detection.ts:40:9
     const entityId = Object.keys(entities).find((id) => entities[id]?.currentPath === from);
     if (!entityId) continue;
     const hash = entities[entityId]?.contentHash;
-    if (!hash) continue;
+    if (true) continue;
     deletedByHash.set(hash, { entityId, from });
   }

[NoCoverage] ArrayDeclaration
src/integrity/move-detection.ts:44:34
     deletedByHash.set(hash, { entityId, from });
   }
 
-  const moves: MoveCandidate[] = [];
+  const moves: MoveCandidate[] = ["Stryker was here"];
   for (const to of addedPaths) {
     const absPath = path.join(cwd, to);

[NoCoverage] BlockStatement
src/integrity/move-detection.ts:45:32
   }
 
   const moves: MoveCandidate[] = [];
-  for (const to of addedPaths) {
-    const absPath = path.join(cwd, to);
-    const hash = await byteHashFile(absPath).catch(() => null);
-    if (!hash) continue;
-    const match = deletedByHash.get(hash);
-    if (!match) continue;
-    moves.push({
-      entityId: match.entityId,
-      from: match.from,
-      to,
-      confidence: 1,
-      method: "same-hash",
-    });
-  }
+  for (const to of addedPaths) {}
 
   return moves;

[NoCoverage] ArrowFunction
src/integrity/move-detection.ts:47:52
   const moves: MoveCandidate[] = [];
   for (const to of addedPaths) {
     const absPath = path.join(cwd, to);
-    const hash = await byteHashFile(absPath).catch(() => null);
+    const hash = await byteHashFile(absPath).catch(() => undefined);
     if (!hash) continue;
     const match = deletedByHash.get(hash);

[NoCoverage] ConditionalExpression
src/integrity/move-detection.ts:48:9
   for (const to of addedPaths) {
     const absPath = path.join(cwd, to);
     const hash = await byteHashFile(absPath).catch(() => null);
-    if (!hash) continue;
+    if (true) continue;
     const match = deletedByHash.get(hash);
     if (!match) continue;

[NoCoverage] BooleanLiteral
src/integrity/move-detection.ts:48:9
   for (const to of addedPaths) {
     const absPath = path.join(cwd, to);
     const hash = await byteHashFile(absPath).catch(() => null);
-    if (!hash) continue;
+    if (hash) continue;
     const match = deletedByHash.get(hash);
     if (!match) continue;

[NoCoverage] ConditionalExpression
src/integrity/move-detection.ts:50:9
     const hash = await byteHashFile(absPath).catch(() => null);
     if (!hash) continue;
     const match = deletedByHash.get(hash);
-    if (!match) continue;
+    if (true) continue;
     moves.push({
       entityId: match.entityId,

[NoCoverage] BooleanLiteral
src/integrity/move-detection.ts:50:9
     const hash = await byteHashFile(absPath).catch(() => null);
     if (!hash) continue;
     const match = deletedByHash.get(hash);
-    if (!match) continue;
+    if (match) continue;
     moves.push({
       entityId: match.entityId,

[NoCoverage] ObjectLiteral
src/integrity/move-detection.ts:51:16
     if (!hash) continue;
     const match = deletedByHash.get(hash);
     if (!match) continue;
-    moves.push({
-      entityId: match.entityId,
-      from: match.from,
-      to,
-      confidence: 1,
-      method: "same-hash",
-    });
+    moves.push({});
   }
 
