[Killed] BlockStatement
src/integrity/paths.ts:25:52
 
 import path from "node:path";
 
-export function integrityRoot(cwd: string): string {
-  return path.join(cwd, ".integrity");
-}
+export function integrityRoot(cwd: string): string {}
 
 export function configDir(cwd: string): string {
killedBy: integrity paths integrityRoot returns .integrity under cwd
statusReason: expected undefined to be '/test/project/.integrity' // Object.is equality

[Killed] BlockStatement
src/integrity/paths.ts:29:48
   return path.join(cwd, ".integrity");
 }
 
-export function configDir(cwd: string): string {
-  return path.join(integrityRoot(cwd), "config");
-}
+export function configDir(cwd: string): string {}
 
 export function schemaDir(cwd: string): string {
killedBy: integrity paths configDir is under integrityRoot
statusReason: expected undefined to be '/test/project/.integrity/config' // Object.is equality

[Killed] BlockStatement
src/integrity/paths.ts:33:48
   return path.join(integrityRoot(cwd), "config");
 }
 
-export function schemaDir(cwd: string): string {
-  return path.join(integrityRoot(cwd), "schema");
-}
+export function schemaDir(cwd: string): string {}
 
 export function policyPath(cwd: string): string {
killedBy: integrity paths schemaDir is under integrityRoot
statusReason: expected undefined to be '/test/project/.integrity/schema' // Object.is equality

[Killed] BlockStatement
src/integrity/paths.ts:37:49
   return path.join(integrityRoot(cwd), "schema");
 }
 
-export function policyPath(cwd: string): string {
-  return path.join(configDir(cwd), "policy.json");
-}
+export function policyPath(cwd: string): string {}
 
 export function indexDir(cwd: string): string {
killedBy: integrity paths policyPath is under configDir
statusReason: expected undefined to be '/test/project/.integrity/config/polic…' // Object.is equality

[Killed] BlockStatement
src/integrity/paths.ts:41:47
   return path.join(configDir(cwd), "policy.json");
 }
 
-export function indexDir(cwd: string): string {
-  return path.join(integrityRoot(cwd), "index");
-}
+export function indexDir(cwd: string): string {}
 
 export function entitiesByIdPath(cwd: string): string {
killedBy: integrity paths indexDir is under integrityRoot
statusReason: expected undefined to be '/test/project/.integrity/index' // Object.is equality

[Killed] StringLiteral
src/integrity/paths.ts:42:40
 }
 
 export function indexDir(cwd: string): string {
-  return path.join(integrityRoot(cwd), "index");
+  return path.join(integrityRoot(cwd), "");
 }
 
killedBy: integrity paths indexDir is under integrityRoot
statusReason: expected '/test/project/.integrity' to be '/test/project/.integrity/index' // Object.is equality

[Killed] BlockStatement
src/integrity/paths.ts:45:55
   return path.join(integrityRoot(cwd), "index");
 }
 
-export function entitiesByIdPath(cwd: string): string {
-  return path.join(indexDir(cwd), "entities.by-id.json");
-}
+export function entitiesByIdPath(cwd: string): string {}
 
 export function currentPathsPath(cwd: string): string {
killedBy: integrity paths entitiesByIdPath is under indexDir
statusReason: expected undefined to be '/test/project/.integrity/index/entiti…' // Object.is equality

[Killed] BlockStatement
src/integrity/paths.ts:49:55
   return path.join(indexDir(cwd), "entities.by-id.json");
 }
 
-export function currentPathsPath(cwd: string): string {
-  return path.join(indexDir(cwd), "paths.current.json");
-}
+export function currentPathsPath(cwd: string): string {}
 
 export function manifestsRoot(cwd: string): string {
killedBy: integrity paths currentPathsPath is under indexDir
statusReason: expected undefined to be '/test/project/.integrity/index/paths.…' // Object.is equality

[Killed] BlockStatement
src/integrity/paths.ts:53:52
   return path.join(indexDir(cwd), "paths.current.json");
 }
 
-export function manifestsRoot(cwd: string): string {
-  return path.join(integrityRoot(cwd), "manifests");
-}
+export function manifestsRoot(cwd: string): string {}
 
 export function manifestPathForDirectory(cwd: string, repoDir: string): string {
killedBy: integrity paths manifestPathForDirectory uses 'root' for '.'
statusReason: The "path" argument must be of type string. Received undefined

[Killed] StringLiteral
src/integrity/paths.ts:54:40
 }
 
 export function manifestsRoot(cwd: string): string {
-  return path.join(integrityRoot(cwd), "manifests");
+  return path.join(integrityRoot(cwd), "");
 }
 
killedBy: integrity paths manifestPathForDirectory uses 'root' for '.'
statusReason: expected '/test/project/.integrity/root/version…' to be '/test/project/.integrity/manifests/ro…' // Object.is equality

[Killed] BlockStatement
src/integrity/paths.ts:57:80
   return path.join(integrityRoot(cwd), "manifests");
 }
 
-export function manifestPathForDirectory(cwd: string, repoDir: string): string {
-  const safeDir = repoDir === "." ? "root" : repoDir;
-  return path.join(manifestsRoot(cwd), safeDir, "versions.json");
-}
+export function manifestPathForDirectory(cwd: string, repoDir: string): string {}
 
 export function stateDir(cwd: string): string {
killedBy: integrity paths manifestPathForDirectory uses 'root' for '.'
statusReason: expected undefined to be '/test/project/.integrity/manifests/ro…' // Object.is equality

[Killed] ConditionalExpression
src/integrity/paths.ts:58:19
 }
 
 export function manifestPathForDirectory(cwd: string, repoDir: string): string {
-  const safeDir = repoDir === "." ? "root" : repoDir;
+  const safeDir = false ? "root" : repoDir;
   return path.join(manifestsRoot(cwd), safeDir, "versions.json");
 }
killedBy: integrity paths manifestPathForDirectory uses 'root' for '.'
statusReason: expected '/test/project/.integrity/manifests/ve…' to be '/test/project/.integrity/manifests/ro…' // Object.is equality

[Killed] ConditionalExpression
src/integrity/paths.ts:58:19
 }
 
 export function manifestPathForDirectory(cwd: string, repoDir: string): string {
-  const safeDir = repoDir === "." ? "root" : repoDir;
+  const safeDir = true ? "root" : repoDir;
   return path.join(manifestsRoot(cwd), safeDir, "versions.json");
 }
killedBy: integrity paths manifestPathForDirectory uses repoDir for non-dot
statusReason: expected '/test/project/.integrity/manifests/ro…' to be '/test/project/.integrity/manifests/pa…' // Object.is equality

[NoCoverage] BlockStatement
src/integrity/paths.ts:62:47
   return path.join(manifestsRoot(cwd), safeDir, "versions.json");
 }
 
-export function stateDir(cwd: string): string {
-  return path.join(integrityRoot(cwd), "state");
-}
+export function stateDir(cwd: string): string {}
 
 export function deletedLogPath(cwd: string): string {

[NoCoverage] BlockStatement
src/integrity/paths.ts:66:53
   return path.join(integrityRoot(cwd), "state");
 }
 
-export function deletedLogPath(cwd: string): string {
-  return path.join(stateDir(cwd), "deleted-log.json");
-}
+export function deletedLogPath(cwd: string): string {}
 
 export function movedLogPath(cwd: string): string {

[NoCoverage] BlockStatement
src/integrity/paths.ts:70:51
   return path.join(stateDir(cwd), "deleted-log.json");
 }
 
-export function movedLogPath(cwd: string): string {
-  return path.join(stateDir(cwd), "moved-log.json");
-}
+export function movedLogPath(cwd: string): string {}
 
 export function buildDir(cwd: string): string {

[NoCoverage] StringLiteral
src/integrity/paths.ts:71:35
 }
 
 export function movedLogPath(cwd: string): string {
-  return path.join(stateDir(cwd), "moved-log.json");
+  return path.join(stateDir(cwd), "");
 }
 

[Killed] BlockStatement
src/integrity/paths.ts:74:47
   return path.join(stateDir(cwd), "moved-log.json");
 }
 
-export function buildDir(cwd: string): string {
-  return path.join(integrityRoot(cwd), "build");
-}
+export function buildDir(cwd: string): string {}
 
 export function buildLatestDir(cwd: string): string {
killedBy: integrity paths build paths are nested correctly
statusReason: expected undefined to be '/test/project/.integrity/build' // Object.is equality

[Killed] BlockStatement
src/integrity/paths.ts:78:53
   return path.join(integrityRoot(cwd), "build");
 }
 
-export function buildLatestDir(cwd: string): string {
-  return path.join(buildDir(cwd), "latest");
-}
+export function buildLatestDir(cwd: string): string {}
 
 export function outputsPath(cwd: string): string {
killedBy: integrity paths build paths are nested correctly
statusReason: expected undefined to be '/test/project/.integrity/build/latest' // Object.is equality

[Killed] StringLiteral
src/integrity/paths.ts:79:35
 }
 
 export function buildLatestDir(cwd: string): string {
-  return path.join(buildDir(cwd), "latest");
+  return path.join(buildDir(cwd), "");
 }
 
killedBy: integrity paths build paths are nested correctly
statusReason: expected '/test/project/.integrity/build' to be '/test/project/.integrity/build/latest' // Object.is equality

[Killed] BlockStatement
src/integrity/paths.ts:82:50
   return path.join(buildDir(cwd), "latest");
 }
 
-export function outputsPath(cwd: string): string {
-  return path.join(buildLatestDir(cwd), "outputs.json");
-}
+export function outputsPath(cwd: string): string {}
 
 export function provenancePath(cwd: string): string {
killedBy: integrity paths build paths are nested correctly
statusReason: expected undefined to be '/test/project/.integrity/build/latest…' // Object.is equality

[Killed] BlockStatement
src/integrity/paths.ts:86:53
   return path.join(buildLatestDir(cwd), "outputs.json");
 }
 
-export function provenancePath(cwd: string): string {
-  return path.join(buildLatestDir(cwd), "build-provenance.json");
-}
+export function provenancePath(cwd: string): string {}
 
 export function signatureBinaryPath(cwd: string): string {
killedBy: integrity paths build paths are nested correctly
statusReason: expected undefined to be '/test/project/.integrity/build/latest…' // Object.is equality

[Killed] StringLiteral
src/integrity/paths.ts:87:41
 }
 
 export function provenancePath(cwd: string): string {
-  return path.join(buildLatestDir(cwd), "build-provenance.json");
+  return path.join(buildLatestDir(cwd), "");
 }
 
killedBy: integrity paths build paths are nested correctly
statusReason: expected '/test/project/.integrity/build/latest' to be '/test/project/.integrity/build/latest…' // Object.is equality

[Killed] BlockStatement
src/integrity/paths.ts:90:58
   return path.join(buildLatestDir(cwd), "build-provenance.json");
 }
 
-export function signatureBinaryPath(cwd: string): string {
-  return path.join(buildLatestDir(cwd), "signature.bin");
-}
+export function signatureBinaryPath(cwd: string): string {}
 
 export function signatureHexPath(cwd: string): string {
killedBy: integrity paths signature paths are under buildLatestDir
statusReason: expected undefined to be '/test/project/.integrity/build/latest…' // Object.is equality

[Killed] StringLiteral
src/integrity/paths.ts:91:41
 }
 
 export function signatureBinaryPath(cwd: string): string {
-  return path.join(buildLatestDir(cwd), "signature.bin");
+  return path.join(buildLatestDir(cwd), "");
 }
 
killedBy: integrity paths signature paths are under buildLatestDir
statusReason: expected '/test/project/.integrity/build/latest' to be '/test/project/.integrity/build/latest…' // Object.is equality

[Killed] BlockStatement
src/integrity/paths.ts:94:55
   return path.join(buildLatestDir(cwd), "signature.bin");
 }
 
-export function signatureHexPath(cwd: string): string {
-  return path.join(buildLatestDir(cwd), "signature.hex");
-}
+export function signatureHexPath(cwd: string): string {}
 
 export function signedManifestPath(cwd: string): string {
killedBy: integrity paths signature paths are under buildLatestDir
statusReason: expected undefined to be '/test/project/.integrity/build/latest…' // Object.is equality

[Killed] StringLiteral
src/integrity/paths.ts:95:41
 }
 
 export function signatureHexPath(cwd: string): string {
-  return path.join(buildLatestDir(cwd), "signature.hex");
+  return path.join(buildLatestDir(cwd), "");
 }
 
killedBy: integrity paths signature paths are under buildLatestDir
statusReason: expected '/test/project/.integrity/build/latest' to be '/test/project/.integrity/build/latest…' // Object.is equality

[Killed] BlockStatement
src/integrity/paths.ts:98:57
   return path.join(buildLatestDir(cwd), "signature.hex");
 }
 
-export function signedManifestPath(cwd: string): string {
-  return path.join(buildLatestDir(cwd), "signed-manifest.json");
-}
+export function signedManifestPath(cwd: string): string {}
 
killedBy: integrity paths signature paths are under buildLatestDir
statusReason: expected undefined to be '/test/project/.integrity/build/latest…' // Object.is equality

[Killed] StringLiteral
src/integrity/paths.ts:99:41
 }
 
 export function signedManifestPath(cwd: string): string {
-  return path.join(buildLatestDir(cwd), "signed-manifest.json");
+  return path.join(buildLatestDir(cwd), "");
 }
 
killedBy: integrity paths signature paths are under buildLatestDir
statusReason: expected '/test/project/.integrity/build/latest' to be '/test/project/.integrity/build/latest…' // Object.is equality
