[NoCoverage] BlockStatement
src/integrity/policy.ts:24:45
 import { policyPath, schemaDir } from "./paths.ts";
 import type { IntegrityPolicy } from "./types.ts";
 
-function escapeRegex(input: string): string {
-  return input.replace(/[|\\{}()[\]^$+?.]/g, "\\$&");
-}
+function escapeRegex(input: string): string {}
 
 function globToRegExp(pattern: string): RegExp {

[NoCoverage] BlockStatement
src/integrity/policy.ts:28:48
   return input.replace(/[|\\{}()[\]^$+?.]/g, "\\$&");
 }
 
-function globToRegExp(pattern: string): RegExp {
-  const normalized = pattern.replace(/\\/g, "/");
-  const placeholder = "__DOUBLE_STAR__";
-  const source = escapeRegex(normalized)
-    .replace(/\*\*/g, placeholder)
-    .replace(/\*/g, "[^/]*")
-    .replace(new RegExp(placeholder, "g"), ".*");
-  return new RegExp(`^${source}$`);
-}
+function globToRegExp(pattern: string): RegExp {}
 
 const BOOTSTRAP_POLICY = {

[NoCoverage] StringLiteral
src/integrity/policy.ts:34:44
   const source = escapeRegex(normalized)
     .replace(/\*\*/g, placeholder)
     .replace(/\*/g, "[^/]*")
-    .replace(new RegExp(placeholder, "g"), ".*");
+    .replace(new RegExp(placeholder, "g"), "");
   return new RegExp(`^${source}$`);
 }

[Survived] ArrayDeclaration
src/integrity/policy.ts:41:12
 const BOOTSTRAP_POLICY = {
   $schemaVersion: 1,
   hashAlgorithm: "sha256",
-  include: [
-    "src/**",
-    "public/**",
-    "*.json",
-    "**/*.json",
-    "*.ts",
-    "**/*.ts",
-    "*.js",
-    "**/*.js",
-    "*.astro",
-    "**/*.astro",
-    "*.md",
-    "**/*.md",
-    "*.mdx",
-    "**/*.mdx",
-  ],
+  include: [],
   exclude: [
     ".git/**",

[Survived] StringLiteral
src/integrity/policy.ts:52:5
     "**/*.js",
     "*.astro",
     "**/*.astro",
-    "*.md",
+    "",
     "**/*.md",
     "*.mdx",

[Survived] StringLiteral
src/integrity/policy.ts:53:5
     "*.astro",
     "**/*.astro",
     "*.md",
-    "**/*.md",
+    "",
     "*.mdx",
     "**/*.mdx",

[Survived] StringLiteral
src/integrity/policy.ts:54:5
     "**/*.astro",
     "*.md",
     "**/*.md",
-    "*.mdx",
+    "",
     "**/*.mdx",
   ],

[Killed] ArrayDeclaration
src/integrity/policy.ts:57:12
     "*.mdx",
     "**/*.mdx",
   ],
-  exclude: [
-    ".git/**",
-    "node_modules/**",
-    ".astro/**",
-    "dist/**",
-    ".idea/**",
-    ".vscode/**",
-    ".integrity/**",
-    "spec/**",
-    "todo/**",
-  ],
+  exclude: [],
   moveDetection: {
     enableHeuristics: false,
killedBy: release.ready stores artifact before state transition
statusReason: ENOENT: no such file or directory, open '/tmp/systems-cache/test-sys/bordbuch/events.ndjson'

[Survived] ObjectLiteral
src/integrity/policy.ts:68:18
     "spec/**",
     "todo/**",
   ],
-  moveDetection: {
-    enableHeuristics: false,
-    similarityThreshold: 0.85,
-    maxDeletedCandidateAgeHours: 72,
-  },
+  moveDetection: {},
   history: {
     keepDeletedLog: true,

[Survived] BooleanLiteral
src/integrity/policy.ts:69:23
     "todo/**",
   ],
   moveDetection: {
-    enableHeuristics: false,
+    enableHeuristics: true,
     similarityThreshold: 0.85,
     maxDeletedCandidateAgeHours: 72,

[Survived] BooleanLiteral
src/integrity/policy.ts:74:21
     maxDeletedCandidateAgeHours: 72,
   },
   history: {
-    keepDeletedLog: true,
+    keepDeletedLog: false,
     keepBuildHistory: true,
   },

[Survived] BooleanLiteral
src/integrity/policy.ts:75:23
   },
   history: {
     keepDeletedLog: true,
-    keepBuildHistory: true,
+    keepBuildHistory: false,
   },
 } satisfies IntegrityPolicy;

[NoCoverage] BlockStatement
src/integrity/policy.ts:270:62
   },
 } as const;
 
-async function ensureSchemaFiles(cwd: string): Promise<void> {
-  const root = schemaDir(cwd);
-
-  for (const [fileName, schema] of Object.entries(BOOTSTRAP_SCHEMAS)) {
-    const filePath = `${root}/${fileName}`;
-    if (await pathExists(filePath)) {
-      continue;
-    }
-
-    await writeJsonFile(filePath, schema);
-  }
-}
+async function ensureSchemaFiles(cwd: string): Promise<void> {}
 
 export async function ensurePolicyFile(cwd: string): Promise<IntegrityPolicy> {

[NoCoverage] BlockStatement
src/integrity/policy.ts:273:71
 async function ensureSchemaFiles(cwd: string): Promise<void> {
   const root = schemaDir(cwd);
 
-  for (const [fileName, schema] of Object.entries(BOOTSTRAP_SCHEMAS)) {
-    const filePath = `${root}/${fileName}`;
-    if (await pathExists(filePath)) {
-      continue;
-    }
-
-    await writeJsonFile(filePath, schema);
-  }
+  for (const [fileName, schema] of Object.entries(BOOTSTRAP_SCHEMAS)) {}
 }
 

[NoCoverage] BlockStatement
src/integrity/policy.ts:275:37
 
   for (const [fileName, schema] of Object.entries(BOOTSTRAP_SCHEMAS)) {
     const filePath = `${root}/${fileName}`;
-    if (await pathExists(filePath)) {
-      continue;
-    }
+    if (await pathExists(filePath)) {}
 
     await writeJsonFile(filePath, schema);

[NoCoverage] ConditionalExpression
src/integrity/policy.ts:275:9
 
   for (const [fileName, schema] of Object.entries(BOOTSTRAP_SCHEMAS)) {
     const filePath = `${root}/${fileName}`;
-    if (await pathExists(filePath)) {
+    if (true) {
       continue;
     }

[NoCoverage] BlockStatement
src/integrity/policy.ts:283:79
   }
 }
 
-export async function ensurePolicyFile(cwd: string): Promise<IntegrityPolicy> {
-  const filePath = policyPath(cwd);
-  await ensureSchemaFiles(cwd);
-
-  if (await pathExists(filePath)) {
-    return readJsonFile<IntegrityPolicy>(filePath);
-  }
-
-  await writeJsonFile(filePath, BOOTSTRAP_POLICY);
-  return BOOTSTRAP_POLICY;
-}
+export async function ensurePolicyFile(cwd: string): Promise<IntegrityPolicy> {}
 
 export async function loadPolicy(cwd: string): Promise<IntegrityPolicy> {

[NoCoverage] ConditionalExpression
src/integrity/policy.ts:287:7
   const filePath = policyPath(cwd);
   await ensureSchemaFiles(cwd);
 
-  if (await pathExists(filePath)) {
+  if (true) {
     return readJsonFile<IntegrityPolicy>(filePath);
   }

[NoCoverage] BlockStatement
src/integrity/policy.ts:287:35
   const filePath = policyPath(cwd);
   await ensureSchemaFiles(cwd);
 
-  if (await pathExists(filePath)) {
-    return readJsonFile<IntegrityPolicy>(filePath);
-  }
+  if (await pathExists(filePath)) {}
 
   await writeJsonFile(filePath, BOOTSTRAP_POLICY);

[NoCoverage] BlockStatement
src/integrity/policy.ts:295:73
   return BOOTSTRAP_POLICY;
 }
 
-export async function loadPolicy(cwd: string): Promise<IntegrityPolicy> {
-  return ensurePolicyFile(cwd);
-}
+export async function loadPolicy(cwd: string): Promise<IntegrityPolicy> {}
 
 export function isManagedPath(repoPath: string, policy: IntegrityPolicy): boolean {

[NoCoverage] BlockStatement
src/integrity/policy.ts:299:83
   return ensurePolicyFile(cwd);
 }
 
-export function isManagedPath(repoPath: string, policy: IntegrityPolicy): boolean {
-  const normalized = repoPath.replace(/\\/g, "/");
-  const excluded = policy.exclude.some((pattern) => globToRegExp(pattern).test(normalized));
-  if (excluded) return false;
-  return policy.include.some((pattern) => globToRegExp(pattern).test(normalized));
-}
+export function isManagedPath(repoPath: string, policy: IntegrityPolicy): boolean {}
 

[NoCoverage] StringLiteral
src/integrity/policy.ts:300:46
 }
 
 export function isManagedPath(repoPath: string, policy: IntegrityPolicy): boolean {
-  const normalized = repoPath.replace(/\\/g, "/");
+  const normalized = repoPath.replace(/\\/g, "");
   const excluded = policy.exclude.some((pattern) => globToRegExp(pattern).test(normalized));
   if (excluded) return false;

[NoCoverage] MethodExpression
src/integrity/policy.ts:301:20
 
 export function isManagedPath(repoPath: string, policy: IntegrityPolicy): boolean {
   const normalized = repoPath.replace(/\\/g, "/");
-  const excluded = policy.exclude.some((pattern) => globToRegExp(pattern).test(normalized));
+  const excluded = policy.exclude.every(pattern => globToRegExp(pattern).test(normalized));
   if (excluded) return false;
   return policy.include.some((pattern) => globToRegExp(pattern).test(normalized));

[NoCoverage] ArrowFunction
src/integrity/policy.ts:301:40
 
 export function isManagedPath(repoPath: string, policy: IntegrityPolicy): boolean {
   const normalized = repoPath.replace(/\\/g, "/");
-  const excluded = policy.exclude.some((pattern) => globToRegExp(pattern).test(normalized));
+  const excluded = policy.exclude.some(() => undefined);
   if (excluded) return false;
   return policy.include.some((pattern) => globToRegExp(pattern).test(normalized));

[NoCoverage] BooleanLiteral
src/integrity/policy.ts:302:24
 export function isManagedPath(repoPath: string, policy: IntegrityPolicy): boolean {
   const normalized = repoPath.replace(/\\/g, "/");
   const excluded = policy.exclude.some((pattern) => globToRegExp(pattern).test(normalized));
-  if (excluded) return false;
+  if (excluded) return true;
   return policy.include.some((pattern) => globToRegExp(pattern).test(normalized));
 }

[NoCoverage] ConditionalExpression
src/integrity/policy.ts:302:7
 export function isManagedPath(repoPath: string, policy: IntegrityPolicy): boolean {
   const normalized = repoPath.replace(/\\/g, "/");
   const excluded = policy.exclude.some((pattern) => globToRegExp(pattern).test(normalized));
-  if (excluded) return false;
+  if (true) return false;
   return policy.include.some((pattern) => globToRegExp(pattern).test(normalized));
 }

[NoCoverage] ArrowFunction
src/integrity/policy.ts:303:30
   const normalized = repoPath.replace(/\\/g, "/");
   const excluded = policy.exclude.some((pattern) => globToRegExp(pattern).test(normalized));
   if (excluded) return false;
-  return policy.include.some((pattern) => globToRegExp(pattern).test(normalized));
+  return policy.include.some(() => undefined);
 }
 

[NoCoverage] MethodExpression
src/integrity/policy.ts:303:10
   const normalized = repoPath.replace(/\\/g, "/");
   const excluded = policy.exclude.some((pattern) => globToRegExp(pattern).test(normalized));
   if (excluded) return false;
-  return policy.include.some((pattern) => globToRegExp(pattern).test(normalized));
+  return policy.include.every(pattern => globToRegExp(pattern).test(normalized));
 }
 
