[NoCoverage] BlockStatement
src/integrity/registry.ts:24:76
 import { currentPathsPath, entitiesByIdPath } from "./paths.ts";
 import type { EntitiesById, PathsCurrent } from "./types.ts";
 
-export async function loadEntitiesById(cwd: string): Promise<EntitiesById> {
-  const filePath = entitiesByIdPath(cwd);
-  if (!(await pathExists(filePath))) return {};
-  return readJsonFile<EntitiesById>(filePath);
-}
+export async function loadEntitiesById(cwd: string): Promise<EntitiesById> {}
 
 export async function saveEntitiesById(cwd: string, value: EntitiesById): Promise<void> {

[NoCoverage] ConditionalExpression
src/integrity/registry.ts:26:7
 
 export async function loadEntitiesById(cwd: string): Promise<EntitiesById> {
   const filePath = entitiesByIdPath(cwd);
-  if (!(await pathExists(filePath))) return {};
+  if (true) return {};
   return readJsonFile<EntitiesById>(filePath);
 }

[NoCoverage] ConditionalExpression
src/integrity/registry.ts:26:7
 
 export async function loadEntitiesById(cwd: string): Promise<EntitiesById> {
   const filePath = entitiesByIdPath(cwd);
-  if (!(await pathExists(filePath))) return {};
+  if (false) return {};
   return readJsonFile<EntitiesById>(filePath);
 }

[NoCoverage] BlockStatement
src/integrity/registry.ts:30:89
   return readJsonFile<EntitiesById>(filePath);
 }
 
-export async function saveEntitiesById(cwd: string, value: EntitiesById): Promise<void> {
-  await writeJsonFile(entitiesByIdPath(cwd), value);
-}
+export async function saveEntitiesById(cwd: string, value: EntitiesById): Promise<void> {}
 
 export async function loadPathsCurrent(cwd: string): Promise<PathsCurrent> {

[NoCoverage] BlockStatement
src/integrity/registry.ts:34:76
   await writeJsonFile(entitiesByIdPath(cwd), value);
 }
 
-export async function loadPathsCurrent(cwd: string): Promise<PathsCurrent> {
-  const filePath = currentPathsPath(cwd);
-  if (!(await pathExists(filePath))) return {};
-  return readJsonFile<PathsCurrent>(filePath);
-}
+export async function loadPathsCurrent(cwd: string): Promise<PathsCurrent> {}
 
 export async function savePathsCurrent(cwd: string, value: PathsCurrent): Promise<void> {

[NoCoverage] ConditionalExpression
src/integrity/registry.ts:36:7
 
 export async function loadPathsCurrent(cwd: string): Promise<PathsCurrent> {
   const filePath = currentPathsPath(cwd);
-  if (!(await pathExists(filePath))) return {};
+  if (true) return {};
   return readJsonFile<PathsCurrent>(filePath);
 }

[NoCoverage] ConditionalExpression
src/integrity/registry.ts:36:7
 
 export async function loadPathsCurrent(cwd: string): Promise<PathsCurrent> {
   const filePath = currentPathsPath(cwd);
-  if (!(await pathExists(filePath))) return {};
+  if (false) return {};
   return readJsonFile<PathsCurrent>(filePath);
 }

[NoCoverage] BlockStatement
src/integrity/registry.ts:40:89
   return readJsonFile<PathsCurrent>(filePath);
 }
 
-export async function savePathsCurrent(cwd: string, value: PathsCurrent): Promise<void> {
-  await writeJsonFile(currentPathsPath(cwd), value);
-}
+export async function savePathsCurrent(cwd: string, value: PathsCurrent): Promise<void> {}
 
 export function bindPath(

[NoCoverage] BlockStatement
src/integrity/registry.ts:49:9
   paths: PathsCurrent,
   entityId: string,
   repoPath: string,
-): void {
-  const previousPath = entities[entityId]?.currentPath;
-  if (previousPath && previousPath !== repoPath) {
-    delete paths[previousPath];
-  }
-  paths[repoPath] = entityId;
-  if (entities[entityId]) {
-    entities[entityId].currentPath = repoPath;
-  }
-}
+): void {}
 
 export function unbindPath(entities: EntitiesById, paths: PathsCurrent, repoPath: string): void {

[NoCoverage] OptionalChaining
src/integrity/registry.ts:50:24
   entityId: string,
   repoPath: string,
 ): void {
-  const previousPath = entities[entityId]?.currentPath;
+  const previousPath = entities[entityId].currentPath;
   if (previousPath && previousPath !== repoPath) {
     delete paths[previousPath];

[NoCoverage] ConditionalExpression
src/integrity/registry.ts:51:23
   repoPath: string,
 ): void {
   const previousPath = entities[entityId]?.currentPath;
-  if (previousPath && previousPath !== repoPath) {
+  if (previousPath && true) {
     delete paths[previousPath];
   }

[NoCoverage] EqualityOperator
src/integrity/registry.ts:51:23
   repoPath: string,
 ): void {
   const previousPath = entities[entityId]?.currentPath;
-  if (previousPath && previousPath !== repoPath) {
+  if (previousPath && previousPath === repoPath) {
     delete paths[previousPath];
   }

[NoCoverage] ConditionalExpression
src/integrity/registry.ts:55:7
     delete paths[previousPath];
   }
   paths[repoPath] = entityId;
-  if (entities[entityId]) {
+  if (true) {
     entities[entityId].currentPath = repoPath;
   }

[NoCoverage] ConditionalExpression
src/integrity/registry.ts:55:7
     delete paths[previousPath];
   }
   paths[repoPath] = entityId;
-  if (entities[entityId]) {
+  if (false) {
     entities[entityId].currentPath = repoPath;
   }

[NoCoverage] BlockStatement
src/integrity/registry.ts:60:97
   }
 }
 
-export function unbindPath(entities: EntitiesById, paths: PathsCurrent, repoPath: string): void {
-  const entityId = paths[repoPath];
-  delete paths[repoPath];
-  if (entityId && entities[entityId]) {
-    entities[entityId].status = "deleted";
-  }
-}
+export function unbindPath(entities: EntitiesById, paths: PathsCurrent, repoPath: string): void {}
 

[NoCoverage] ConditionalExpression
src/integrity/registry.ts:63:7
 export function unbindPath(entities: EntitiesById, paths: PathsCurrent, repoPath: string): void {
   const entityId = paths[repoPath];
   delete paths[repoPath];
-  if (entityId && entities[entityId]) {
+  if (false) {
     entities[entityId].status = "deleted";
   }

[NoCoverage] ConditionalExpression
src/integrity/registry.ts:63:7
 export function unbindPath(entities: EntitiesById, paths: PathsCurrent, repoPath: string): void {
   const entityId = paths[repoPath];
   delete paths[repoPath];
-  if (entityId && entities[entityId]) {
+  if (true) {
     entities[entityId].status = "deleted";
   }
