[NoCoverage] ArrowFunction
src/integrity/run-backfill-revisions.ts:37:86
   const { cwd } = args;
   const entities = await loadEntitiesById(cwd);
   const paths = await loadPathsCurrent(cwd);
-  const deletedLog = await readJsonFile<DeletedLogItem[]>(deletedLogPath(cwd)).catch(() => []);
+  const deletedLog = await readJsonFile<DeletedLogItem[]>(deletedLogPath(cwd)).catch(() => undefined);
   const deletedByEntityId = new Map(deletedLog.map((item) => [item.entityId, item]));
   const manifestCache = new Map<string, Awaited<ReturnType<typeof loadDirectoryManifest>>>();

[NoCoverage] ArrayDeclaration
src/integrity/run-backfill-revisions.ts:37:92
   const { cwd } = args;
   const entities = await loadEntitiesById(cwd);
   const paths = await loadPathsCurrent(cwd);
-  const deletedLog = await readJsonFile<DeletedLogItem[]>(deletedLogPath(cwd)).catch(() => []);
+  const deletedLog = await readJsonFile<DeletedLogItem[]>(deletedLogPath(cwd)).catch(() => ["Stryker was here"]);
   const deletedByEntityId = new Map(deletedLog.map((item) => [item.entityId, item]));
   const manifestCache = new Map<string, Awaited<ReturnType<typeof loadDirectoryManifest>>>();

[NoCoverage] ArrowFunction
src/integrity/run-backfill-revisions.ts:38:52
   const entities = await loadEntitiesById(cwd);
   const paths = await loadPathsCurrent(cwd);
   const deletedLog = await readJsonFile<DeletedLogItem[]>(deletedLogPath(cwd)).catch(() => []);
-  const deletedByEntityId = new Map(deletedLog.map((item) => [item.entityId, item]));
+  const deletedByEntityId = new Map(deletedLog.map(() => undefined));
   const manifestCache = new Map<string, Awaited<ReturnType<typeof loadDirectoryManifest>>>();
 

[NoCoverage] BlockStatement
src/integrity/run-backfill-revisions.ts:47:20
 
   for (const [entityId, entity] of Object.entries(entities)) {
     const repoPath = entity.currentPath;
-    if (!repoPath) {
-      continue;
-    }
+    if (!repoPath) {}
 
     const revision = await getFileRevisionFromHistory(cwd, repoPath);

[NoCoverage] BooleanLiteral
src/integrity/run-backfill-revisions.ts:47:9
 
   for (const [entityId, entity] of Object.entries(entities)) {
     const repoPath = entity.currentPath;
-    if (!repoPath) {
+    if (repoPath) {
       continue;
     }

[NoCoverage] ConditionalExpression
src/integrity/run-backfill-revisions.ts:52:9
     }
 
     const revision = await getFileRevisionFromHistory(cwd, repoPath);
-    if (revision === entity.revision) {
+    if (false) {
       continue;
     }

[NoCoverage] EqualityOperator
src/integrity/run-backfill-revisions.ts:52:9
     }
 
     const revision = await getFileRevisionFromHistory(cwd, repoPath);
-    if (revision === entity.revision) {
+    if (revision !== entity.revision) {
       continue;
     }

[NoCoverage] AssignmentOperator
src/integrity/run-backfill-revisions.ts:57:5
     }
 
     entity.revision = revision;
-    updatedEntities += 1;
+    updatedEntities -= 1;
 
     const deletedItem = deletedByEntityId.get(entityId);

[NoCoverage] ConditionalExpression
src/integrity/run-backfill-revisions.ts:60:9
     updatedEntities += 1;
 
     const deletedItem = deletedByEntityId.get(entityId);
-    if (deletedItem) {
+    if (false) {
       deletedItem.lastRevision = revision;
       updatedDeletedLog += 1;

[NoCoverage] ConditionalExpression
src/integrity/run-backfill-revisions.ts:60:9
     updatedEntities += 1;
 
     const deletedItem = deletedByEntityId.get(entityId);
-    if (deletedItem) {
+    if (true) {
       deletedItem.lastRevision = revision;
       updatedDeletedLog += 1;

[NoCoverage] AssignmentOperator
src/integrity/run-backfill-revisions.ts:62:7
     const deletedItem = deletedByEntityId.get(entityId);
     if (deletedItem) {
       deletedItem.lastRevision = revision;
-      updatedDeletedLog += 1;
+      updatedDeletedLog -= 1;
     }
 

[NoCoverage] LogicalOperator
src/integrity/run-backfill-revisions.ts:65:9
       updatedDeletedLog += 1;
     }
 
-    if (entity.status !== "active" || paths[repoPath] !== entityId) {
+    if (entity.status !== "active" && paths[repoPath] !== entityId) {
       continue;
     }

[NoCoverage] ConditionalExpression
src/integrity/run-backfill-revisions.ts:65:9
       updatedDeletedLog += 1;
     }
 
-    if (entity.status !== "active" || paths[repoPath] !== entityId) {
+    if (true) {
       continue;
     }

[NoCoverage] ConditionalExpression
src/integrity/run-backfill-revisions.ts:72:9
     const repoDir = path.posix.dirname(repoPath);
     const fileName = getManifestFileName(repoPath);
     let manifest = manifestCache.get(repoDir);
-    if (manifest === undefined) {
+    if (false) {
       manifest = await loadDirectoryManifest(cwd, repoDir);
       manifestCache.set(repoDir, manifest);

[NoCoverage] EqualityOperator
src/integrity/run-backfill-revisions.ts:72:9
     const repoDir = path.posix.dirname(repoPath);
     const fileName = getManifestFileName(repoPath);
     let manifest = manifestCache.get(repoDir);
-    if (manifest === undefined) {
+    if (manifest !== undefined) {
       manifest = await loadDirectoryManifest(cwd, repoDir);
       manifestCache.set(repoDir, manifest);

[NoCoverage] CallExpression
src/integrity/run-backfill-revisions.ts:74:7
     let manifest = manifestCache.get(repoDir);
     if (manifest === undefined) {
       manifest = await loadDirectoryManifest(cwd, repoDir);
-      manifestCache.set(repoDir, manifest);
+      ;
     }
     if (!manifest) {

[NoCoverage] BlockStatement
src/integrity/run-backfill-revisions.ts:76:20
       manifest = await loadDirectoryManifest(cwd, repoDir);
       manifestCache.set(repoDir, manifest);
     }
-    if (!manifest) {
-      continue;
-    }
+    if (!manifest) {}
 
     upsertManifestRecord(manifest, fileName, {

[NoCoverage] ConditionalExpression
src/integrity/run-backfill-revisions.ts:76:9
       manifest = await loadDirectoryManifest(cwd, repoDir);
       manifestCache.set(repoDir, manifest);
     }
-    if (!manifest) {
+    if (false) {
       continue;
     }

[NoCoverage] AssignmentOperator
src/integrity/run-backfill-revisions.ts:89:5
       gitSha: entity.gitSha,
       status: entity.status,
     });
-    updatedActiveRecords += 1;
+    updatedActiveRecords -= 1;
   }
 

[NoCoverage] MethodExpression
src/integrity/run-backfill-revisions.ts:94:5
 
   await saveEntitiesById(cwd, entities);
   await Promise.all(
-    Array.from(manifestCache.values())
-      .filter((manifest): manifest is NonNullable<typeof manifest> => Boolean(manifest))
+    Array.from(manifestCache.values())
       .map((manifest) => saveDirectoryManifest(cwd, manifest)),
   );

[NoCoverage] ArrowFunction
src/integrity/run-backfill-revisions.ts:95:15
   await saveEntitiesById(cwd, entities);
   await Promise.all(
     Array.from(manifestCache.values())
-      .filter((manifest): manifest is NonNullable<typeof manifest> => Boolean(manifest))
+      .filter(() => undefined)
       .map((manifest) => saveDirectoryManifest(cwd, manifest)),
   );

[NoCoverage] ArrowFunction
src/integrity/run-backfill-revisions.ts:96:12
   await Promise.all(
     Array.from(manifestCache.values())
       .filter((manifest): manifest is NonNullable<typeof manifest> => Boolean(manifest))
-      .map((manifest) => saveDirectoryManifest(cwd, manifest)),
+      .map(() => undefined),
   );
 

[NoCoverage] EqualityOperator
src/integrity/run-backfill-revisions.ts:99:7
       .map((manifest) => saveDirectoryManifest(cwd, manifest)),
   );
 
-  if (updatedDeletedLog > 0) {
+  if (updatedDeletedLog >= 0) {
     await writeJsonFile(deletedLogPath(cwd), deletedLog);
   }

[NoCoverage] BlockStatement
src/integrity/run-backfill-revisions.ts:99:30
       .map((manifest) => saveDirectoryManifest(cwd, manifest)),
   );
 
-  if (updatedDeletedLog > 0) {
-    await writeJsonFile(deletedLogPath(cwd), deletedLog);
-  }
+  if (updatedDeletedLog > 0) {}
 
   console.log("");

[NoCoverage] StringLiteral
src/integrity/run-backfill-revisions.ts:103:15
     await writeJsonFile(deletedLogPath(cwd), deletedLog);
   }
 
-  console.log("");
+  console.log("Stryker was here!");
   console.log("Integrity revision backfill");
   console.log(`  updated entities      ${updatedEntities}`);

[NoCoverage] StringLiteral
src/integrity/run-backfill-revisions.ts:105:15
 
   console.log("");
   console.log("Integrity revision backfill");
-  console.log(`  updated entities      ${updatedEntities}`);
+  console.log(``);
   console.log(`  updated manifest rows ${updatedActiveRecords}`);
   console.log(`  updated deleted log   ${updatedDeletedLog}`);

[NoCoverage] StringLiteral
src/integrity/run-backfill-revisions.ts:106:15
   console.log("");
   console.log("Integrity revision backfill");
   console.log(`  updated entities      ${updatedEntities}`);
-  console.log(`  updated manifest rows ${updatedActiveRecords}`);
+  console.log(``);
   console.log(`  updated deleted log   ${updatedDeletedLog}`);
 }
