[NoCoverage] ObjectLiteral
src/integrity/run-init.ts:58:20
     ]);
     const now = new Date().toISOString();
 
-    const record = {
-      entityId,
-      createdAt: history.createdAt ?? now,
-      updatedAt: history.updatedAt ?? now,
-      revision,
-      contentHash: hash,
-      gitSha: history.lastCommitSha ?? "unknown",
-      status: "active" as const,
-    };
+    const record = {};
 
     const repoDir = path.posix.dirname(file);

[NoCoverage] LogicalOperator
src/integrity/run-init.ts:60:18
 
     const record = {
       entityId,
-      createdAt: history.createdAt ?? now,
+      createdAt: history.createdAt && now,
       updatedAt: history.updatedAt ?? now,
       revision,

[NoCoverage] LogicalOperator
src/integrity/run-init.ts:61:18
     const record = {
       entityId,
       createdAt: history.createdAt ?? now,
-      updatedAt: history.updatedAt ?? now,
+      updatedAt: history.updatedAt && now,
       revision,
       contentHash: hash,

[NoCoverage] LogicalOperator
src/integrity/run-init.ts:64:15
       updatedAt: history.updatedAt ?? now,
       revision,
       contentHash: hash,
-      gitSha: history.lastCommitSha ?? "unknown",
+      gitSha: history.lastCommitSha && "unknown",
       status: "active" as const,
     };

[NoCoverage] StringLiteral
src/integrity/run-init.ts:64:40
       updatedAt: history.updatedAt ?? now,
       revision,
       contentHash: hash,
-      gitSha: history.lastCommitSha ?? "unknown",
+      gitSha: history.lastCommitSha ?? "",
       status: "active" as const,
     };

[NoCoverage] LogicalOperator
src/integrity/run-init.ts:70:22
 
     const repoDir = path.posix.dirname(file);
     const fileName = getManifestFileName(file);
-    const manifest = manifests.get(repoDir) ?? createEmptyManifest(repoDir);
+    const manifest = manifests.get(repoDir) && createEmptyManifest(repoDir);
     upsertManifestRecord(manifest, fileName, record);
     manifests.set(repoDir, manifest);

[NoCoverage] CallExpression
src/integrity/run-init.ts:71:5
     const repoDir = path.posix.dirname(file);
     const fileName = getManifestFileName(file);
     const manifest = manifests.get(repoDir) ?? createEmptyManifest(repoDir);
-    upsertManifestRecord(manifest, fileName, record);
+    ;
     manifests.set(repoDir, manifest);
 

[NoCoverage] CallExpression
src/integrity/run-init.ts:72:5
     const fileName = getManifestFileName(file);
     const manifest = manifests.get(repoDir) ?? createEmptyManifest(repoDir);
     upsertManifestRecord(manifest, fileName, record);
-    manifests.set(repoDir, manifest);
+    ;
 
     entities[entityId] = {

[NoCoverage] ObjectLiteral
src/integrity/run-init.ts:74:26
     upsertManifestRecord(manifest, fileName, record);
     manifests.set(repoDir, manifest);
 
-    entities[entityId] = {
-      currentPath: file,
-      firstPath: file,
-      createdAt: record.createdAt,
-      updatedAt: record.updatedAt,
-      revision: record.revision,
-      contentHash: record.contentHash,
-      gitSha: record.gitSha,
-      status: "active",
-      moves: [],
-    };
+    entities[entityId] = {};
     paths[file] = entityId;
   }

[NoCoverage] StringLiteral
src/integrity/run-init.ts:82:15
       revision: record.revision,
       contentHash: record.contentHash,
       gitSha: record.gitSha,
-      status: "active",
+      status: "",
       moves: [],
     };

[NoCoverage] ArrayDeclaration
src/integrity/run-init.ts:83:14
       contentHash: record.contentHash,
       gitSha: record.gitSha,
       status: "active",
-      moves: [],
+      moves: ["Stryker was here"],
     };
     paths[file] = entityId;

[NoCoverage] BlockStatement
src/integrity/run-init.ts:88:41
     paths[file] = entityId;
   }
 
-  for (const repoDir of grouped.keys()) {
-    const manifest = manifests.get(repoDir);
-    if (manifest) await saveDirectoryManifest(cwd, manifest);
-  }
+  for (const repoDir of grouped.keys()) {}
 
   await saveEntitiesById(cwd, entities);

[NoCoverage] ConditionalExpression
src/integrity/run-init.ts:90:9
 
   for (const repoDir of grouped.keys()) {
     const manifest = manifests.get(repoDir);
-    if (manifest) await saveDirectoryManifest(cwd, manifest);
+    if (true) await saveDirectoryManifest(cwd, manifest);
   }
 

[NoCoverage] ConditionalExpression
src/integrity/run-init.ts:90:9
 
   for (const repoDir of grouped.keys()) {
     const manifest = manifests.get(repoDir);
-    if (manifest) await saveDirectoryManifest(cwd, manifest);
+    if (false) await saveDirectoryManifest(cwd, manifest);
   }
 

[NoCoverage] StringLiteral
src/integrity/run-init.ts:98:15
   await writeJsonFile(deletedLogPath(cwd), []);
 
   console.log("");
-  console.log("Integrity init");
+  console.log("");
   console.log(`  managed files       ${files.length}`);
   console.log(`  managed directories ${grouped.size}`);

[NoCoverage] StringLiteral
src/integrity/run-init.ts:100:15
   console.log("");
   console.log("Integrity init");
   console.log(`  managed files       ${files.length}`);
-  console.log(`  managed directories ${grouped.size}`);
+  console.log(``);
   console.log(`  registered entities ${Object.keys(entities).length}`);
 }
