[NoCoverage] BlockStatement
src/integrity/run-record-build.ts:28:19
   cwd: string;
   builder?: string;
   distDir?: string;
-}): Promise<void> {
-  const outputs = await collectBuildOutputs(args.cwd, args.distDir);
-  const provenance = await createBuildProvenance({
-    cwd: args.cwd,
-    builder: args.builder ?? "local",
-    outputs,
-  });
-  await writeBuildArtifacts({ cwd: args.cwd, outputs, provenance });
-
-  console.log("");
-  console.log("Integrity build record");
-  console.log(`  build id ${outputs.buildId}`);
-  console.log(`  outputs  ${Object.keys(outputs.outputs).length}`);
-  console.log(`  builder  ${provenance.builder}`);
-}
+}): Promise<void> {}
 

[NoCoverage] LogicalOperator
src/integrity/run-record-build.ts:32:14
   const outputs = await collectBuildOutputs(args.cwd, args.distDir);
   const provenance = await createBuildProvenance({
     cwd: args.cwd,
-    builder: args.builder ?? "local",
+    builder: args.builder && "local",
     outputs,
   });

[NoCoverage] StringLiteral
src/integrity/run-record-build.ts:39:15
 
   console.log("");
   console.log("Integrity build record");
-  console.log(`  build id ${outputs.buildId}`);
+  console.log(``);
   console.log(`  outputs  ${Object.keys(outputs.outputs).length}`);
   console.log(`  builder  ${provenance.builder}`);
