[NoCoverage] BlockStatement
src/integrity/run-update.ts:60:23
   entities: EntitiesById;
   paths: PathsCurrent;
   currentManagedFiles: string[];
-}): Promise<string[]> {
-  const { cwd, entities, paths, currentManagedFiles } = args;
-  const outOfSyncPaths: string[] = [];
-
-  for (const repoPath of currentManagedFiles) {
-    const entityId = paths[repoPath];
-    if (!entityId) {
-      continue;
-    }
-
-    const entity = entities[entityId];
-    if (!entity || entity.status !== "active") {
-      continue;
-    }
-
-    const actualHash = await byteHashFile(path.join(cwd, repoPath)).catch(() => null);
-    if (!actualHash || actualHash === entity.contentHash) {
-      continue;
-    }
-
-    outOfSyncPaths.push(repoPath);
-  }
-
-  return outOfSyncPaths;
-}
+}): Promise<string[]> {}
 
 function entityToManifestRecord(entityId: string, entity: RegistryEntity): ManifestFileRecord {

[NoCoverage] ArrayDeclaration
src/integrity/run-update.ts:62:36
   currentManagedFiles: string[];
 }): Promise<string[]> {
   const { cwd, entities, paths, currentManagedFiles } = args;
-  const outOfSyncPaths: string[] = [];
+  const outOfSyncPaths: string[] = ["Stryker was here"];
 
   for (const repoPath of currentManagedFiles) {

[NoCoverage] BlockStatement
src/integrity/run-update.ts:64:47
   const { cwd, entities, paths, currentManagedFiles } = args;
   const outOfSyncPaths: string[] = [];
 
-  for (const repoPath of currentManagedFiles) {
-    const entityId = paths[repoPath];
-    if (!entityId) {
-      continue;
-    }
-
-    const entity = entities[entityId];
-    if (!entity || entity.status !== "active") {
-      continue;
-    }
-
-    const actualHash = await byteHashFile(path.join(cwd, repoPath)).catch(() => null);
-    if (!actualHash || actualHash === entity.contentHash) {
-      continue;
-    }
-
-    outOfSyncPaths.push(repoPath);
-  }
+  for (const repoPath of currentManagedFiles) {}
 
   return outOfSyncPaths;

[NoCoverage] BooleanLiteral
src/integrity/run-update.ts:66:9
 
   for (const repoPath of currentManagedFiles) {
     const entityId = paths[repoPath];
-    if (!entityId) {
+    if (entityId) {
       continue;
     }

[NoCoverage] ConditionalExpression
src/integrity/run-update.ts:66:9
 
   for (const repoPath of currentManagedFiles) {
     const entityId = paths[repoPath];
-    if (!entityId) {
+    if (true) {
       continue;
     }

[NoCoverage] ConditionalExpression
src/integrity/run-update.ts:71:9
     }
 
     const entity = entities[entityId];
-    if (!entity || entity.status !== "active") {
+    if (true) {
       continue;
     }

[NoCoverage] BlockStatement
src/integrity/run-update.ts:71:48
     }
 
     const entity = entities[entityId];
-    if (!entity || entity.status !== "active") {
-      continue;
-    }
+    if (!entity || entity.status !== "active") {}
 
     const actualHash = await byteHashFile(path.join(cwd, repoPath)).catch(() => null);

[NoCoverage] ArrowFunction
src/integrity/run-update.ts:75:75
       continue;
     }
 
-    const actualHash = await byteHashFile(path.join(cwd, repoPath)).catch(() => null);
+    const actualHash = await byteHashFile(path.join(cwd, repoPath)).catch(() => undefined);
     if (!actualHash || actualHash === entity.contentHash) {
       continue;

[NoCoverage] ConditionalExpression
src/integrity/run-update.ts:76:9
     }
 
     const actualHash = await byteHashFile(path.join(cwd, repoPath)).catch(() => null);
-    if (!actualHash || actualHash === entity.contentHash) {
+    if (true) {
       continue;
     }

[NoCoverage] BlockStatement
src/integrity/run-update.ts:76:59
     }
 
     const actualHash = await byteHashFile(path.join(cwd, repoPath)).catch(() => null);
-    if (!actualHash || actualHash === entity.contentHash) {
-      continue;
-    }
+    if (!actualHash || actualHash === entity.contentHash) {}
 
     outOfSyncPaths.push(repoPath);

[NoCoverage] CallExpression
src/integrity/run-update.ts:80:5
       continue;
     }
 
-    outOfSyncPaths.push(repoPath);
+    ;
   }
 

[NoCoverage] BlockStatement
src/integrity/run-update.ts:86:95
   return outOfSyncPaths;
 }
 
-function entityToManifestRecord(entityId: string, entity: RegistryEntity): ManifestFileRecord {
-  return {
-    entityId,
-    createdAt: entity.createdAt,
-    updatedAt: entity.updatedAt,
-    revision: entity.revision,
-    contentHash: entity.contentHash,
-    gitSha: entity.gitSha,
-    status: entity.status,
-  };
-}
+function entityToManifestRecord(entityId: string, entity: RegistryEntity): ManifestFileRecord {}
 
 async function loadDeletedLog(cwd: string): Promise<DeletedLogItem[]> {

[NoCoverage] BlockStatement
src/integrity/run-update.ts:98:71
   };
 }
 
-async function loadDeletedLog(cwd: string): Promise<DeletedLogItem[]> {
-  return readJsonFile<DeletedLogItem[]>(deletedLogPath(cwd)).catch(() => []);
-}
+async function loadDeletedLog(cwd: string): Promise<DeletedLogItem[]> {}
 
 function createManifestStore(cwd: string) {

[NoCoverage] ArrowFunction
src/integrity/run-update.ts:99:68
 }
 
 async function loadDeletedLog(cwd: string): Promise<DeletedLogItem[]> {
-  return readJsonFile<DeletedLogItem[]>(deletedLogPath(cwd)).catch(() => []);
+  return readJsonFile<DeletedLogItem[]>(deletedLogPath(cwd)).catch(() => undefined);
 }
 

[NoCoverage] ArrayDeclaration
src/integrity/run-update.ts:99:74
 }
 
 async function loadDeletedLog(cwd: string): Promise<DeletedLogItem[]> {
-  return readJsonFile<DeletedLogItem[]>(deletedLogPath(cwd)).catch(() => []);
+  return readJsonFile<DeletedLogItem[]>(deletedLogPath(cwd)).catch(() => ["Stryker was here"]);
 }
 

[NoCoverage] BlockStatement
src/integrity/run-update.ts:102:43
   return readJsonFile<DeletedLogItem[]>(deletedLogPath(cwd)).catch(() => []);
 }
 
-function createManifestStore(cwd: string) {
-  const cache = new Map<string, DirectoryManifest>();
-
-  return {
-    async get(repoDir: string): Promise<DirectoryManifest> {
-      const existing = cache.get(repoDir);
-      if (existing) return existing;
-      const loaded = (await loadDirectoryManifest(cwd, repoDir)) ?? createEmptyManifest(repoDir);
-      cache.set(repoDir, loaded);
-      return loaded;
-    },
-    async saveAll(): Promise<void> {
-      for (const manifest of cache.values()) {
-        await saveDirectoryManifest(cwd, manifest);
-      }
-    },
-  };
-}
+function createManifestStore(cwd: string) {}
 
 async function moveEntity(args: {

[NoCoverage] BlockStatement
src/integrity/run-update.ts:106:60
   const cache = new Map<string, DirectoryManifest>();
 
   return {
-    async get(repoDir: string): Promise<DirectoryManifest> {
-      const existing = cache.get(repoDir);
-      if (existing) return existing;
-      const loaded = (await loadDirectoryManifest(cwd, repoDir)) ?? createEmptyManifest(repoDir);
-      cache.set(repoDir, loaded);
-      return loaded;
-    },
+    async get(repoDir: string): Promise<DirectoryManifest> {},
     async saveAll(): Promise<void> {
       for (const manifest of cache.values()) {

[NoCoverage] ConditionalExpression
src/integrity/run-update.ts:108:11
   return {
     async get(repoDir: string): Promise<DirectoryManifest> {
       const existing = cache.get(repoDir);
-      if (existing) return existing;
+      if (true) return existing;
       const loaded = (await loadDirectoryManifest(cwd, repoDir)) ?? createEmptyManifest(repoDir);
       cache.set(repoDir, loaded);

[NoCoverage] ConditionalExpression
src/integrity/run-update.ts:108:11
   return {
     async get(repoDir: string): Promise<DirectoryManifest> {
       const existing = cache.get(repoDir);
-      if (existing) return existing;
+      if (false) return existing;
       const loaded = (await loadDirectoryManifest(cwd, repoDir)) ?? createEmptyManifest(repoDir);
       cache.set(repoDir, loaded);

[NoCoverage] LogicalOperator
src/integrity/run-update.ts:109:22
     async get(repoDir: string): Promise<DirectoryManifest> {
       const existing = cache.get(repoDir);
       if (existing) return existing;
-      const loaded = (await loadDirectoryManifest(cwd, repoDir)) ?? createEmptyManifest(repoDir);
+      const loaded = (await loadDirectoryManifest(cwd, repoDir)) && createEmptyManifest(repoDir);
       cache.set(repoDir, loaded);
       return loaded;

[NoCoverage] CallExpression
src/integrity/run-update.ts:110:7
       const existing = cache.get(repoDir);
       if (existing) return existing;
       const loaded = (await loadDirectoryManifest(cwd, repoDir)) ?? createEmptyManifest(repoDir);
-      cache.set(repoDir, loaded);
+      ;
       return loaded;
     },

[NoCoverage] BlockStatement
src/integrity/run-update.ts:113:36
       cache.set(repoDir, loaded);
       return loaded;
     },
-    async saveAll(): Promise<void> {
-      for (const manifest of cache.values()) {
-        await saveDirectoryManifest(cwd, manifest);
-      }
-    },
+    async saveAll(): Promise<void> {},
   };
 }

[NoCoverage] BlockStatement
src/integrity/run-update.ts:114:46
       return loaded;
     },
     async saveAll(): Promise<void> {
-      for (const manifest of cache.values()) {
-        await saveDirectoryManifest(cwd, manifest);
-      }
+      for (const manifest of cache.values()) {}
     },
   };

[NoCoverage] ConditionalExpression
src/integrity/run-update.ts:130:7
 }): Promise<void> {
   const { cwd, entities, paths, manifestStore, move } = args;
   const entity = entities[move.entityId];
-  if (!entity) return;
+  if (false) return;
 
   const oldPath = move.from;

[NoCoverage] BooleanLiteral
src/integrity/run-update.ts:130:7
 }): Promise<void> {
   const { cwd, entities, paths, manifestStore, move } = args;
   const entity = entities[move.entityId];
-  if (!entity) return;
+  if (entity) return;
 
   const oldPath = move.from;

[NoCoverage] ArrowFunction
src/integrity/run-update.ts:136:57
   const newPath = move.to;
   const oldHash = entity.contentHash;
   const absNewPath = path.join(cwd, newPath);
-  const nextHash = await byteHashFile(absNewPath).catch(() => oldHash);
+  const nextHash = await byteHashFile(absNewPath).catch(() => undefined);
   const history = await getFileHistory(cwd, newPath);
   const now = new Date().toISOString();

[NoCoverage] ConditionalExpression
src/integrity/run-update.ts:139:27
   const nextHash = await byteHashFile(absNewPath).catch(() => oldHash);
   const history = await getFileHistory(cwd, newPath);
   const now = new Date().toISOString();
-  const isContentChange = nextHash !== oldHash;
+  const isContentChange = false;
 
   entity.currentPath = newPath;

[NoCoverage] EqualityOperator
src/integrity/run-update.ts:139:27
   const nextHash = await byteHashFile(absNewPath).catch(() => oldHash);
   const history = await getFileHistory(cwd, newPath);
   const now = new Date().toISOString();
-  const isContentChange = nextHash !== oldHash;
+  const isContentChange = nextHash === oldHash;
 
   entity.currentPath = newPath;

[NoCoverage] StringLiteral
src/integrity/run-update.ts:142:19
   const isContentChange = nextHash !== oldHash;
 
   entity.currentPath = newPath;
-  entity.status = "active";
+  entity.status = "";
   entity.gitSha = history.lastCommitSha ?? entity.gitSha;
 

[NoCoverage] LogicalOperator
src/integrity/run-update.ts:143:19
 
   entity.currentPath = newPath;
   entity.status = "active";
-  entity.gitSha = history.lastCommitSha ?? entity.gitSha;
+  entity.gitSha = history.lastCommitSha && entity.gitSha;
 
   if (isContentChange) {

[NoCoverage] ConditionalExpression
src/integrity/run-update.ts:145:7
   entity.status = "active";
   entity.gitSha = history.lastCommitSha ?? entity.gitSha;
 
-  if (isContentChange) {
+  if (true) {
     entity.contentHash = nextHash;
     entity.updatedAt = history.updatedAt ?? now;

[NoCoverage] BlockStatement
src/integrity/run-update.ts:145:24
   entity.status = "active";
   entity.gitSha = history.lastCommitSha ?? entity.gitSha;
 
-  if (isContentChange) {
-    entity.contentHash = nextHash;
-    entity.updatedAt = history.updatedAt ?? now;
-    entity.revision += 1;
-  }
+  if (isContentChange) {}
 
   entity.moves = entity.moves ?? [];

[NoCoverage] LogicalOperator
src/integrity/run-update.ts:147:24
 
   if (isContentChange) {
     entity.contentHash = nextHash;
-    entity.updatedAt = history.updatedAt ?? now;
+    entity.updatedAt = history.updatedAt && now;
     entity.revision += 1;
   }

[NoCoverage] AssignmentOperator
src/integrity/run-update.ts:148:5
   if (isContentChange) {
     entity.contentHash = nextHash;
     entity.updatedAt = history.updatedAt ?? now;
-    entity.revision += 1;
+    entity.revision -= 1;
   }
 

[NoCoverage] LogicalOperator
src/integrity/run-update.ts:151:18
     entity.revision += 1;
   }
 
-  entity.moves = entity.moves ?? [];
+  entity.moves = entity.moves && [];
   entity.moves.push({
     from: oldPath,

[NoCoverage] ObjectLiteral
src/integrity/run-update.ts:152:21
   }
 
   entity.moves = entity.moves ?? [];
-  entity.moves.push({
-    from: oldPath,
-    to: newPath,
-    detectedAt: now,
-    confidence: move.confidence,
-    method: move.method,
-  });
+  entity.moves.push({});
 
   delete paths[oldPath];

[NoCoverage] CallExpression
src/integrity/run-update.ts:169:3
   const newFileName = getManifestFileName(newPath);
 
   const oldManifest = await manifestStore.get(oldDir);
-  removeManifestRecord(oldManifest, oldFileName);
+  ;
 
   const newManifest = await manifestStore.get(newDir);

[NoCoverage] CallExpression
src/integrity/run-update.ts:172:3
   removeManifestRecord(oldManifest, oldFileName);
 
   const newManifest = await manifestStore.get(newDir);
-  upsertManifestRecord(newManifest, newFileName, entityToManifestRecord(move.entityId, entity));
+  ;
 }
 

[NoCoverage] BlockStatement
src/integrity/run-update.ts:181:19
   deletedLog: DeletedLogItem[];
   manifestStore: ReturnType<typeof createManifestStore>;
   repoPath: string;
-}): Promise<void> {
-  const { entities, paths, deletedLog, manifestStore, repoPath } = args;
-  const entityId = paths[repoPath];
-  if (!entityId) return;
-  const entity = entities[entityId];
-  if (!entity) return;
-
-  entity.status = "deleted";
-  delete paths[repoPath];
-
-  deletedLog.push({
-    entityId,
-    lastPath: repoPath,
-    deletedAt: new Date().toISOString(),
-    lastRevision: entity.revision,
-    lastHash: entity.contentHash,
-  });
-
-  const repoDir = path.posix.dirname(repoPath);
-  const fileName = getManifestFileName(repoPath);
-  const manifest = await manifestStore.get(repoDir);
-  removeManifestRecord(manifest, fileName);
-}
+}): Promise<void> {}
 
 async function addNewEntity(args: {

[NoCoverage] ConditionalExpression
src/integrity/run-update.ts:184:7
 }): Promise<void> {
   const { entities, paths, deletedLog, manifestStore, repoPath } = args;
   const entityId = paths[repoPath];
-  if (!entityId) return;
+  if (false) return;
   const entity = entities[entityId];
   if (!entity) return;

[NoCoverage] BooleanLiteral
src/integrity/run-update.ts:184:7
 }): Promise<void> {
   const { entities, paths, deletedLog, manifestStore, repoPath } = args;
   const entityId = paths[repoPath];
-  if (!entityId) return;
+  if (entityId) return;
   const entity = entities[entityId];
   if (!entity) return;

[NoCoverage] ConditionalExpression
src/integrity/run-update.ts:186:7
   const entityId = paths[repoPath];
   if (!entityId) return;
   const entity = entities[entityId];
-  if (!entity) return;
+  if (false) return;
 
   entity.status = "deleted";

[NoCoverage] BooleanLiteral
src/integrity/run-update.ts:186:7
   const entityId = paths[repoPath];
   if (!entityId) return;
   const entity = entities[entityId];
-  if (!entity) return;
+  if (entity) return;
 
   entity.status = "deleted";

[NoCoverage] CallExpression
src/integrity/run-update.ts:202:3
   const repoDir = path.posix.dirname(repoPath);
   const fileName = getManifestFileName(repoPath);
   const manifest = await manifestStore.get(repoDir);
-  removeManifestRecord(manifest, fileName);
+  ;
 }
 

[NoCoverage] LogicalOperator
src/integrity/run-update.ts:222:16
   entities[entityId] = {
     currentPath: repoPath,
     firstPath: repoPath,
-    createdAt: history.createdAt ?? now,
+    createdAt: history.createdAt && now,
     updatedAt: history.updatedAt ?? now,
     revision: 1,

[NoCoverage] CallExpression
src/integrity/run-update.ts:236:3
   const repoDir = path.posix.dirname(repoPath);
   const fileName = getManifestFileName(repoPath);
   const manifest = await manifestStore.get(repoDir);
-  upsertManifestRecord(manifest, fileName, entityToManifestRecord(entityId, entities[entityId]));
+  ;
 }
 

[NoCoverage] BlockStatement
src/integrity/run-update.ts:245:19
   paths: PathsCurrent;
   manifestStore: ReturnType<typeof createManifestStore>;
   repoPath: string;
-}): Promise<void> {
-  const { cwd, entities, paths, manifestStore, repoPath } = args;
-  const entityId = paths[repoPath];
-  if (!entityId) return;
-  const entity = entities[entityId];
-  if (!entity || entity.status !== "active") return;
-
-  const absPath = path.join(cwd, repoPath);
-  const nextHash = await byteHashFile(absPath);
-  if (nextHash === entity.contentHash) return;
-
-  const history = await getFileHistory(cwd, repoPath);
-  entity.contentHash = nextHash;
-  entity.updatedAt = history.updatedAt ?? new Date().toISOString();
-  entity.gitSha = history.lastCommitSha ?? entity.gitSha;
-  entity.revision += 1;
-
-  const repoDir = path.posix.dirname(repoPath);
-  const fileName = getManifestFileName(repoPath);
-  const manifest = await manifestStore.get(repoDir);
-  upsertManifestRecord(manifest, fileName, entityToManifestRecord(entityId, entity));
-}
+}): Promise<void> {}
 
 export async function runUpdate(args: { cwd: string; baseRef?: string }): Promise<void> {

[NoCoverage] ConditionalExpression
src/integrity/run-update.ts:248:7
 }): Promise<void> {
   const { cwd, entities, paths, manifestStore, repoPath } = args;
   const entityId = paths[repoPath];
-  if (!entityId) return;
+  if (true) return;
   const entity = entities[entityId];
   if (!entity || entity.status !== "active") return;

[NoCoverage] ConditionalExpression
src/integrity/run-update.ts:250:18
   const entityId = paths[repoPath];
   if (!entityId) return;
   const entity = entities[entityId];
-  if (!entity || entity.status !== "active") return;
+  if (!entity || false) return;
 
   const absPath = path.join(cwd, repoPath);

[NoCoverage] ConditionalExpression
src/integrity/run-update.ts:250:7
   const entityId = paths[repoPath];
   if (!entityId) return;
   const entity = entities[entityId];
-  if (!entity || entity.status !== "active") return;
+  if (true) return;
 
   const absPath = path.join(cwd, repoPath);

[NoCoverage] EqualityOperator
src/integrity/run-update.ts:254:7
 
   const absPath = path.join(cwd, repoPath);
   const nextHash = await byteHashFile(absPath);
-  if (nextHash === entity.contentHash) return;
+  if (nextHash !== entity.contentHash) return;
 
   const history = await getFileHistory(cwd, repoPath);

[NoCoverage] ConditionalExpression
src/integrity/run-update.ts:254:7
 
   const absPath = path.join(cwd, repoPath);
   const nextHash = await byteHashFile(absPath);
-  if (nextHash === entity.contentHash) return;
+  if (false) return;
 
   const history = await getFileHistory(cwd, repoPath);

[NoCoverage] LogicalOperator
src/integrity/run-update.ts:258:22
 
   const history = await getFileHistory(cwd, repoPath);
   entity.contentHash = nextHash;
-  entity.updatedAt = history.updatedAt ?? new Date().toISOString();
+  entity.updatedAt = history.updatedAt && new Date().toISOString();
   entity.gitSha = history.lastCommitSha ?? entity.gitSha;
   entity.revision += 1;

[NoCoverage] LogicalOperator
src/integrity/run-update.ts:259:19
   const history = await getFileHistory(cwd, repoPath);
   entity.contentHash = nextHash;
   entity.updatedAt = history.updatedAt ?? new Date().toISOString();
-  entity.gitSha = history.lastCommitSha ?? entity.gitSha;
+  entity.gitSha = history.lastCommitSha && entity.gitSha;
   entity.revision += 1;
 

[NoCoverage] AssignmentOperator
src/integrity/run-update.ts:260:3
   entity.contentHash = nextHash;
   entity.updatedAt = history.updatedAt ?? new Date().toISOString();
   entity.gitSha = history.lastCommitSha ?? entity.gitSha;
-  entity.revision += 1;
+  entity.revision -= 1;
 
   const repoDir = path.posix.dirname(repoPath);

[NoCoverage] CallExpression
src/integrity/run-update.ts:265:3
   const repoDir = path.posix.dirname(repoPath);
   const fileName = getManifestFileName(repoPath);
   const manifest = await manifestStore.get(repoDir);
-  upsertManifestRecord(manifest, fileName, entityToManifestRecord(entityId, entity));
+  ;
 }
 

[NoCoverage] MethodExpression
src/integrity/run-update.ts:285:23
     currentManagedFiles,
   });
 
-  const activePaths = Object.entries(paths)
-    .filter(([, entityId]) => entities[entityId]?.status === "active")
+  const activePaths = Object.entries(paths)
     .map(([repoPath]) => repoPath)
     .sort((a, b) => a.localeCompare(b));

[NoCoverage] MethodExpression
src/integrity/run-update.ts:285:23
     currentManagedFiles,
   });
 
-  const activePaths = Object.entries(paths)
-    .filter(([, entityId]) => entities[entityId]?.status === "active")
-    .map(([repoPath]) => repoPath)
-    .sort((a, b) => a.localeCompare(b));
+  const activePaths = Object.entries(paths).filter(([, entityId]) => entities[entityId]?.status === "active").map(([repoPath]) => repoPath);
 
   const deletedCandidates = uniqueSorted([

[NoCoverage] EqualityOperator
src/integrity/run-update.ts:286:31
   });
 
   const activePaths = Object.entries(paths)
-    .filter(([, entityId]) => entities[entityId]?.status === "active")
+    .filter(([, entityId]) => entities[entityId]?.status !== "active")
     .map(([repoPath]) => repoPath)
     .sort((a, b) => a.localeCompare(b));

[NoCoverage] OptionalChaining
src/integrity/run-update.ts:286:31
   });
 
   const activePaths = Object.entries(paths)
-    .filter(([, entityId]) => entities[entityId]?.status === "active")
+    .filter(([, entityId]) => entities[entityId].status === "active")
     .map(([repoPath]) => repoPath)
     .sort((a, b) => a.localeCompare(b));

[NoCoverage] ArrowFunction
src/integrity/run-update.ts:287:10
 
   const activePaths = Object.entries(paths)
     .filter(([, entityId]) => entities[entityId]?.status === "active")
-    .map(([repoPath]) => repoPath)
+    .map(() => undefined)
     .sort((a, b) => a.localeCompare(b));
 

[NoCoverage] ArrowFunction
src/integrity/run-update.ts:288:11
   const activePaths = Object.entries(paths)
     .filter(([, entityId]) => entities[entityId]?.status === "active")
     .map(([repoPath]) => repoPath)
-    .sort((a, b) => a.localeCompare(b));
+    .sort(() => undefined);
 
   const deletedCandidates = uniqueSorted([

[NoCoverage] MethodExpression
src/integrity/run-update.ts:290:29
     .map(([repoPath]) => repoPath)
     .sort((a, b) => a.localeCompare(b));
 
-  const deletedCandidates = uniqueSorted([
-    ...changes.deleted,
-    ...activePaths.filter((repoPath) => !currentManagedSet.has(repoPath)),
-  ]).filter((repoPath) => paths[repoPath]);
+  const deletedCandidates = uniqueSorted([...changes.deleted, ...activePaths.filter(repoPath => !currentManagedSet.has(repoPath))]);
 
   const addedCandidates = uniqueSorted([

[NoCoverage] ArrayDeclaration
src/integrity/run-update.ts:290:42
     .map(([repoPath]) => repoPath)
     .sort((a, b) => a.localeCompare(b));
 
-  const deletedCandidates = uniqueSorted([
-    ...changes.deleted,
-    ...activePaths.filter((repoPath) => !currentManagedSet.has(repoPath)),
-  ]).filter((repoPath) => paths[repoPath]);
+  const deletedCandidates = uniqueSorted([]).filter((repoPath) => paths[repoPath]);
 
   const addedCandidates = uniqueSorted([

[NoCoverage] MethodExpression
src/integrity/run-update.ts:292:8
 
   const deletedCandidates = uniqueSorted([
     ...changes.deleted,
-    ...activePaths.filter((repoPath) => !currentManagedSet.has(repoPath)),
+    ...activePaths,
   ]).filter((repoPath) => paths[repoPath]);
 

[NoCoverage] BooleanLiteral
src/integrity/run-update.ts:292:41
 
   const deletedCandidates = uniqueSorted([
     ...changes.deleted,
-    ...activePaths.filter((repoPath) => !currentManagedSet.has(repoPath)),
+    ...activePaths.filter((repoPath) => currentManagedSet.has(repoPath)),
   ]).filter((repoPath) => paths[repoPath]);
 

[NoCoverage] ArrowFunction
src/integrity/run-update.ts:293:13
   const deletedCandidates = uniqueSorted([
     ...changes.deleted,
     ...activePaths.filter((repoPath) => !currentManagedSet.has(repoPath)),
-  ]).filter((repoPath) => paths[repoPath]);
+  ]).filter(() => undefined);
 
   const addedCandidates = uniqueSorted([

[NoCoverage] MethodExpression
src/integrity/run-update.ts:295:27
     ...activePaths.filter((repoPath) => !currentManagedSet.has(repoPath)),
   ]).filter((repoPath) => paths[repoPath]);
 
-  const addedCandidates = uniqueSorted([
-    ...changes.added,
-    ...currentManagedFiles.filter((repoPath) => !paths[repoPath]),
-  ]).filter((repoPath) => currentManagedSet.has(repoPath));
+  const addedCandidates = uniqueSorted([...changes.added, ...currentManagedFiles.filter(repoPath => !paths[repoPath])]);
 
   const modifiedCandidates = uniqueSorted([

[NoCoverage] ArrowFunction
src/integrity/run-update.ts:297:35
 
   const addedCandidates = uniqueSorted([
     ...changes.added,
-    ...currentManagedFiles.filter((repoPath) => !paths[repoPath]),
+    ...currentManagedFiles.filter(() => undefined),
   ]).filter((repoPath) => currentManagedSet.has(repoPath));
 

[NoCoverage] BooleanLiteral
src/integrity/run-update.ts:297:49
 
   const addedCandidates = uniqueSorted([
     ...changes.added,
-    ...currentManagedFiles.filter((repoPath) => !paths[repoPath]),
+    ...currentManagedFiles.filter((repoPath) => paths[repoPath]),
   ]).filter((repoPath) => currentManagedSet.has(repoPath));
 

[NoCoverage] ArrowFunction
src/integrity/run-update.ts:298:13
   const addedCandidates = uniqueSorted([
     ...changes.added,
     ...currentManagedFiles.filter((repoPath) => !paths[repoPath]),
-  ]).filter((repoPath) => currentManagedSet.has(repoPath));
+  ]).filter(() => undefined);
 
   const modifiedCandidates = uniqueSorted([

[NoCoverage] MethodExpression
src/integrity/run-update.ts:300:30
     ...currentManagedFiles.filter((repoPath) => !paths[repoPath]),
   ]).filter((repoPath) => currentManagedSet.has(repoPath));
 
-  const modifiedCandidates = uniqueSorted([
-    ...changes.modified,
-    ...changes.renamed.map((item) => item.to),
-    ...outOfSyncActivePaths,
-  ]).filter((repoPath) => currentManagedSet.has(repoPath) && Boolean(paths[repoPath]));
+  const modifiedCandidates = uniqueSorted([...changes.modified, ...changes.renamed.map(item => item.to), ...outOfSyncActivePaths]);
 
   const matchedDeleted = new Set<string>();

[NoCoverage] ArrowFunction
src/integrity/run-update.ts:302:28
 
   const modifiedCandidates = uniqueSorted([
     ...changes.modified,
-    ...changes.renamed.map((item) => item.to),
+    ...changes.renamed.map(() => undefined),
     ...outOfSyncActivePaths,
   ]).filter((repoPath) => currentManagedSet.has(repoPath) && Boolean(paths[repoPath]));

[NoCoverage] ConditionalExpression
src/integrity/run-update.ts:304:27
     ...changes.modified,
     ...changes.renamed.map((item) => item.to),
     ...outOfSyncActivePaths,
-  ]).filter((repoPath) => currentManagedSet.has(repoPath) && Boolean(paths[repoPath]));
+  ]).filter((repoPath) => true);
 
   const matchedDeleted = new Set<string>();

[NoCoverage] LogicalOperator
src/integrity/run-update.ts:304:27
     ...changes.modified,
     ...changes.renamed.map((item) => item.to),
     ...outOfSyncActivePaths,
-  ]).filter((repoPath) => currentManagedSet.has(repoPath) && Boolean(paths[repoPath]));
+  ]).filter((repoPath) => currentManagedSet.has(repoPath) || Boolean(paths[repoPath]));
 
   const matchedDeleted = new Set<string>();

[NoCoverage] MethodExpression
src/integrity/run-update.ts:309:42
   const matchedDeleted = new Set<string>();
   const matchedAdded = new Set<string>();
 
-  const explicitMoves: MoveCandidate[] = changes.renamed
-    .filter(({ from, to }) => Boolean(paths[from]) && currentManagedSet.has(to))
+  const explicitMoves: MoveCandidate[] = changes.renamed
     .map(({ from, to }) => ({
       entityId: paths[from],

[NoCoverage] ConditionalExpression
src/integrity/run-update.ts:310:31
   const matchedAdded = new Set<string>();
 
   const explicitMoves: MoveCandidate[] = changes.renamed
-    .filter(({ from, to }) => Boolean(paths[from]) && currentManagedSet.has(to))
+    .filter(({ from, to }) => false)
     .map(({ from, to }) => ({
       entityId: paths[from],

[NoCoverage] ArrowFunction
src/integrity/run-update.ts:310:13
   const matchedAdded = new Set<string>();
 
   const explicitMoves: MoveCandidate[] = changes.renamed
-    .filter(({ from, to }) => Boolean(paths[from]) && currentManagedSet.has(to))
+    .filter(() => undefined)
     .map(({ from, to }) => ({
       entityId: paths[from],

[NoCoverage] ArrowFunction
src/integrity/run-update.ts:311:10
 
   const explicitMoves: MoveCandidate[] = changes.renamed
     .filter(({ from, to }) => Boolean(paths[from]) && currentManagedSet.has(to))
-    .map(({ from, to }) => ({
-      entityId: paths[from],
-      from,
-      to,
-      confidence: 1,
-      method: "heuristic",
-    }));
+    .map(() => undefined);
 
   for (const move of explicitMoves) {

[NoCoverage] ObjectLiteral
src/integrity/run-update.ts:311:29
 
   const explicitMoves: MoveCandidate[] = changes.renamed
     .filter(({ from, to }) => Boolean(paths[from]) && currentManagedSet.has(to))
-    .map(({ from, to }) => ({
-      entityId: paths[from],
-      from,
-      to,
-      confidence: 1,
-      method: "heuristic",
-    }));
+    .map(({ from, to }) => ({}));
 
   for (const move of explicitMoves) {
