[NoCoverage] BlockStatement
src/integrity/run-update.ts:319:37
       method: "heuristic",
     }));
 
-  for (const move of explicitMoves) {
-    if (matchedDeleted.has(move.from) || matchedAdded.has(move.to)) continue;
-    await moveEntity({ cwd, entities, paths, manifestStore, move });
-    matchedDeleted.add(move.from);
-    matchedAdded.add(move.to);
-  }
+  for (const move of explicitMoves) {}
 
   const inferredMoves = await detectMoves({

[NoCoverage] ConditionalExpression
src/integrity/run-update.ts:320:9
     }));
 
   for (const move of explicitMoves) {
-    if (matchedDeleted.has(move.from) || matchedAdded.has(move.to)) continue;
+    if (false) continue;
     await moveEntity({ cwd, entities, paths, manifestStore, move });
     matchedDeleted.add(move.from);

[NoCoverage] LogicalOperator
src/integrity/run-update.ts:320:9
     }));
 
   for (const move of explicitMoves) {
-    if (matchedDeleted.has(move.from) || matchedAdded.has(move.to)) continue;
+    if (matchedDeleted.has(move.from) && matchedAdded.has(move.to)) continue;
     await moveEntity({ cwd, entities, paths, manifestStore, move });
     matchedDeleted.add(move.from);

[NoCoverage] ObjectLiteral
src/integrity/run-update.ts:321:22
 
   for (const move of explicitMoves) {
     if (matchedDeleted.has(move.from) || matchedAdded.has(move.to)) continue;
-    await moveEntity({ cwd, entities, paths, manifestStore, move });
+    await moveEntity({});
     matchedDeleted.add(move.from);
     matchedAdded.add(move.to);

[NoCoverage] CallExpression
src/integrity/run-update.ts:322:5
   for (const move of explicitMoves) {
     if (matchedDeleted.has(move.from) || matchedAdded.has(move.to)) continue;
     await moveEntity({ cwd, entities, paths, manifestStore, move });
-    matchedDeleted.add(move.from);
+    ;
     matchedAdded.add(move.to);
   }

[NoCoverage] CallExpression
src/integrity/run-update.ts:323:5
     if (matchedDeleted.has(move.from) || matchedAdded.has(move.to)) continue;
     await moveEntity({ cwd, entities, paths, manifestStore, move });
     matchedDeleted.add(move.from);
-    matchedAdded.add(move.to);
+    ;
   }
 

[NoCoverage] ArrowFunction
src/integrity/run-update.ts:328:44
 
   const inferredMoves = await detectMoves({
     cwd,
-    deletedPaths: deletedCandidates.filter((repoPath) => !matchedDeleted.has(repoPath)),
+    deletedPaths: deletedCandidates.filter(() => undefined),
     addedPaths: addedCandidates.filter((repoPath) => !matchedAdded.has(repoPath)),
   });

[NoCoverage] BooleanLiteral
src/integrity/run-update.ts:328:58
 
   const inferredMoves = await detectMoves({
     cwd,
-    deletedPaths: deletedCandidates.filter((repoPath) => !matchedDeleted.has(repoPath)),
+    deletedPaths: deletedCandidates.filter((repoPath) => matchedDeleted.has(repoPath)),
     addedPaths: addedCandidates.filter((repoPath) => !matchedAdded.has(repoPath)),
   });

[NoCoverage] BooleanLiteral
src/integrity/run-update.ts:329:54
   const inferredMoves = await detectMoves({
     cwd,
     deletedPaths: deletedCandidates.filter((repoPath) => !matchedDeleted.has(repoPath)),
-    addedPaths: addedCandidates.filter((repoPath) => !matchedAdded.has(repoPath)),
+    addedPaths: addedCandidates.filter((repoPath) => matchedAdded.has(repoPath)),
   });
 

[NoCoverage] MethodExpression
src/integrity/run-update.ts:329:17
   const inferredMoves = await detectMoves({
     cwd,
     deletedPaths: deletedCandidates.filter((repoPath) => !matchedDeleted.has(repoPath)),
-    addedPaths: addedCandidates.filter((repoPath) => !matchedAdded.has(repoPath)),
+    addedPaths: addedCandidates,
   });
 

[NoCoverage] BlockStatement
src/integrity/run-update.ts:332:37
     addedPaths: addedCandidates.filter((repoPath) => !matchedAdded.has(repoPath)),
   });
 
-  for (const move of inferredMoves) {
-    if (matchedDeleted.has(move.from) || matchedAdded.has(move.to)) continue;
-    await moveEntity({ cwd, entities, paths, manifestStore, move });
-    matchedDeleted.add(move.from);
-    matchedAdded.add(move.to);
-  }
+  for (const move of inferredMoves) {}
 
   for (const repoPath of deletedCandidates) {

[NoCoverage] ConditionalExpression
src/integrity/run-update.ts:333:9
   });
 
   for (const move of inferredMoves) {
-    if (matchedDeleted.has(move.from) || matchedAdded.has(move.to)) continue;
+    if (false) continue;
     await moveEntity({ cwd, entities, paths, manifestStore, move });
     matchedDeleted.add(move.from);

[NoCoverage] LogicalOperator
src/integrity/run-update.ts:333:9
   });
 
   for (const move of inferredMoves) {
-    if (matchedDeleted.has(move.from) || matchedAdded.has(move.to)) continue;
+    if (matchedDeleted.has(move.from) && matchedAdded.has(move.to)) continue;
     await moveEntity({ cwd, entities, paths, manifestStore, move });
     matchedDeleted.add(move.from);

[NoCoverage] BlockStatement
src/integrity/run-update.ts:339:45
     matchedAdded.add(move.to);
   }
 
-  for (const repoPath of deletedCandidates) {
-    if (matchedDeleted.has(repoPath)) continue;
-    await markDeleted({ entities, paths, deletedLog, manifestStore, repoPath });
-  }
+  for (const repoPath of deletedCandidates) {}
 
   for (const repoPath of addedCandidates) {

[NoCoverage] ConditionalExpression
src/integrity/run-update.ts:340:9
   }
 
   for (const repoPath of deletedCandidates) {
-    if (matchedDeleted.has(repoPath)) continue;
+    if (false) continue;
     await markDeleted({ entities, paths, deletedLog, manifestStore, repoPath });
   }

[NoCoverage] ConditionalExpression
src/integrity/run-update.ts:340:9
   }
 
   for (const repoPath of deletedCandidates) {
-    if (matchedDeleted.has(repoPath)) continue;
+    if (true) continue;
     await markDeleted({ entities, paths, deletedLog, manifestStore, repoPath });
   }

[NoCoverage] BlockStatement
src/integrity/run-update.ts:344:43
     await markDeleted({ entities, paths, deletedLog, manifestStore, repoPath });
   }
 
-  for (const repoPath of addedCandidates) {
-    if (matchedAdded.has(repoPath)) continue;
-    await addNewEntity({ cwd, entities, paths, manifestStore, repoPath });
-  }
+  for (const repoPath of addedCandidates) {}
 
   for (const repoPath of modifiedCandidates) {

[NoCoverage] ConditionalExpression
src/integrity/run-update.ts:345:9
   }
 
   for (const repoPath of addedCandidates) {
-    if (matchedAdded.has(repoPath)) continue;
+    if (true) continue;
     await addNewEntity({ cwd, entities, paths, manifestStore, repoPath });
   }

[NoCoverage] ConditionalExpression
src/integrity/run-update.ts:345:9
   }
 
   for (const repoPath of addedCandidates) {
-    if (matchedAdded.has(repoPath)) continue;
+    if (false) continue;
     await addNewEntity({ cwd, entities, paths, manifestStore, repoPath });
   }

[NoCoverage] BlockStatement
src/integrity/run-update.ts:349:46
     await addNewEntity({ cwd, entities, paths, manifestStore, repoPath });
   }
 
-  for (const repoPath of modifiedCandidates) {
-    if (!paths[repoPath]) continue;
-    await updateModifiedEntity({ cwd, entities, paths, manifestStore, repoPath });
-  }
+  for (const repoPath of modifiedCandidates) {}
 
   await manifestStore.saveAll();

[NoCoverage] ConditionalExpression
src/integrity/run-update.ts:350:9
   }
 
   for (const repoPath of modifiedCandidates) {
-    if (!paths[repoPath]) continue;
+    if (true) continue;
     await updateModifiedEntity({ cwd, entities, paths, manifestStore, repoPath });
   }

[NoCoverage] ConditionalExpression
src/integrity/run-update.ts:350:9
   }
 
   for (const repoPath of modifiedCandidates) {
-    if (!paths[repoPath]) continue;
+    if (false) continue;
     await updateModifiedEntity({ cwd, entities, paths, manifestStore, repoPath });
   }

[NoCoverage] ObjectLiteral
src/integrity/run-update.ts:351:32
 
   for (const repoPath of modifiedCandidates) {
     if (!paths[repoPath]) continue;
-    await updateModifiedEntity({ cwd, entities, paths, manifestStore, repoPath });
+    await updateModifiedEntity({});
   }
 

[NoCoverage] LogicalOperator
src/integrity/run-update.ts:361:30
 
   console.log("");
   console.log("Integrity update");
-  console.log(`  base ref  ${baseRef ?? "(working tree)"}`);
+  console.log(`  base ref  ${baseRef && "(working tree)"}`);
   console.log(`  added     ${addedCandidates.length - matchedAdded.size}`);
   console.log(`  deleted   ${deletedCandidates.length - matchedDeleted.size}`);

[NoCoverage] ArithmeticOperator
src/integrity/run-update.ts:362:30
   console.log("");
   console.log("Integrity update");
   console.log(`  base ref  ${baseRef ?? "(working tree)"}`);
-  console.log(`  added     ${addedCandidates.length - matchedAdded.size}`);
+  console.log(`  added     ${addedCandidates.length + matchedAdded.size}`);
   console.log(`  deleted   ${deletedCandidates.length - matchedDeleted.size}`);
   console.log(`  moved     ${matchedAdded.size}`);

[NoCoverage] ArithmeticOperator
src/integrity/run-update.ts:363:30
   console.log("Integrity update");
   console.log(`  base ref  ${baseRef ?? "(working tree)"}`);
   console.log(`  added     ${addedCandidates.length - matchedAdded.size}`);
-  console.log(`  deleted   ${deletedCandidates.length - matchedDeleted.size}`);
+  console.log(`  deleted   ${deletedCandidates.length + matchedDeleted.size}`);
   console.log(`  moved     ${matchedAdded.size}`);
   console.log(`  modified  ${modifiedCandidates.length}`);
