[NoCoverage] BlockStatement
src/integrity/run-verify.ts:25:50
 import { verifyIntegrity } from "./verify.ts";
 import type { VerifyIssue, VerifyReport } from "./types.ts";
 
-function formatIssue(issue: VerifyIssue): string {
-  const prefix = issue.level === "error" ? "[ERROR]" : "[WARN ]";
-  const location = [issue.path, issue.entityId].filter(Boolean).join(" | ");
-  return `${prefix} ${issue.code}: ${issue.message}${location ? ` [${location}]` : ""}`;
-}
+function formatIssue(issue: VerifyIssue): string {}
 
 function printSummary(report: VerifyReport): void {

[NoCoverage] EqualityOperator
src/integrity/run-verify.ts:26:18
 import type { VerifyIssue, VerifyReport } from "./types.ts";
 
 function formatIssue(issue: VerifyIssue): string {
-  const prefix = issue.level === "error" ? "[ERROR]" : "[WARN ]";
+  const prefix = issue.level !== "error" ? "[ERROR]" : "[WARN ]";
   const location = [issue.path, issue.entityId].filter(Boolean).join(" | ");
   return `${prefix} ${issue.code}: ${issue.message}${location ? ` [${location}]` : ""}`;

[NoCoverage] ConditionalExpression
src/integrity/run-verify.ts:26:18
 import type { VerifyIssue, VerifyReport } from "./types.ts";
 
 function formatIssue(issue: VerifyIssue): string {
-  const prefix = issue.level === "error" ? "[ERROR]" : "[WARN ]";
+  const prefix = true ? "[ERROR]" : "[WARN ]";
   const location = [issue.path, issue.entityId].filter(Boolean).join(" | ");
   return `${prefix} ${issue.code}: ${issue.message}${location ? ` [${location}]` : ""}`;

[NoCoverage] MethodExpression
src/integrity/run-verify.ts:27:20
 
 function formatIssue(issue: VerifyIssue): string {
   const prefix = issue.level === "error" ? "[ERROR]" : "[WARN ]";
-  const location = [issue.path, issue.entityId].filter(Boolean).join(" | ");
+  const location = [issue.path, issue.entityId].join(" | ");
   return `${prefix} ${issue.code}: ${issue.message}${location ? ` [${location}]` : ""}`;
 }

[NoCoverage] ArrayDeclaration
src/integrity/run-verify.ts:27:20
 
 function formatIssue(issue: VerifyIssue): string {
   const prefix = issue.level === "error" ? "[ERROR]" : "[WARN ]";
-  const location = [issue.path, issue.entityId].filter(Boolean).join(" | ");
+  const location = [].filter(Boolean).join(" | ");
   return `${prefix} ${issue.code}: ${issue.message}${location ? ` [${location}]` : ""}`;
 }

[NoCoverage] StringLiteral
src/integrity/run-verify.ts:28:10
 function formatIssue(issue: VerifyIssue): string {
   const prefix = issue.level === "error" ? "[ERROR]" : "[WARN ]";
   const location = [issue.path, issue.entityId].filter(Boolean).join(" | ");
-  return `${prefix} ${issue.code}: ${issue.message}${location ? ` [${location}]` : ""}`;
+  return ``;
 }
 

[NoCoverage] BlockStatement
src/integrity/run-verify.ts:31:51
   return `${prefix} ${issue.code}: ${issue.message}${location ? ` [${location}]` : ""}`;
 }
 
-function printSummary(report: VerifyReport): void {
-  const { stats } = report;
-  console.log("");
-  console.log("Integrity summary");
-  console.log(`  managed files       ${stats.managedFiles}`);
-  console.log(`  managed directories ${stats.managedDirectories}`);
-  console.log(`  manifests loaded    ${stats.manifestsLoaded}`);
-  console.log(`  active entities     ${stats.activeEntities}`);
-  console.log(`  path bindings       ${stats.activePathBindings}`);
-  console.log(`  errors              ${stats.errors}`);
-  console.log(`  warnings            ${stats.warnings}`);
-}
+function printSummary(report: VerifyReport): void {}
 
 export async function runVerify(args: { cwd: string }): Promise<VerifyReport> {

[NoCoverage] StringLiteral
src/integrity/run-verify.ts:34:15
 function printSummary(report: VerifyReport): void {
   const { stats } = report;
   console.log("");
-  console.log("Integrity summary");
+  console.log("");
   console.log(`  managed files       ${stats.managedFiles}`);
   console.log(`  managed directories ${stats.managedDirectories}`);

[NoCoverage] StringLiteral
src/integrity/run-verify.ts:39:15
   console.log(`  managed directories ${stats.managedDirectories}`);
   console.log(`  manifests loaded    ${stats.manifestsLoaded}`);
   console.log(`  active entities     ${stats.activeEntities}`);
-  console.log(`  path bindings       ${stats.activePathBindings}`);
+  console.log(``);
   console.log(`  errors              ${stats.errors}`);
   console.log(`  warnings            ${stats.warnings}`);

[NoCoverage] StringLiteral
src/integrity/run-verify.ts:40:15
   console.log(`  manifests loaded    ${stats.manifestsLoaded}`);
   console.log(`  active entities     ${stats.activeEntities}`);
   console.log(`  path bindings       ${stats.activePathBindings}`);
-  console.log(`  errors              ${stats.errors}`);
+  console.log(``);
   console.log(`  warnings            ${stats.warnings}`);
 }

[NoCoverage] BlockStatement
src/integrity/run-verify.ts:44:79
   console.log(`  warnings            ${stats.warnings}`);
 }
 
-export async function runVerify(args: { cwd: string }): Promise<VerifyReport> {
-  const report = await verifyIntegrity(args.cwd);
-
-  console.log("");
-  console.log("Integrity verification report");
-
-  for (const issue of report.issues) {
-    console.error(formatIssue(issue));
-  }
-
-  printSummary(report);
-
-  if (report.ok) {
-    console.log("");
-    console.log("Integrity verification passed.");
-  } else {
-    console.log("");
-    console.error("Integrity verification failed.");
-  }
-
-  return report;
-}
+export async function runVerify(args: { cwd: string }): Promise<VerifyReport> {}
 

[NoCoverage] BlockStatement
src/integrity/run-verify.ts:50:38
   console.log("");
   console.log("Integrity verification report");
 
-  for (const issue of report.issues) {
-    console.error(formatIssue(issue));
-  }
+  for (const issue of report.issues) {}
 
   printSummary(report);

[NoCoverage] CallExpression
src/integrity/run-verify.ts:51:5
   console.log("Integrity verification report");
 
   for (const issue of report.issues) {
-    console.error(formatIssue(issue));
+    ;
   }
 

[NoCoverage] CallExpression
src/integrity/run-verify.ts:54:3
     console.error(formatIssue(issue));
   }
 
-  printSummary(report);
+  ;
 
   if (report.ok) {

[NoCoverage] ConditionalExpression
src/integrity/run-verify.ts:56:7
 
   printSummary(report);
 
-  if (report.ok) {
+  if (false) {
     console.log("");
     console.log("Integrity verification passed.");

[NoCoverage] BlockStatement
src/integrity/run-verify.ts:56:18
 
   printSummary(report);
 
-  if (report.ok) {
-    console.log("");
-    console.log("Integrity verification passed.");
-  } else {
+  if (report.ok) {} else {
     console.log("");
     console.error("Integrity verification failed.");

[NoCoverage] BlockStatement
src/integrity/run-verify.ts:59:10
   if (report.ok) {
     console.log("");
     console.log("Integrity verification passed.");
-  } else {
-    console.log("");
-    console.error("Integrity verification failed.");
-  }
+  } else {}
 
   return report;

[NoCoverage] StringLiteral
src/integrity/run-verify.ts:60:17
     console.log("");
     console.log("Integrity verification passed.");
   } else {
-    console.log("");
+    console.log("Stryker was here!");
     console.error("Integrity verification failed.");
   }

[NoCoverage] StringLiteral
src/integrity/run-verify.ts:61:19
     console.log("Integrity verification passed.");
   } else {
     console.log("");
-    console.error("Integrity verification failed.");
+    console.error("");
   }
 
