[NoCoverage] BlockStatement
src/integrity/schema-validation.ts:59:11
 
 function formatAjvErrors(
   errors: Array<{ instancePath?: string; message?: string }> | null | undefined,
-): string {
-  if (!errors?.length) return "schema validation failed";
-  return errors
-    .map((error) => `${error.instancePath || "/"} ${error.message ?? "is invalid"}`.trim())
-    .join("; ");
-}
+): string {}
 
 async function tryLoadAjv(): Promise<LoadedAjv | null> {

[NoCoverage] OptionalChaining
src/integrity/schema-validation.ts:60:8
 function formatAjvErrors(
   errors: Array<{ instancePath?: string; message?: string }> | null | undefined,
 ): string {
-  if (!errors?.length) return "schema validation failed";
+  if (!errors.length) return "schema validation failed";
   return errors
     .map((error) => `${error.instancePath || "/"} ${error.message ?? "is invalid"}`.trim())

[NoCoverage] ConditionalExpression
src/integrity/schema-validation.ts:60:7
 function formatAjvErrors(
   errors: Array<{ instancePath?: string; message?: string }> | null | undefined,
 ): string {
-  if (!errors?.length) return "schema validation failed";
+  if (true) return "schema validation failed";
   return errors
     .map((error) => `${error.instancePath || "/"} ${error.message ?? "is invalid"}`.trim())

[NoCoverage] MethodExpression
src/integrity/schema-validation.ts:62:21
 ): string {
   if (!errors?.length) return "schema validation failed";
   return errors
-    .map((error) => `${error.instancePath || "/"} ${error.message ?? "is invalid"}`.trim())
+    .map((error) => `${error.instancePath || "/"} ${error.message ?? "is invalid"}`)
     .join("; ");
 }

[NoCoverage] LogicalOperator
src/integrity/schema-validation.ts:62:24
 ): string {
   if (!errors?.length) return "schema validation failed";
   return errors
-    .map((error) => `${error.instancePath || "/"} ${error.message ?? "is invalid"}`.trim())
+    .map((error) => `${error.instancePath && "/"} ${error.message ?? "is invalid"}`.trim())
     .join("; ");
 }

[NoCoverage] BlockStatement
src/integrity/schema-validation.ts:66:56
     .join("; ");
 }
 
-async function tryLoadAjv(): Promise<LoadedAjv | null> {
-  try {
-    const [{ default: Ajv2020 }, addFormatsModule] = await Promise.all([
-      import("ajv/dist/2020.js"),
-      import("ajv-formats"),
-    ]);
-
-    const ajv = new Ajv2020({ allErrors: true, strict: false }) as AjvLike;
-    const addFormats = (addFormatsModule.default ?? addFormatsModule) as unknown as (
-      ajv: AjvLike,
-    ) => void;
-    addFormats(ajv);
-
-    return { ajv, addFormats };
-  } catch {
-    return null;
-  }
-}
+async function tryLoadAjv(): Promise<LoadedAjv | null> {}
 
 async function loadValidator(

[NoCoverage] BlockStatement
src/integrity/schema-validation.ts:67:7
 }
 
 async function tryLoadAjv(): Promise<LoadedAjv | null> {
-  try {
-    const [{ default: Ajv2020 }, addFormatsModule] = await Promise.all([
-      import("ajv/dist/2020.js"),
-      import("ajv-formats"),
-    ]);
-
-    const ajv = new Ajv2020({ allErrors: true, strict: false }) as AjvLike;
-    const addFormats = (addFormatsModule.default ?? addFormatsModule) as unknown as (
-      ajv: AjvLike,
-    ) => void;
-    addFormats(ajv);
-
-    return { ajv, addFormats };
-  } catch {
+  try {} catch {
     return null;
   }

[NoCoverage] ArrayDeclaration
src/integrity/schema-validation.ts:68:72
 
 async function tryLoadAjv(): Promise<LoadedAjv | null> {
   try {
-    const [{ default: Ajv2020 }, addFormatsModule] = await Promise.all([
-      import("ajv/dist/2020.js"),
-      import("ajv-formats"),
-    ]);
+    const [{ default: Ajv2020 }, addFormatsModule] = await Promise.all([]);
 
     const ajv = new Ajv2020({ allErrors: true, strict: false }) as AjvLike;

[NoCoverage] CallExpression
src/integrity/schema-validation.ts:77:5
     const addFormats = (addFormatsModule.default ?? addFormatsModule) as unknown as (
       ajv: AjvLike,
     ) => void;
-    addFormats(ajv);
+    ;
 
     return { ajv, addFormats };

[NoCoverage] ObjectLiteral
src/integrity/schema-validation.ts:79:12
     ) => void;
     addFormats(ajv);
 
-    return { ajv, addFormats };
+    return {};
   } catch {
     return null;

[NoCoverage] BlockStatement
src/integrity/schema-validation.ts:80:11
     addFormats(ajv);
 
     return { ajv, addFormats };
-  } catch {
-    return null;
-  }
+  } catch {}
 }
 

[NoCoverage] BlockStatement
src/integrity/schema-validation.ts:89:33
   ajv: AjvLike,
   root: string,
   schemaFile: string,
-): Promise<AjvValidateFunction> {
-  const schema = await readJsonFile<object>(`${root}/${schemaFile}`);
-  return ajv.compile(schema);
-}
+): Promise<AjvValidateFunction> {}
 
 export async function validateIntegrityJsonSchemas(cwd: string): Promise<VerifyIssue[]> {

[NoCoverage] StringLiteral
src/integrity/schema-validation.ts:90:45
   root: string,
   schemaFile: string,
 ): Promise<AjvValidateFunction> {
-  const schema = await readJsonFile<object>(`${root}/${schemaFile}`);
+  const schema = await readJsonFile<object>(``);
   return ajv.compile(schema);
 }

[NoCoverage] ConditionalExpression
src/integrity/schema-validation.ts:99:7
   const root = schemaDir(cwd);
   const loadedAjv = await tryLoadAjv();
 
-  if (!loadedAjv) {
+  if (false) {
     issues.push({
       level: "warning",

[NoCoverage] ConditionalExpression
src/integrity/schema-validation.ts:99:7
   const root = schemaDir(cwd);
   const loadedAjv = await tryLoadAjv();
 
-  if (!loadedAjv) {
+  if (true) {
     issues.push({
       level: "warning",

[NoCoverage] ObjectLiteral
src/integrity/schema-validation.ts:100:17
   const loadedAjv = await tryLoadAjv();
 
   if (!loadedAjv) {
-    issues.push({
-      level: "warning",
-      code: "SCHEMA_VALIDATION_SKIPPED",
-      message:
-        "Ajv is not installed, so Draft 2020-12 schema validation was skipped. Structural verification is still active.",
-      path: ".integrity/schema",
-    });
+    issues.push({});
     return issues;
   }

[NoCoverage] StringLiteral
src/integrity/schema-validation.ts:113:5
   const { ajv } = loadedAjv;
 
   const validatorFiles = [
-    "policy.schema.json",
+    "",
     "entities.by-id.schema.json",
     "paths.current.schema.json",

[NoCoverage] BlockStatement
src/integrity/schema-validation.ts:123:44
   ];
 
   const validators = new Map<string, AjvValidateFunction>();
-  for (const schemaFile of validatorFiles) {
-    validators.set(schemaFile, await loadValidator(ajv, root, schemaFile));
-  }
+  for (const schemaFile of validatorFiles) {}
 
   const targets: SchemaTarget[] = [

[NoCoverage] CallExpression
src/integrity/schema-validation.ts:124:5
 
   const validators = new Map<string, AjvValidateFunction>();
   for (const schemaFile of validatorFiles) {
-    validators.set(schemaFile, await loadValidator(ajv, root, schemaFile));
+    ;
   }
 

[NoCoverage] StringLiteral
src/integrity/schema-validation.ts:131:18
     {
       schemaFile: "policy.schema.json",
       dataFile: policyPath(cwd),
-      pathLabel: ".integrity/config/policy.json",
+      pathLabel: "",
     },
     {

[NoCoverage] StringLiteral
src/integrity/schema-validation.ts:136:18
     {
       schemaFile: "entities.by-id.schema.json",
       dataFile: entitiesByIdPath(cwd),
-      pathLabel: ".integrity/index/entities.by-id.json",
+      pathLabel: "",
     },
     {

[NoCoverage] StringLiteral
src/integrity/schema-validation.ts:151:18
     {
       schemaFile: "outputs.schema.json",
       dataFile: outputsPath(cwd),
-      pathLabel: ".integrity/build/latest/outputs.json",
+      pathLabel: "",
       optional: true,
     },

[NoCoverage] BooleanLiteral
src/integrity/schema-validation.ts:152:17
       schemaFile: "outputs.schema.json",
       dataFile: outputsPath(cwd),
       pathLabel: ".integrity/build/latest/outputs.json",
-      optional: true,
+      optional: false,
     },
     {

[NoCoverage] BooleanLiteral
src/integrity/schema-validation.ts:158:17
       schemaFile: "build-provenance.schema.json",
       dataFile: provenancePath(cwd),
       pathLabel: ".integrity/build/latest/build-provenance.json",
-      optional: true,
+      optional: false,
     },
   ];

[NoCoverage] ArrowFunction
src/integrity/schema-validation.ts:162:67
     },
   ];
 
-  const managedDirs = await discoverManagedDirectories(cwd).catch(() => []);
+  const managedDirs = await discoverManagedDirectories(cwd).catch(() => undefined);
   for (const repoDir of managedDirs) {
     targets.push({

[NoCoverage] BlockStatement
src/integrity/schema-validation.ts:163:38
   ];
 
   const managedDirs = await discoverManagedDirectories(cwd).catch(() => []);
-  for (const repoDir of managedDirs) {
-    targets.push({
-      schemaFile: "manifest.schema.json",
-      dataFile: manifestPathForDirectory(cwd, repoDir),
-      pathLabel: `.integrity/manifests/${repoDir === "." ? "root" : repoDir}/versions.json`,
-    });
-  }
+  for (const repoDir of managedDirs) {}
 
   for (const target of targets) {

[NoCoverage] StringLiteral
src/integrity/schema-validation.ts:165:19
   const managedDirs = await discoverManagedDirectories(cwd).catch(() => []);
   for (const repoDir of managedDirs) {
     targets.push({
-      schemaFile: "manifest.schema.json",
+      schemaFile: "",
       dataFile: manifestPathForDirectory(cwd, repoDir),
       pathLabel: `.integrity/manifests/${repoDir === "." ? "root" : repoDir}/versions.json`,

[NoCoverage] ConditionalExpression
src/integrity/schema-validation.ts:167:42
     targets.push({
       schemaFile: "manifest.schema.json",
       dataFile: manifestPathForDirectory(cwd, repoDir),
-      pathLabel: `.integrity/manifests/${repoDir === "." ? "root" : repoDir}/versions.json`,
+      pathLabel: `.integrity/manifests/${false ? "root" : repoDir}/versions.json`,
     });
   }

[NoCoverage] ConditionalExpression
src/integrity/schema-validation.ts:167:42
     targets.push({
       schemaFile: "manifest.schema.json",
       dataFile: manifestPathForDirectory(cwd, repoDir),
-      pathLabel: `.integrity/manifests/${repoDir === "." ? "root" : repoDir}/versions.json`,
+      pathLabel: `.integrity/manifests/${true ? "root" : repoDir}/versions.json`,
     });
   }

[NoCoverage] BooleanLiteral
src/integrity/schema-validation.ts:173:9
 
   for (const target of targets) {
     const exists = await pathExists(target.dataFile);
-    if (!exists) {
+    if (exists) {
       if (target.optional) {
         continue;

[NoCoverage] ConditionalExpression
src/integrity/schema-validation.ts:173:9
 
   for (const target of targets) {
     const exists = await pathExists(target.dataFile);
-    if (!exists) {
+    if (true) {
       if (target.optional) {
         continue;

[NoCoverage] ConditionalExpression
src/integrity/schema-validation.ts:174:11
   for (const target of targets) {
     const exists = await pathExists(target.dataFile);
     if (!exists) {
-      if (target.optional) {
+      if (false) {
         continue;
       }

[NoCoverage] BlockStatement
src/integrity/schema-validation.ts:174:28
   for (const target of targets) {
     const exists = await pathExists(target.dataFile);
     if (!exists) {
-      if (target.optional) {
-        continue;
-      }
+      if (target.optional) {}
       issues.push({
         level: "error",

[NoCoverage] StringLiteral
src/integrity/schema-validation.ts:179:15
       }
       issues.push({
         level: "error",
-        code: "SCHEMA_TARGET_MISSING",
+        code: "",
         message: "Required integrity JSON file is missing",
         path: target.pathLabel,

[NoCoverage] StringLiteral
src/integrity/schema-validation.ts:180:18
       issues.push({
         level: "error",
         code: "SCHEMA_TARGET_MISSING",
-        message: "Required integrity JSON file is missing",
+        message: "",
         path: target.pathLabel,
       });

[NoCoverage] BlockStatement
src/integrity/schema-validation.ts:187:9
     }
 
     let data: unknown;
-    try {
-      data = await readJsonFile<unknown>(target.dataFile);
-    } catch (error) {
+    try {} catch (error) {
       issues.push({
         level: "error",

[NoCoverage] BlockStatement
src/integrity/schema-validation.ts:189:21
     let data: unknown;
     try {
       data = await readJsonFile<unknown>(target.dataFile);
-    } catch (error) {
-      issues.push({
-        level: "error",
-        code: "INVALID_JSON",
-        message: `Failed to parse JSON: ${error instanceof Error ? error.message : String(error)}`,
-        path: target.pathLabel,
-      });
-      continue;
-    }
+    } catch (error) {}
 
     const validator = validators.get(target.schemaFile);

[NoCoverage] StringLiteral
src/integrity/schema-validation.ts:192:15
     } catch (error) {
       issues.push({
         level: "error",
-        code: "INVALID_JSON",
+        code: "",
         message: `Failed to parse JSON: ${error instanceof Error ? error.message : String(error)}`,
         path: target.pathLabel,

[NoCoverage] StringLiteral
src/integrity/schema-validation.ts:193:18
       issues.push({
         level: "error",
         code: "INVALID_JSON",
-        message: `Failed to parse JSON: ${error instanceof Error ? error.message : String(error)}`,
+        message: ``,
         path: target.pathLabel,
       });

[NoCoverage] BlockStatement
src/integrity/schema-validation.ts:200:21
     }
 
     const validator = validators.get(target.schemaFile);
-    if (!validator) {
-      issues.push({
-        level: "error",
-        code: "SCHEMA_VALIDATOR_MISSING",
-        message: `Missing validator for ${target.schemaFile}`,
-        path: target.pathLabel,
-      });
-      continue;
-    }
+    if (!validator) {}
 
     if (!validator(data)) {

[NoCoverage] BooleanLiteral
src/integrity/schema-validation.ts:200:9
     }
 
     const validator = validators.get(target.schemaFile);
-    if (!validator) {
+    if (validator) {
       issues.push({
         level: "error",

[NoCoverage] ObjectLiteral
src/integrity/schema-validation.ts:201:19
 
     const validator = validators.get(target.schemaFile);
     if (!validator) {
-      issues.push({
-        level: "error",
-        code: "SCHEMA_VALIDATOR_MISSING",
-        message: `Missing validator for ${target.schemaFile}`,
-        path: target.pathLabel,
-      });
+      issues.push({});
       continue;
     }

[NoCoverage] StringLiteral
src/integrity/schema-validation.ts:202:16
     const validator = validators.get(target.schemaFile);
     if (!validator) {
       issues.push({
-        level: "error",
+        level: "",
         code: "SCHEMA_VALIDATOR_MISSING",
         message: `Missing validator for ${target.schemaFile}`,

[NoCoverage] ConditionalExpression
src/integrity/schema-validation.ts:210:9
       continue;
     }
 
-    if (!validator(data)) {
+    if (true) {
       issues.push({
         level: "error",

[NoCoverage] BooleanLiteral
src/integrity/schema-validation.ts:210:9
       continue;
     }
 
-    if (!validator(data)) {
+    if (validator(data)) {
       issues.push({
         level: "error",

[NoCoverage] ConditionalExpression
src/integrity/schema-validation.ts:221:7
   }
 
   const buildDirExists = await pathExists(buildLatestDir(cwd));
-  if (buildDirExists) {
+  if (false) {
     const hasOutputs = await pathExists(outputsPath(cwd));
     const hasProvenance = await pathExists(provenancePath(cwd));

[NoCoverage] BlockStatement
src/integrity/schema-validation.ts:221:23
   }
 
   const buildDirExists = await pathExists(buildLatestDir(cwd));
-  if (buildDirExists) {
-    const hasOutputs = await pathExists(outputsPath(cwd));
-    const hasProvenance = await pathExists(provenancePath(cwd));
-    if (hasOutputs !== hasProvenance) {
-      issues.push({
-        level: "error",
-        code: "INCOMPLETE_BUILD_LAYER",
-        message:
-          "Build layer is incomplete: outputs.json and build-provenance.json must exist together",
-        path: ".integrity/build/latest",
-      });
-    }
-  }
+  if (buildDirExists) {}
 
   return issues;

[NoCoverage] ConditionalExpression
src/integrity/schema-validation.ts:224:9
   if (buildDirExists) {
     const hasOutputs = await pathExists(outputsPath(cwd));
     const hasProvenance = await pathExists(provenancePath(cwd));
-    if (hasOutputs !== hasProvenance) {
+    if (true) {
       issues.push({
         level: "error",

[NoCoverage] EqualityOperator
src/integrity/schema-validation.ts:224:9
   if (buildDirExists) {
     const hasOutputs = await pathExists(outputsPath(cwd));
     const hasProvenance = await pathExists(provenancePath(cwd));
-    if (hasOutputs !== hasProvenance) {
+    if (hasOutputs === hasProvenance) {
       issues.push({
         level: "error",
