[NoCoverage] BlockStatement
src/integrity/verify.ts:36:48
   VerifyStats,
 } from "./types.ts";
 
-function isIsoDateTime(value: string): boolean {
-  if (!value) return false;
-  return !Number.isNaN(Date.parse(value));
-}
+function isIsoDateTime(value: string): boolean {}
 
 function isHexSha256(value: string): boolean {

[NoCoverage] ConditionalExpression
src/integrity/verify.ts:37:7
 } from "./types.ts";
 
 function isIsoDateTime(value: string): boolean {
-  if (!value) return false;
+  if (false) return false;
   return !Number.isNaN(Date.parse(value));
 }

[NoCoverage] ConditionalExpression
src/integrity/verify.ts:37:7
 } from "./types.ts";
 
 function isIsoDateTime(value: string): boolean {
-  if (!value) return false;
+  if (true) return false;
   return !Number.isNaN(Date.parse(value));
 }

[NoCoverage] BooleanLiteral
src/integrity/verify.ts:38:10
 
 function isIsoDateTime(value: string): boolean {
   if (!value) return false;
-  return !Number.isNaN(Date.parse(value));
+  return Number.isNaN(Date.parse(value));
 }
 

[NoCoverage] BlockStatement
src/integrity/verify.ts:41:46
   return !Number.isNaN(Date.parse(value));
 }
 
-function isHexSha256(value: string): boolean {
-  return /^sha256:[0-9a-f]{64}$/i.test(value);
-}
+function isHexSha256(value: string): boolean {}
 
 function pushIssue(

[NoCoverage] BlockStatement
src/integrity/verify.ts:51:9
   code: string,
   message: string,
   extras: Pick<VerifyIssue, "path" | "entityId"> = {},
-): void {
-  issues.push({ level, code, message, ...extras });
-}
+): void {}
 
 function validateRecordShape(

[NoCoverage] ConditionalExpression
src/integrity/verify.ts:62:7
   filePath: string,
   entityId?: string,
 ): void {
-  if (!isIsoDateTime(record.createdAt)) {
+  if (false) {
     pushIssue(issues, "error", "INVALID_CREATED_AT", `${scope} has invalid createdAt`, {
       path: filePath,

[NoCoverage] BlockStatement
src/integrity/verify.ts:62:41
   filePath: string,
   entityId?: string,
 ): void {
-  if (!isIsoDateTime(record.createdAt)) {
-    pushIssue(issues, "error", "INVALID_CREATED_AT", `${scope} has invalid createdAt`, {
-      path: filePath,
-      entityId,
-    });
-  }
+  if (!isIsoDateTime(record.createdAt)) {}
   if (!isIsoDateTime(record.updatedAt)) {
     pushIssue(issues, "error", "INVALID_UPDATED_AT", `${scope} has invalid updatedAt`, {

[NoCoverage] StringLiteral
src/integrity/verify.ts:63:54
   entityId?: string,
 ): void {
   if (!isIsoDateTime(record.createdAt)) {
-    pushIssue(issues, "error", "INVALID_CREATED_AT", `${scope} has invalid createdAt`, {
+    pushIssue(issues, "error", "INVALID_CREATED_AT", ``, {
       path: filePath,
       entityId,

[NoCoverage] ObjectLiteral
src/integrity/verify.ts:63:88
   entityId?: string,
 ): void {
   if (!isIsoDateTime(record.createdAt)) {
-    pushIssue(issues, "error", "INVALID_CREATED_AT", `${scope} has invalid createdAt`, {
-      path: filePath,
-      entityId,
-    });
+    pushIssue(issues, "error", "INVALID_CREATED_AT", `${scope} has invalid createdAt`, {});
   }
   if (!isIsoDateTime(record.updatedAt)) {

[NoCoverage] ConditionalExpression
src/integrity/verify.ts:68:7
       entityId,
     });
   }
-  if (!isIsoDateTime(record.updatedAt)) {
+  if (false) {
     pushIssue(issues, "error", "INVALID_UPDATED_AT", `${scope} has invalid updatedAt`, {
       path: filePath,

[NoCoverage] BlockStatement
src/integrity/verify.ts:68:41
       entityId,
     });
   }
-  if (!isIsoDateTime(record.updatedAt)) {
-    pushIssue(issues, "error", "INVALID_UPDATED_AT", `${scope} has invalid updatedAt`, {
-      path: filePath,
-      entityId,
-    });
-  }
+  if (!isIsoDateTime(record.updatedAt)) {}
   if (
     isIsoDateTime(record.createdAt) &&

[NoCoverage] StringLiteral
src/integrity/verify.ts:69:54
     });
   }
   if (!isIsoDateTime(record.updatedAt)) {
-    pushIssue(issues, "error", "INVALID_UPDATED_AT", `${scope} has invalid updatedAt`, {
+    pushIssue(issues, "error", "INVALID_UPDATED_AT", ``, {
       path: filePath,
       entityId,

[NoCoverage] LogicalOperator
src/integrity/verify.ts:75:5
     });
   }
   if (
-    isIsoDateTime(record.createdAt) &&
-    isIsoDateTime(record.updatedAt) &&
+    isIsoDateTime(record.createdAt) || isIsoDateTime(record.updatedAt) &&
     record.createdAt > record.updatedAt
   ) {

[NoCoverage] LogicalOperator
src/integrity/verify.ts:75:5
     });
   }
   if (
-    isIsoDateTime(record.createdAt) &&
-    isIsoDateTime(record.updatedAt) &&
-    record.createdAt > record.updatedAt
+    isIsoDateTime(record.createdAt) && isIsoDateTime(record.updatedAt) || record.createdAt > record.updatedAt
   ) {
     pushIssue(

[NoCoverage] EqualityOperator
src/integrity/verify.ts:77:5
   if (
     isIsoDateTime(record.createdAt) &&
     isIsoDateTime(record.updatedAt) &&
-    record.createdAt > record.updatedAt
+    record.createdAt >= record.updatedAt
   ) {
     pushIssue(

[NoCoverage] EqualityOperator
src/integrity/verify.ts:77:5
   if (
     isIsoDateTime(record.createdAt) &&
     isIsoDateTime(record.updatedAt) &&
-    record.createdAt > record.updatedAt
+    record.createdAt <= record.updatedAt
   ) {
     pushIssue(

[NoCoverage] BlockStatement
src/integrity/verify.ts:78:5
     isIsoDateTime(record.createdAt) &&
     isIsoDateTime(record.updatedAt) &&
     record.createdAt > record.updatedAt
-  ) {
-    pushIssue(
-      issues,
-      "error",
-      "INVALID_TIMESTAMP_ORDER",
-      `${scope} createdAt is greater than updatedAt`,
-      { path: filePath, entityId },
-    );
-  }
+  ) {}
   if (!Number.isInteger(record.revision) || record.revision < 1) {
     pushIssue(issues, "error", "INVALID_REVISION", `${scope} revision must be an integer >= 1`, {

[NoCoverage] StringLiteral
src/integrity/verify.ts:82:7
     pushIssue(
       issues,
       "error",
-      "INVALID_TIMESTAMP_ORDER",
+      "",
       `${scope} createdAt is greater than updatedAt`,
       { path: filePath, entityId },

[NoCoverage] ObjectLiteral
src/integrity/verify.ts:84:7
       "error",
       "INVALID_TIMESTAMP_ORDER",
       `${scope} createdAt is greater than updatedAt`,
-      { path: filePath, entityId },
+      {},
     );
   }

[NoCoverage] EqualityOperator
src/integrity/verify.ts:87:45
       { path: filePath, entityId },
     );
   }
-  if (!Number.isInteger(record.revision) || record.revision < 1) {
+  if (!Number.isInteger(record.revision) || record.revision <= 1) {
     pushIssue(issues, "error", "INVALID_REVISION", `${scope} revision must be an integer >= 1`, {
       path: filePath,

[NoCoverage] ConditionalExpression
src/integrity/verify.ts:87:7
       { path: filePath, entityId },
     );
   }
-  if (!Number.isInteger(record.revision) || record.revision < 1) {
+  if (true) {
     pushIssue(issues, "error", "INVALID_REVISION", `${scope} revision must be an integer >= 1`, {
       path: filePath,

[NoCoverage] ObjectLiteral
src/integrity/verify.ts:88:97
     );
   }
   if (!Number.isInteger(record.revision) || record.revision < 1) {
-    pushIssue(issues, "error", "INVALID_REVISION", `${scope} revision must be an integer >= 1`, {
-      path: filePath,
-      entityId,
-    });
+    pushIssue(issues, "error", "INVALID_REVISION", `${scope} revision must be an integer >= 1`, {});
   }
   if (!isHexSha256(record.contentHash)) {

[NoCoverage] StringLiteral
src/integrity/verify.ts:88:23
     );
   }
   if (!Number.isInteger(record.revision) || record.revision < 1) {
-    pushIssue(issues, "error", "INVALID_REVISION", `${scope} revision must be an integer >= 1`, {
+    pushIssue(issues, "", "INVALID_REVISION", `${scope} revision must be an integer >= 1`, {
       path: filePath,
       entityId,

[NoCoverage] BooleanLiteral
src/integrity/verify.ts:93:7
       entityId,
     });
   }
-  if (!isHexSha256(record.contentHash)) {
+  if (isHexSha256(record.contentHash)) {
     pushIssue(
       issues,

[NoCoverage] BlockStatement
src/integrity/verify.ts:93:41
       entityId,
     });
   }
-  if (!isHexSha256(record.contentHash)) {
-    pushIssue(
-      issues,
-      "error",
-      "INVALID_CONTENT_HASH",
-      `${scope} contentHash must match sha256:<64-hex>`,
-      { path: filePath, entityId },
-    );
-  }
+  if (!isHexSha256(record.contentHash)) {}
   if (!record.gitSha || record.gitSha.length < 7) {
     pushIssue(issues, "warning", "WEAK_GIT_SHA", `${scope} gitSha looks missing or too short`, {

[NoCoverage] StringLiteral
src/integrity/verify.ts:96:7
   if (!isHexSha256(record.contentHash)) {
     pushIssue(
       issues,
-      "error",
+      "",
       "INVALID_CONTENT_HASH",
       `${scope} contentHash must match sha256:<64-hex>`,

[NoCoverage] StringLiteral
src/integrity/verify.ts:97:7
     pushIssue(
       issues,
       "error",
-      "INVALID_CONTENT_HASH",
+      "",
       `${scope} contentHash must match sha256:<64-hex>`,
       { path: filePath, entityId },

[NoCoverage] StringLiteral
src/integrity/verify.ts:98:7
       issues,
       "error",
       "INVALID_CONTENT_HASH",
-      `${scope} contentHash must match sha256:<64-hex>`,
+      ``,
       { path: filePath, entityId },
     );

[NoCoverage] ObjectLiteral
src/integrity/verify.ts:99:7
       "error",
       "INVALID_CONTENT_HASH",
       `${scope} contentHash must match sha256:<64-hex>`,
-      { path: filePath, entityId },
+      {},
     );
   }

[NoCoverage] ConditionalExpression
src/integrity/verify.ts:102:25
       { path: filePath, entityId },
     );
   }
-  if (!record.gitSha || record.gitSha.length < 7) {
+  if (!record.gitSha || false) {
     pushIssue(issues, "warning", "WEAK_GIT_SHA", `${scope} gitSha looks missing or too short`, {
       path: filePath,

[NoCoverage] ConditionalExpression
src/integrity/verify.ts:102:7
       { path: filePath, entityId },
     );
   }
-  if (!record.gitSha || record.gitSha.length < 7) {
+  if (false) {
     pushIssue(issues, "warning", "WEAK_GIT_SHA", `${scope} gitSha looks missing or too short`, {
       path: filePath,

[NoCoverage] StringLiteral
src/integrity/verify.ts:103:34
     );
   }
   if (!record.gitSha || record.gitSha.length < 7) {
-    pushIssue(issues, "warning", "WEAK_GIT_SHA", `${scope} gitSha looks missing or too short`, {
+    pushIssue(issues, "warning", "", `${scope} gitSha looks missing or too short`, {
       path: filePath,
       entityId,

[NoCoverage] StringLiteral
src/integrity/verify.ts:103:50
     );
   }
   if (!record.gitSha || record.gitSha.length < 7) {
-    pushIssue(issues, "warning", "WEAK_GIT_SHA", `${scope} gitSha looks missing or too short`, {
+    pushIssue(issues, "warning", "WEAK_GIT_SHA", ``, {
       path: filePath,
       entityId,

[NoCoverage] ConditionalExpression
src/integrity/verify.ts:118:7
 ): void {
   const entityId = manifestRecord.entityId;
 
-  if (registryRecord.status !== "active") {
+  if (false) {
     pushIssue(
       issues,

[NoCoverage] BlockStatement
src/integrity/verify.ts:118:43
 ): void {
   const entityId = manifestRecord.entityId;
 
-  if (registryRecord.status !== "active") {
-    pushIssue(
-      issues,
-      "error",
-      "REGISTRY_ENTITY_NOT_ACTIVE",
-      "Registry entity for managed file is not active",
-      { path: repoPath, entityId },
-    );
-  }
+  if (registryRecord.status !== "active") {}
   if (registryRecord.currentPath !== repoPath) {
     pushIssue(

[NoCoverage] StringLiteral
src/integrity/verify.ts:122:7
     pushIssue(
       issues,
       "error",
-      "REGISTRY_ENTITY_NOT_ACTIVE",
+      "",
       "Registry entity for managed file is not active",
       { path: repoPath, entityId },

[NoCoverage] ObjectLiteral
src/integrity/verify.ts:124:7
       "error",
       "REGISTRY_ENTITY_NOT_ACTIVE",
       "Registry entity for managed file is not active",
-      { path: repoPath, entityId },
+      {},
     );
   }

[NoCoverage] EqualityOperator
src/integrity/verify.ts:127:7
       { path: repoPath, entityId },
     );
   }
-  if (registryRecord.currentPath !== repoPath) {
+  if (registryRecord.currentPath === repoPath) {
     pushIssue(
       issues,

[NoCoverage] BlockStatement
src/integrity/verify.ts:127:48
       { path: repoPath, entityId },
     );
   }
-  if (registryRecord.currentPath !== repoPath) {
-    pushIssue(
-      issues,
-      "error",
-      "CURRENT_PATH_MISMATCH",
-      "Registry currentPath does not match managed file path",
-      { path: repoPath, entityId },
-    );
-  }
+  if (registryRecord.currentPath !== repoPath) {}
   if (manifestRecord.status !== "active") {
     pushIssue(

[NoCoverage] EqualityOperator
src/integrity/verify.ts:136:7
       { path: repoPath, entityId },
     );
   }
-  if (manifestRecord.status !== "active") {
+  if (manifestRecord.status === "active") {
     pushIssue(
       issues,

[NoCoverage] BlockStatement
src/integrity/verify.ts:136:43
       { path: repoPath, entityId },
     );
   }
-  if (manifestRecord.status !== "active") {
-    pushIssue(
-      issues,
-      "error",
-      "MANIFEST_RECORD_NOT_ACTIVE",
-      "Manifest record for managed file is not active",
-      { path: repoPath, entityId },
-    );
-  }
+  if (manifestRecord.status !== "active") {}
   if (manifestRecord.createdAt !== registryRecord.createdAt) {
     pushIssue(issues, "error", "CREATED_AT_MISMATCH", "Manifest and registry createdAt differ", {

[NoCoverage] ObjectLiteral
src/integrity/verify.ts:142:7
       "error",
       "MANIFEST_RECORD_NOT_ACTIVE",
       "Manifest record for managed file is not active",
-      { path: repoPath, entityId },
+      {},
     );
   }

[NoCoverage] ConditionalExpression
src/integrity/verify.ts:145:7
       { path: repoPath, entityId },
     );
   }
-  if (manifestRecord.createdAt !== registryRecord.createdAt) {
+  if (false) {
     pushIssue(issues, "error", "CREATED_AT_MISMATCH", "Manifest and registry createdAt differ", {
       path: repoPath,

[NoCoverage] EqualityOperator
src/integrity/verify.ts:145:7
       { path: repoPath, entityId },
     );
   }
-  if (manifestRecord.createdAt !== registryRecord.createdAt) {
+  if (manifestRecord.createdAt === registryRecord.createdAt) {
     pushIssue(issues, "error", "CREATED_AT_MISMATCH", "Manifest and registry createdAt differ", {
       path: repoPath,

[NoCoverage] StringLiteral
src/integrity/verify.ts:146:23
     );
   }
   if (manifestRecord.createdAt !== registryRecord.createdAt) {
-    pushIssue(issues, "error", "CREATED_AT_MISMATCH", "Manifest and registry createdAt differ", {
+    pushIssue(issues, "", "CREATED_AT_MISMATCH", "Manifest and registry createdAt differ", {
       path: repoPath,
       entityId,

[NoCoverage] StringLiteral
src/integrity/verify.ts:146:32
     );
   }
   if (manifestRecord.createdAt !== registryRecord.createdAt) {
-    pushIssue(issues, "error", "CREATED_AT_MISMATCH", "Manifest and registry createdAt differ", {
+    pushIssue(issues, "error", "", "Manifest and registry createdAt differ", {
       path: repoPath,
       entityId,

[NoCoverage] BlockStatement
src/integrity/verify.ts:151:62
       entityId,
     });
   }
-  if (manifestRecord.updatedAt !== registryRecord.updatedAt) {
-    pushIssue(issues, "error", "UPDATED_AT_MISMATCH", "Manifest and registry updatedAt differ", {
-      path: repoPath,
-      entityId,
-    });
-  }
+  if (manifestRecord.updatedAt !== registryRecord.updatedAt) {}
   if (manifestRecord.revision !== registryRecord.revision) {
     pushIssue(issues, "error", "REVISION_MISMATCH", "Manifest and registry revision differ", {

[NoCoverage] EqualityOperator
src/integrity/verify.ts:151:7
       entityId,
     });
   }
-  if (manifestRecord.updatedAt !== registryRecord.updatedAt) {
+  if (manifestRecord.updatedAt === registryRecord.updatedAt) {
     pushIssue(issues, "error", "UPDATED_AT_MISMATCH", "Manifest and registry updatedAt differ", {
       path: repoPath,

[NoCoverage] StringLiteral
src/integrity/verify.ts:152:32
     });
   }
   if (manifestRecord.updatedAt !== registryRecord.updatedAt) {
-    pushIssue(issues, "error", "UPDATED_AT_MISMATCH", "Manifest and registry updatedAt differ", {
+    pushIssue(issues, "error", "", "Manifest and registry updatedAt differ", {
       path: repoPath,
       entityId,

[NoCoverage] EqualityOperator
src/integrity/verify.ts:157:7
       entityId,
     });
   }
-  if (manifestRecord.revision !== registryRecord.revision) {
+  if (manifestRecord.revision === registryRecord.revision) {
     pushIssue(issues, "error", "REVISION_MISMATCH", "Manifest and registry revision differ", {
       path: repoPath,

[NoCoverage] ConditionalExpression
src/integrity/verify.ts:157:7
       entityId,
     });
   }
-  if (manifestRecord.revision !== registryRecord.revision) {
+  if (true) {
     pushIssue(issues, "error", "REVISION_MISMATCH", "Manifest and registry revision differ", {
       path: repoPath,

[NoCoverage] ObjectLiteral
src/integrity/verify.ts:158:94
     });
   }
   if (manifestRecord.revision !== registryRecord.revision) {
-    pushIssue(issues, "error", "REVISION_MISMATCH", "Manifest and registry revision differ", {
-      path: repoPath,
-      entityId,
-    });
+    pushIssue(issues, "error", "REVISION_MISMATCH", "Manifest and registry revision differ", {});
   }
   if (manifestRecord.contentHash !== registryRecord.contentHash) {

[NoCoverage] BlockStatement
src/integrity/verify.ts:163:66
       entityId,
     });
   }
-  if (manifestRecord.contentHash !== registryRecord.contentHash) {
-    pushIssue(
-      issues,
-      "error",
-      "CONTENT_HASH_MISMATCH_BETWEEN_INDEXES",
-      "Manifest and registry contentHash differ",
-      { path: repoPath, entityId },
-    );
-  }
+  if (manifestRecord.contentHash !== registryRecord.contentHash) {}
   if (manifestRecord.gitSha !== registryRecord.gitSha) {
     pushIssue(

[NoCoverage] EqualityOperator
src/integrity/verify.ts:163:7
       entityId,
     });
   }
-  if (manifestRecord.contentHash !== registryRecord.contentHash) {
+  if (manifestRecord.contentHash === registryRecord.contentHash) {
     pushIssue(
       issues,

[NoCoverage] EqualityOperator
src/integrity/verify.ts:172:7
       { path: repoPath, entityId },
     );
   }
-  if (manifestRecord.gitSha !== registryRecord.gitSha) {
+  if (manifestRecord.gitSha === registryRecord.gitSha) {
     pushIssue(
       issues,

[NoCoverage] ConditionalExpression
src/integrity/verify.ts:172:7
       { path: repoPath, entityId },
     );
   }
-  if (manifestRecord.gitSha !== registryRecord.gitSha) {
+  if (true) {
     pushIssue(
       issues,

[NoCoverage] StringLiteral
src/integrity/verify.ts:175:7
   if (manifestRecord.gitSha !== registryRecord.gitSha) {
     pushIssue(
       issues,
-      "warning",
+      "",
       "GIT_SHA_MISMATCH_BETWEEN_INDEXES",
       "Manifest and registry gitSha differ",

[NoCoverage] StringLiteral
src/integrity/verify.ts:177:7
       issues,
       "warning",
       "GIT_SHA_MISMATCH_BETWEEN_INDEXES",
-      "Manifest and registry gitSha differ",
+      "",
       { path: repoPath, entityId },
     );

[NoCoverage] ObjectLiteral
src/integrity/verify.ts:178:7
       "warning",
       "GIT_SHA_MISMATCH_BETWEEN_INDEXES",
       "Manifest and registry gitSha differ",
-      { path: repoPath, entityId },
+      {},
     );
   }

[NoCoverage] ConditionalExpression
src/integrity/verify.ts:192:9
 
   for (const repoDir of managedDirectories) {
     const manifest = await loadDirectoryManifest(cwd, repoDir);
-    if (!manifest) {
+    if (true) {
       pushIssue(
         issues,

[NoCoverage] BlockStatement
src/integrity/verify.ts:192:20
 
   for (const repoDir of managedDirectories) {
     const manifest = await loadDirectoryManifest(cwd, repoDir);
-    if (!manifest) {
-      pushIssue(
-        issues,
-        "error",
-        "MISSING_DIRECTORY_MANIFEST",
-        "Managed directory is missing versions.json",
-        { path: repoDir },
-      );
-      continue;
-    }
+    if (!manifest) {}
     manifests.set(repoDir, manifest);
 

[NoCoverage] StringLiteral
src/integrity/verify.ts:196:9
       pushIssue(
         issues,
         "error",
-        "MISSING_DIRECTORY_MANIFEST",
+        "",
         "Managed directory is missing versions.json",
         { path: repoDir },

[NoCoverage] CallExpression
src/integrity/verify.ts:202:5
       );
       continue;
     }
-    manifests.set(repoDir, manifest);
+    ;
 
     if (manifest.$schemaVersion !== 1) {

[NoCoverage] ConditionalExpression
src/integrity/verify.ts:204:9
     }
     manifests.set(repoDir, manifest);
 
-    if (manifest.$schemaVersion !== 1) {
+    if (false) {
       pushIssue(
         issues,

[NoCoverage] EqualityOperator
src/integrity/verify.ts:204:9
     }
     manifests.set(repoDir, manifest);
 
-    if (manifest.$schemaVersion !== 1) {
+    if (manifest.$schemaVersion === 1) {
       pushIssue(
         issues,

[NoCoverage] ObjectLiteral
src/integrity/verify.ts:210:9
         "error",
         "INVALID_MANIFEST_SCHEMA_VERSION",
         "Manifest has unsupported $schemaVersion",
-        { path: repoDir },
+        {},
       );
     }

[NoCoverage] ConditionalExpression
src/integrity/verify.ts:213:9
         { path: repoDir },
       );
     }
-    if (manifest.directory !== repoDir) {
+    if (false) {
       pushIssue(
         issues,

[NoCoverage] EqualityOperator
src/integrity/verify.ts:213:9
         { path: repoDir },
       );
     }
-    if (manifest.directory !== repoDir) {
+    if (manifest.directory === repoDir) {
       pushIssue(
         issues,

[NoCoverage] StringLiteral
src/integrity/verify.ts:217:9
       pushIssue(
         issues,
         "error",
-        "MANIFEST_DIRECTORY_MISMATCH",
+        "",
         "Manifest directory field does not match directory path",
         { path: repoDir },

[NoCoverage] ConditionalExpression
src/integrity/verify.ts:222:9
         { path: repoDir },
       );
     }
-    if (!isIsoDateTime(manifest.generatedAt)) {
+    if (true) {
       pushIssue(
         issues,

[NoCoverage] BlockStatement
src/integrity/verify.ts:222:47
         { path: repoDir },
       );
     }
-    if (!isIsoDateTime(manifest.generatedAt)) {
-      pushIssue(
-        issues,
-        "error",
-        "INVALID_MANIFEST_GENERATED_AT",
-        "Manifest generatedAt is invalid",
-        { path: repoDir },
-      );
-    }
+    if (!isIsoDateTime(manifest.generatedAt)) {}
   }
 

[NoCoverage] StringLiteral
src/integrity/verify.ts:227:9
         issues,
         "error",
         "INVALID_MANIFEST_GENERATED_AT",
-        "Manifest generatedAt is invalid",
+        "",
         { path: repoDir },
       );

[NoCoverage] CallExpression
src/integrity/verify.ts:238:3
 
 export async function verifyIntegrity(cwd: string): Promise<VerifyReport> {
   const issues: VerifyIssue[] = [];
-  issues.push(...(await validateIntegrityJsonSchemas(cwd)));
+  ;
   const managedFiles = await discoverManagedFiles(cwd);
   const managedDirectories = await discoverManagedDirectories(cwd);

[NoCoverage] MethodExpression
src/integrity/verify.ts:245:26
   const paths = await loadPathsCurrent(cwd);
   const manifests = await loadExpectedManifests(cwd, managedDirectories, issues);
 
-  const activeEntities = Object.entries(entities).filter(
-    ([, entity]) => entity.status === "active",
-  );
+  const activeEntities = Object.entries(entities);
   const duplicateEntityIds = new Set<string>();
   const seenEntityIds = new Set<string>();

[NoCoverage] ConditionalExpression
src/integrity/verify.ts:246:21
   const manifests = await loadExpectedManifests(cwd, managedDirectories, issues);
 
   const activeEntities = Object.entries(entities).filter(
-    ([, entity]) => entity.status === "active",
+    ([, entity]) => true,
   );
   const duplicateEntityIds = new Set<string>();

[NoCoverage] ArrowFunction
src/integrity/verify.ts:246:5
   const manifests = await loadExpectedManifests(cwd, managedDirectories, issues);
 
   const activeEntities = Object.entries(entities).filter(
-    ([, entity]) => entity.status === "active",
+    () => undefined,
   );
   const duplicateEntityIds = new Set<string>();

[NoCoverage] BlockStatement
src/integrity/verify.ts:251:61
   const duplicateEntityIds = new Set<string>();
   const seenEntityIds = new Set<string>();
 
-  for (const [repoPath, entityId] of Object.entries(paths)) {
-    if (!managedFiles.includes(repoPath)) {
-      const exists = await pathExists(path.join(cwd, repoPath));
-      pushIssue(
-        issues,
-        exists ? "warning" : "error",
-        "UNEXPECTED_PATH_BINDING",
-        exists
-          ? "paths.current contains a binding for a file outside managed scope"
-          : "paths.current contains a binding for a missing file",
-        { path: repoPath, entityId },
-      );
-    }
-    if (seenEntityIds.has(entityId)) {
-      duplicateEntityIds.add(entityId);
-    }
-    seenEntityIds.add(entityId);
-  }
+  for (const [repoPath, entityId] of Object.entries(paths)) {}
 
   for (const entityId of duplicateEntityIds) {

[NoCoverage] BlockStatement
src/integrity/verify.ts:252:43
   const seenEntityIds = new Set<string>();
 
   for (const [repoPath, entityId] of Object.entries(paths)) {
-    if (!managedFiles.includes(repoPath)) {
-      const exists = await pathExists(path.join(cwd, repoPath));
-      pushIssue(
-        issues,
-        exists ? "warning" : "error",
-        "UNEXPECTED_PATH_BINDING",
-        exists
-          ? "paths.current contains a binding for a file outside managed scope"
-          : "paths.current contains a binding for a missing file",
-        { path: repoPath, entityId },
-      );
-    }
+    if (!managedFiles.includes(repoPath)) {}
     if (seenEntityIds.has(entityId)) {
       duplicateEntityIds.add(entityId);

[NoCoverage] BooleanLiteral
src/integrity/verify.ts:252:9
   const seenEntityIds = new Set<string>();
 
   for (const [repoPath, entityId] of Object.entries(paths)) {
-    if (!managedFiles.includes(repoPath)) {
+    if (managedFiles.includes(repoPath)) {
       const exists = await pathExists(path.join(cwd, repoPath));
       pushIssue(

[NoCoverage] StringLiteral
src/integrity/verify.ts:256:30
       const exists = await pathExists(path.join(cwd, repoPath));
       pushIssue(
         issues,
-        exists ? "warning" : "error",
+        exists ? "warning" : "",
         "UNEXPECTED_PATH_BINDING",
         exists

[NoCoverage] StringLiteral
src/integrity/verify.ts:256:18
       const exists = await pathExists(path.join(cwd, repoPath));
       pushIssue(
         issues,
-        exists ? "warning" : "error",
+        exists ? "" : "error",
         "UNEXPECTED_PATH_BINDING",
         exists

[NoCoverage] StringLiteral
src/integrity/verify.ts:259:13
         exists ? "warning" : "error",
         "UNEXPECTED_PATH_BINDING",
         exists
-          ? "paths.current contains a binding for a file outside managed scope"
+          ? ""
           : "paths.current contains a binding for a missing file",
         { path: repoPath, entityId },

[NoCoverage] ConditionalExpression
src/integrity/verify.ts:264:9
         { path: repoPath, entityId },
       );
     }
-    if (seenEntityIds.has(entityId)) {
+    if (false) {
       duplicateEntityIds.add(entityId);
     }

[NoCoverage] BlockStatement
src/integrity/verify.ts:264:38
         { path: repoPath, entityId },
       );
     }
-    if (seenEntityIds.has(entityId)) {
-      duplicateEntityIds.add(entityId);
-    }
+    if (seenEntityIds.has(entityId)) {}
     seenEntityIds.add(entityId);
   }

[NoCoverage] CallExpression
src/integrity/verify.ts:265:7
       );
     }
     if (seenEntityIds.has(entityId)) {
-      duplicateEntityIds.add(entityId);
+      ;
     }
     seenEntityIds.add(entityId);

[NoCoverage] CallExpression
src/integrity/verify.ts:267:5
     if (seenEntityIds.has(entityId)) {
       duplicateEntityIds.add(entityId);
     }
-    seenEntityIds.add(entityId);
+    ;
   }
 

[NoCoverage] BlockStatement
src/integrity/verify.ts:270:46
     seenEntityIds.add(entityId);
   }
 
-  for (const entityId of duplicateEntityIds) {
-    pushIssue(
-      issues,
-      "error",
-      "DUPLICATE_ACTIVE_ENTITY_ID",
-      "The same entityId is bound to multiple current paths",
-      { entityId },
-    );
-  }
+  for (const entityId of duplicateEntityIds) {}
 
   for (const file of managedFiles) {

[NoCoverage] StringLiteral
src/integrity/verify.ts:274:7
     pushIssue(
       issues,
       "error",
-      "DUPLICATE_ACTIVE_ENTITY_ID",
+      "",
       "The same entityId is bound to multiple current paths",
       { entityId },

[NoCoverage] BooleanLiteral
src/integrity/verify.ts:287:9
     const fileName = getManifestFileName(file);
     const manifest = manifests.get(repoDir);
 
-    if (!entityId) {
+    if (entityId) {
       pushIssue(
         issues,

[NoCoverage] BlockStatement
src/integrity/verify.ts:287:20
     const fileName = getManifestFileName(file);
     const manifest = manifests.get(repoDir);
 
-    if (!entityId) {
-      pushIssue(
-        issues,
-        "error",
-        "MISSING_PATH_BINDING",
-        "Managed file is missing from paths.current index",
-        { path: file },
-      );
-      continue;
-    }
+    if (!entityId) {}
 
     const entity = entities[entityId];

[NoCoverage] ObjectLiteral
src/integrity/verify.ts:293:9
         "error",
         "MISSING_PATH_BINDING",
         "Managed file is missing from paths.current index",
-        { path: file },
+        {},
       );
       continue;

[NoCoverage] BooleanLiteral
src/integrity/verify.ts:299:9
     }
 
     const entity = entities[entityId];
-    if (!entity) {
+    if (entity) {
       pushIssue(
         issues,

[NoCoverage] ConditionalExpression
src/integrity/verify.ts:299:9
     }
 
     const entity = entities[entityId];
-    if (!entity) {
+    if (false) {
       pushIssue(
         issues,
