[NoCoverage] StringLiteral
src/integrity/verify.ts:303:9
       pushIssue(
         issues,
         "error",
-        "MISSING_REGISTRY_ENTITY",
+        "",
         "Path binding points to absent registry entity",
         { path: file, entityId },

[NoCoverage] ObjectLiteral
src/integrity/verify.ts:305:9
         "error",
         "MISSING_REGISTRY_ENTITY",
         "Path binding points to absent registry entity",
-        { path: file, entityId },
+        {},
       );
       continue;

[NoCoverage] StringLiteral
src/integrity/verify.ts:310:33
       continue;
     }
 
-    validateRecordShape(issues, "registry", entity, file, entityId);
+    validateRecordShape(issues, "", entity, file, entityId);
 
     if (!manifest) continue;

[NoCoverage] BooleanLiteral
src/integrity/verify.ts:312:9
 
     validateRecordShape(issues, "registry", entity, file, entityId);
 
-    if (!manifest) continue;
+    if (manifest) continue;
 
     const manifestRecord = manifest.files[fileName];

[NoCoverage] ConditionalExpression
src/integrity/verify.ts:312:9
 
     validateRecordShape(issues, "registry", entity, file, entityId);
 
-    if (!manifest) continue;
+    if (false) continue;
 
     const manifestRecord = manifest.files[fileName];

[NoCoverage] BlockStatement
src/integrity/verify.ts:315:26
     if (!manifest) continue;
 
     const manifestRecord = manifest.files[fileName];
-    if (!manifestRecord) {
-      pushIssue(
-        issues,
-        "error",
-        "MISSING_MANIFEST_RECORD",
-        "Managed file is missing from its directory manifest",
-        { path: file, entityId },
-      );
-      continue;
-    }
+    if (!manifestRecord) {}
 
     validateRecordShape(issues, "manifest", manifestRecord, file, entityId);

[NoCoverage] ConditionalExpression
src/integrity/verify.ts:315:9
     if (!manifest) continue;
 
     const manifestRecord = manifest.files[fileName];
-    if (!manifestRecord) {
+    if (true) {
       pushIssue(
         issues,

[NoCoverage] ObjectLiteral
src/integrity/verify.ts:321:9
         "error",
         "MISSING_MANIFEST_RECORD",
         "Managed file is missing from its directory manifest",
-        { path: file, entityId },
+        {},
       );
       continue;

[NoCoverage] ConditionalExpression
src/integrity/verify.ts:328:9
 
     validateRecordShape(issues, "manifest", manifestRecord, file, entityId);
 
-    if (manifestRecord.entityId !== entityId) {
+    if (true) {
       pushIssue(
         issues,

[NoCoverage] BlockStatement
src/integrity/verify.ts:328:47
 
     validateRecordShape(issues, "manifest", manifestRecord, file, entityId);
 
-    if (manifestRecord.entityId !== entityId) {
-      pushIssue(
-        issues,
-        "error",
-        "ENTITY_ID_MISMATCH",
-        "Manifest record entityId differs from paths.current binding",
-        { path: file, entityId },
-      );
-    }
+    if (manifestRecord.entityId !== entityId) {}
 
     compareManifestAndRegistry(issues, file, manifestRecord, entity);

[NoCoverage] StringLiteral
src/integrity/verify.ts:332:9
       pushIssue(
         issues,
         "error",
-        "ENTITY_ID_MISMATCH",
+        "",
         "Manifest record entityId differs from paths.current binding",
         { path: file, entityId },

[NoCoverage] StringLiteral
src/integrity/verify.ts:333:9
         issues,
         "error",
         "ENTITY_ID_MISMATCH",
-        "Manifest record entityId differs from paths.current binding",
+        "",
         { path: file, entityId },
       );

[NoCoverage] ObjectLiteral
src/integrity/verify.ts:334:9
         "error",
         "ENTITY_ID_MISMATCH",
         "Manifest record entityId differs from paths.current binding",
-        { path: file, entityId },
+        {},
       );
     }

[NoCoverage] CallExpression
src/integrity/verify.ts:338:5
       );
     }
 
-    compareManifestAndRegistry(issues, file, manifestRecord, entity);
+    ;
 
     const actualHash = await byteHashFile(absPath);

[NoCoverage] ConditionalExpression
src/integrity/verify.ts:341:9
     compareManifestAndRegistry(issues, file, manifestRecord, entity);
 
     const actualHash = await byteHashFile(absPath);
-    if (actualHash !== entity.contentHash) {
+    if (false) {
       pushIssue(
         issues,

[NoCoverage] ConditionalExpression
src/integrity/verify.ts:341:9
     compareManifestAndRegistry(issues, file, manifestRecord, entity);
 
     const actualHash = await byteHashFile(absPath);
-    if (actualHash !== entity.contentHash) {
+    if (true) {
       pushIssue(
         issues,

[NoCoverage] StringLiteral
src/integrity/verify.ts:346:9
         issues,
         "error",
         "HASH_MISMATCH_REGISTRY",
-        "Actual file hash differs from registry hash",
+        "",
         { path: file, entityId },
       );

[NoCoverage] ObjectLiteral
src/integrity/verify.ts:347:9
         "error",
         "HASH_MISMATCH_REGISTRY",
         "Actual file hash differs from registry hash",
-        { path: file, entityId },
+        {},
       );
     }

[NoCoverage] EqualityOperator
src/integrity/verify.ts:350:9
         { path: file, entityId },
       );
     }
-    if (actualHash !== manifestRecord.contentHash) {
+    if (actualHash === manifestRecord.contentHash) {
       pushIssue(
         issues,

[NoCoverage] ConditionalExpression
src/integrity/verify.ts:350:9
         { path: file, entityId },
       );
     }
-    if (actualHash !== manifestRecord.contentHash) {
+    if (true) {
       pushIssue(
         issues,

[NoCoverage] StringLiteral
src/integrity/verify.ts:354:9
       pushIssue(
         issues,
         "error",
-        "HASH_MISMATCH_MANIFEST",
+        "",
         "Actual file hash differs from manifest hash",
         { path: file, entityId },

[NoCoverage] StringLiteral
src/integrity/verify.ts:367:35
       const entity = entities[manifestRecord.entityId];
       const hasFile = managedFiles.includes(repoPath);
 
-      validateRecordShape(issues, "manifest", manifestRecord, repoPath, manifestRecord.entityId);
+      validateRecordShape(issues, "", manifestRecord, repoPath, manifestRecord.entityId);
 
       if (!hasFile) {

[NoCoverage] ConditionalExpression
src/integrity/verify.ts:369:11
 
       validateRecordShape(issues, "manifest", manifestRecord, repoPath, manifestRecord.entityId);
 
-      if (!hasFile) {
+      if (false) {
         const exists = await pathExists(path.join(cwd, repoPath));
         pushIssue(

[NoCoverage] ConditionalExpression
src/integrity/verify.ts:369:11
 
       validateRecordShape(issues, "manifest", manifestRecord, repoPath, manifestRecord.entityId);
 
-      if (!hasFile) {
+      if (true) {
         const exists = await pathExists(path.join(cwd, repoPath));
         pushIssue(

[NoCoverage] StringLiteral
src/integrity/verify.ts:376:15
           exists ? "warning" : "error",
           "STALE_MANIFEST_RECORD",
           exists
-            ? "Manifest record points to an existing file outside managed scope"
+            ? ""
             : "Manifest record points to a missing file",
           { path: repoPath, entityId: manifestRecord.entityId },

[NoCoverage] ObjectLiteral
src/integrity/verify.ts:378:11
           exists
             ? "Manifest record points to an existing file outside managed scope"
             : "Manifest record points to a missing file",
-          { path: repoPath, entityId: manifestRecord.entityId },
+          {},
         );
       }

[NoCoverage] ConditionalExpression
src/integrity/verify.ts:382:11
         );
       }
 
-      if (!entity) {
+      if (true) {
         pushIssue(
           issues,

[NoCoverage] BooleanLiteral
src/integrity/verify.ts:382:11
         );
       }
 
-      if (!entity) {
+      if (entity) {
         pushIssue(
           issues,

[NoCoverage] StringLiteral
src/integrity/verify.ts:387:11
           issues,
           "error",
           "MANIFEST_ENTITY_MISSING_IN_REGISTRY",
-          "Manifest record points to missing registry entity",
+          "",
           { path: repoPath, entityId: manifestRecord.entityId },
         );

[NoCoverage] ObjectLiteral
src/integrity/verify.ts:388:11
           "error",
           "MANIFEST_ENTITY_MISSING_IN_REGISTRY",
           "Manifest record points to missing registry entity",
-          { path: repoPath, entityId: manifestRecord.entityId },
+          {},
         );
       }

[NoCoverage] StringLiteral
src/integrity/verify.ts:395:33
   }
 
   for (const [entityId, entity] of activeEntities) {
-    validateRecordShape(issues, "registry", entity, entity.currentPath, entityId);
+    validateRecordShape(issues, "", entity, entity.currentPath, entityId);
 
     if (!managedFiles.includes(entity.currentPath)) {

[NoCoverage] ConditionalExpression
src/integrity/verify.ts:397:9
   for (const [entityId, entity] of activeEntities) {
     validateRecordShape(issues, "registry", entity, entity.currentPath, entityId);
 
-    if (!managedFiles.includes(entity.currentPath)) {
+    if (true) {
       const exists = await pathExists(path.join(cwd, entity.currentPath));
       pushIssue(

[NoCoverage] ConditionalExpression
src/integrity/verify.ts:397:9
   for (const [entityId, entity] of activeEntities) {
     validateRecordShape(issues, "registry", entity, entity.currentPath, entityId);
 
-    if (!managedFiles.includes(entity.currentPath)) {
+    if (false) {
       const exists = await pathExists(path.join(cwd, entity.currentPath));
       pushIssue(

[NoCoverage] BlockStatement
src/integrity/verify.ts:410:49
       );
     }
 
-    if (paths[entity.currentPath] !== entityId) {
-      pushIssue(
-        issues,
-        "error",
-        "REGISTRY_PATH_NOT_BOUND",
-        "Active registry entity currentPath is not correctly bound in paths.current",
-        { path: entity.currentPath, entityId },
-      );
-    }
+    if (paths[entity.currentPath] !== entityId) {}
   }
 

[NoCoverage] EqualityOperator
src/integrity/verify.ts:410:9
       );
     }
 
-    if (paths[entity.currentPath] !== entityId) {
+    if (paths[entity.currentPath] === entityId) {
       pushIssue(
         issues,

[NoCoverage] StringLiteral
src/integrity/verify.ts:415:9
         issues,
         "error",
         "REGISTRY_PATH_NOT_BOUND",
-        "Active registry entity currentPath is not correctly bound in paths.current",
+        "",
         { path: entity.currentPath, entityId },
       );

[NoCoverage] ObjectLiteral
src/integrity/verify.ts:416:9
         "error",
         "REGISTRY_PATH_NOT_BOUND",
         "Active registry entity currentPath is not correctly bound in paths.current",
-        { path: entity.currentPath, entityId },
+        {},
       );
     }

[NoCoverage] MethodExpression
src/integrity/verify.ts:422:3
   }
 
   const collator = new Intl.Collator("en");
-  issues.sort((a, b) => {
-    if (a.level !== b.level) return a.level === "error" ? -1 : 1;
-    if ((a.code ?? "") !== (b.code ?? "")) return collator.compare(a.code ?? "", b.code ?? "");
-    if ((a.path ?? "") !== (b.path ?? "")) return collator.compare(a.path ?? "", b.path ?? "");
-    return collator.compare(a.entityId ?? "", b.entityId ?? "");
-  });
+  issues;
 
   const stats: VerifyStats = {

[NoCoverage] BlockStatement
src/integrity/verify.ts:422:25
   }
 
   const collator = new Intl.Collator("en");
-  issues.sort((a, b) => {
-    if (a.level !== b.level) return a.level === "error" ? -1 : 1;
-    if ((a.code ?? "") !== (b.code ?? "")) return collator.compare(a.code ?? "", b.code ?? "");
-    if ((a.path ?? "") !== (b.path ?? "")) return collator.compare(a.path ?? "", b.path ?? "");
-    return collator.compare(a.entityId ?? "", b.entityId ?? "");
-  });
+  issues.sort((a, b) => {});
 
   const stats: VerifyStats = {

[NoCoverage] ConditionalExpression
src/integrity/verify.ts:423:37
 
   const collator = new Intl.Collator("en");
   issues.sort((a, b) => {
-    if (a.level !== b.level) return a.level === "error" ? -1 : 1;
+    if (a.level !== b.level) return true ? -1 : 1;
     if ((a.code ?? "") !== (b.code ?? "")) return collator.compare(a.code ?? "", b.code ?? "");
     if ((a.path ?? "") !== (b.path ?? "")) return collator.compare(a.path ?? "", b.path ?? "");

[NoCoverage] EqualityOperator
src/integrity/verify.ts:423:37
 
   const collator = new Intl.Collator("en");
   issues.sort((a, b) => {
-    if (a.level !== b.level) return a.level === "error" ? -1 : 1;
+    if (a.level !== b.level) return a.level !== "error" ? -1 : 1;
     if ((a.code ?? "") !== (b.code ?? "")) return collator.compare(a.code ?? "", b.code ?? "");
     if ((a.path ?? "") !== (b.path ?? "")) return collator.compare(a.path ?? "", b.path ?? "");

[NoCoverage] EqualityOperator
src/integrity/verify.ts:424:9
   const collator = new Intl.Collator("en");
   issues.sort((a, b) => {
     if (a.level !== b.level) return a.level === "error" ? -1 : 1;
-    if ((a.code ?? "") !== (b.code ?? "")) return collator.compare(a.code ?? "", b.code ?? "");
+    if ((a.code ?? "") === (b.code ?? "")) return collator.compare(a.code ?? "", b.code ?? "");
     if ((a.path ?? "") !== (b.path ?? "")) return collator.compare(a.path ?? "", b.path ?? "");
     return collator.compare(a.entityId ?? "", b.entityId ?? "");

[NoCoverage] LogicalOperator
src/integrity/verify.ts:424:10
   const collator = new Intl.Collator("en");
   issues.sort((a, b) => {
     if (a.level !== b.level) return a.level === "error" ? -1 : 1;
-    if ((a.code ?? "") !== (b.code ?? "")) return collator.compare(a.code ?? "", b.code ?? "");
+    if ((a.code && "") !== (b.code ?? "")) return collator.compare(a.code ?? "", b.code ?? "");
     if ((a.path ?? "") !== (b.path ?? "")) return collator.compare(a.path ?? "", b.path ?? "");
     return collator.compare(a.entityId ?? "", b.entityId ?? "");

[NoCoverage] LogicalOperator
src/integrity/verify.ts:425:10
   issues.sort((a, b) => {
     if (a.level !== b.level) return a.level === "error" ? -1 : 1;
     if ((a.code ?? "") !== (b.code ?? "")) return collator.compare(a.code ?? "", b.code ?? "");
-    if ((a.path ?? "") !== (b.path ?? "")) return collator.compare(a.path ?? "", b.path ?? "");
+    if ((a.path && "") !== (b.path ?? "")) return collator.compare(a.path ?? "", b.path ?? "");
     return collator.compare(a.entityId ?? "", b.entityId ?? "");
   });

[NoCoverage] ConditionalExpression
src/integrity/verify.ts:425:9
   issues.sort((a, b) => {
     if (a.level !== b.level) return a.level === "error" ? -1 : 1;
     if ((a.code ?? "") !== (b.code ?? "")) return collator.compare(a.code ?? "", b.code ?? "");
-    if ((a.path ?? "") !== (b.path ?? "")) return collator.compare(a.path ?? "", b.path ?? "");
+    if (false) return collator.compare(a.path ?? "", b.path ?? "");
     return collator.compare(a.entityId ?? "", b.entityId ?? "");
   });

[NoCoverage] LogicalOperator
src/integrity/verify.ts:426:47
     if (a.level !== b.level) return a.level === "error" ? -1 : 1;
     if ((a.code ?? "") !== (b.code ?? "")) return collator.compare(a.code ?? "", b.code ?? "");
     if ((a.path ?? "") !== (b.path ?? "")) return collator.compare(a.path ?? "", b.path ?? "");
-    return collator.compare(a.entityId ?? "", b.entityId ?? "");
+    return collator.compare(a.entityId ?? "", b.entityId && "");
   });
 

[NoCoverage] LogicalOperator
src/integrity/verify.ts:426:29
     if (a.level !== b.level) return a.level === "error" ? -1 : 1;
     if ((a.code ?? "") !== (b.code ?? "")) return collator.compare(a.code ?? "", b.code ?? "");
     if ((a.path ?? "") !== (b.path ?? "")) return collator.compare(a.path ?? "", b.path ?? "");
-    return collator.compare(a.entityId ?? "", b.entityId ?? "");
+    return collator.compare(a.entityId && "", b.entityId ?? "");
   });
 

[NoCoverage] MethodExpression
src/integrity/verify.ts:435:13
     manifestsLoaded: manifests.size,
     activeEntities: activeEntities.length,
     activePathBindings: Object.keys(paths).length,
-    errors: issues.filter((issue) => issue.level === "error").length,
+    errors: issues.length,
     warnings: issues.filter((issue) => issue.level === "warning").length,
   };

[NoCoverage] ArrowFunction
src/integrity/verify.ts:435:27
     manifestsLoaded: manifests.size,
     activeEntities: activeEntities.length,
     activePathBindings: Object.keys(paths).length,
-    errors: issues.filter((issue) => issue.level === "error").length,
+    errors: issues.filter(() => undefined).length,
     warnings: issues.filter((issue) => issue.level === "warning").length,
   };

[NoCoverage] MethodExpression
src/integrity/verify.ts:436:15
     activeEntities: activeEntities.length,
     activePathBindings: Object.keys(paths).length,
     errors: issues.filter((issue) => issue.level === "error").length,
-    warnings: issues.filter((issue) => issue.level === "warning").length,
+    warnings: issues.length,
   };
 

[NoCoverage] ConditionalExpression
src/integrity/verify.ts:436:40
     activeEntities: activeEntities.length,
     activePathBindings: Object.keys(paths).length,
     errors: issues.filter((issue) => issue.level === "error").length,
-    warnings: issues.filter((issue) => issue.level === "warning").length,
+    warnings: issues.filter((issue) => false).length,
   };
 

[NoCoverage] ConditionalExpression
src/integrity/verify.ts:439:16
     warnings: issues.filter((issue) => issue.level === "warning").length,
   };
 
-  return { ok: stats.errors === 0, issues, stats };
+  return { ok: false, issues, stats };
 }
 

[NoCoverage] ConditionalExpression
src/integrity/verify.ts:439:16
     warnings: issues.filter((issue) => issue.level === "warning").length,
   };
 
-  return { ok: stats.errors === 0, issues, stats };
+  return { ok: true, issues, stats };
 }
 
