[Survived] StringLiteral
src/integrity/module.ts:21:14
 // the full workflow: build record → sign → verify release.
 export const STANDARD_INTEGRITY_PIPELINE: KernelPipelineStep[] = [
   { command: "integrity.build-record" },
-  { command: "integrity.sign" },
+  { command: "" },
   { command: "integrity.verify-release" },
 ];
